{"title":"POtHS - Nibiru is Almost Here - Fact or Fiction","uid":8696942,"size":8345768011,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:005535abdc80b65b98ffd2524c822101402c05fd&amp;dn=POtHS+-+Nibiru+is+Almost+Here+-+Fact+or+Fiction&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"POtHS11","files":-1,"time":1373988444,"description":" PO t HS\n\nPouring Out the Holy Spirit\n\nNibiru is Almost Here - Fact or Fiction\n\n\nPOtHS Comment:  I will believe it when I see it with my own eyes.\n\nThe Nibiru cataclysm is a supposed disastrous encounter between the Earth and a large planetary object (either a collision or a near-miss) which certain groups believe will take place in the early 21st century. Believers in this doomsday event usually refer to this object as Planet X or Nibiru. The idea that a planet-sized object will collide with or pass by Earth in the near future is not supported by any scientific evidence and has been rejected as pseudoscience by astronomers and planetary scientists.\n\nThe idea was first put forward in 1995 by Nancy Lieder,founder of the website ZetaTalk. Lieder describes herself as a contactee with the ability to receive messages from extra-terrestrials from the Zeta Reticuli star system through an implant in her brain. She states that she was chosen to warn mankind that the object would sweep through the inner Solar System in May 2003 (though that date was later abandoned) causing Earth to undergo a pole shift that would destroy most of humanity. The prediction has subsequently spread beyond Lieder's website and has been embraced by numerous Internet doomsday groups, most of which linked the event to the 2012 phenomenon. Although the name &quot;Nibiru&quot; is derived from the works of the late ancient astronaut writer Zecharia Sitchin and his interpretations of Babylonian and Sumerian mythology, Sitchin denied any connection between his work and various claims of a coming apocalypse.\n\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\nRAPtURE (My transportation outta here).\n\nThe Blessed Hope.  If you believe in The Rapture you better believe The Above Statement and that the Sacrificed Blood of Jesus, on the Cross paid for your sins and there is NOTHING Else you can do to gain Salvation, The GRACE of Christ did it ALL. Now you just have to believe that with all your Heart, Mind and Soul or Maybe Get Left Behind. All PAST, Present and Future Sins are Forgiven with Jesus. (I wouldn't PUSH That Future sin statement to much!!!)\n\nIn a moment, in the twinkling of an eye, at the last trump: for the trumpet shall sound, and the dead shall be raised incorruptible, and we shall be changed...\n\n&quot;And He will send forth His angels with A GREAT TRUMPET and THEY WILL GATHER TOGETHER His elect from the four winds, from one end of the sky to the other.\n\n&quot;Do not marvel at this; for an hour is coming, in which all who are in the tombs will hear His voice,  Then we who are alive and remain will be caught up together with them in the clouds to meet the Lord in The Air, and there we will be forever be with him...hmmm sounds like some of us might be Immortal. (Ask your preacher about that)\n\nMore Torrents in this series at http://conspiracyhub.com/membershares.php?it=41 ALL TORRENTS are RELEASED here FIRST!!! The First down loaders of my torrents get the Main Hookups on my SERVER. This will get lightning fast downloads, FOR FREE. (The High Speed download wholesalers are going to hate me)I upload to OVER 13 Torrent sites and this site is uploaded 1st.\n\n\nMay Yahweh Bless You as He has me. Seed long and Prosper from the Blessings of our Lord. I have asked the Father to Bless all those that Seed Long.  \n\nDo Not believe anything you find here, search the Scriptures daily to determine the TRUTH.  Other Torrents in this Series at\n\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n      :thankyou:    :thankyou:     Thank You JESUS  \n\n  ","torrent":{"xt":"urn:btih:005535abdc80b65b98ffd2524c822101402c05fd","amp;dn":"POtHS+-+Nibiru+is+Almost+Here+-+Fact+or+Fiction","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"005535abdc80b65b98ffd2524c822101402c05fd","infoHashBuffer":{"type":"Buffer","data":[0,85,53,171,220,128,182,91,152,255,210,82,76,130,33,1,64,44,5,253]},"announce":[],"urlList":[]}}