{"title":"Brothers  por memitoxxx etorrents.org ( ingles -+ sub latino )dv","uid":5642993,"size":4509728768,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:00bec8d5f1734c899f7fe28d0b74a2c3951d7a80&amp;dn=Brothers++por+memitoxxx+etorrents.org+%28+ingles+-%2B+sub+latino+%29dv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"memitoxxx","files":-1,"time":1277188078,"description":"Directed by \tJim Sheridan\nProduced by \tMichael DeLuca\nJoni Sighvatsson\nRyan Kavanaugh\nWritten by \tDavid Benioff\nStarring \tTobey Maguire\nJake Gyllenhaal\nNatalie Portman\nSam Shepard\nClifton Collins, Jr.\nMare Winningham\nBailee Madison\nTaylor Grace Geare\nMusic by \tThomas Newman\nCinematography \tFrederick Elmes\nEditing by \tJay Cassidy\nStudio \tRelativity Media\nDistributed by \tLionsgate\nRelease date(s) \tDecember 3, 2009 (2009-12-03) (Israel)\nDecember 4, 2009\nRunning time \t105 min.\nCountry \tUnited States\nLanguage \tEnglish, \nBudget \t$26 million\nGross revenue \t$39,015,171 \n\nTommy Cahill (Jake Gyllenhaal) and Sam Cahill (Tobey Maguire) are siblings. A Marine captain about to embark on his fourth tour of duty, Sam is a steadfast family man married to his high school sweetheart, Grace (Natalie Portman), with whom he has two young daughters, Isabelle and Maggie (Bailee Madison, Taylor Grace Geare). The film opens with Tommy being released from jail for armed robbery, not long before Sam departs for Afghanistan in October, 2007.\n\nSoon news comes that Sam's helicopter has crashed over the water, killing all of the Marines aboard. In reality, he and a hometown friend, Private Joe Willis (Patrick Flueger), have been taken prisoner in a mountain village. With Sam &quot;gone,&quot; Tommy attempts to redeem himself in the eyes of his family by wrangling old friends to help with kitchen repairs for Grace and the kids. Grace slowly sheds her previous resentment towards her brother-in-law.\n\nAs months pass, Grace and Tommy bond over their mutual mourning, culminating in a passionate fireside kiss. They regret it afterward, and do not take this attraction any further, though Tommy continues to win the favor of his nieces. Meanwhile, Sam and Joe are abused and tortured by guerrilla fighters, forced to make videotaped dismissals of the military and their mission, though only Joe cracks. The captors eventually deem him useless and force Sam, at gunpoint, to beat Joe to death with a lead pipe. Sometime later, Sam is rescued.\n\nSam returns home, clearly traumatized by his experience. He drifts through encounters in a cold, paranoid daze, refuses to explain to his family what happened while he was in Afghanistan, and lies to Joe's widow that he does not know how Joe died. He also believes Tommy and Grace had a sexual relationship in his absence. During Maggie's birthday party, a resentful and jealous Isabelle claims that Sam's paranoid assumptions are true: that Tommy and Grace slept together. Sam snaps, destroying the newly remodeled kitchen and pulling a gun on Tommy. The police arrive, and after a frantic confrontation in which Sam nearly commits suicide, Sam surrenders.\n\nSam is admitted to a mental hospital. Grace visits him and tells him that if he does not tell her what is tormenting him, he will lose her forever. Faced with this decision, Sam finally opens up about the source of his pain, confiding in her that he killed Joe and they embrace. A letter between husband and wife is read in voice over, with Sam wondering if he will be able to continue living a normal life.\n\n\n\nIMAGENES\nhttp://img42.imageshack.us/img42/6339/brothersposter.jpg\nhttp://img46.imageshack.us/img46/6876/98354657.png\nhttp://img97.imageshack.us/img97/3756/78251074.png\nhttp://img341.imageshack.us/img341/6007/11825372.png\n","torrent":{"xt":"urn:btih:00bec8d5f1734c899f7fe28d0b74a2c3951d7a80","amp;dn":"Brothers++por+memitoxxx+etorrents.org+%28+ingles+-%2B+sub+latino+%29dv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00bec8d5f1734c899f7fe28d0b74a2c3951d7a80","infoHashBuffer":{"type":"Buffer","data":[0,190,200,213,241,115,76,137,159,127,226,141,11,116,162,195,149,29,122,128]},"announce":[],"urlList":[]}}