{"title":"Anally.Drilled.DiSC2.XXX.DVDRip.x264-CHiKANi","uid":8752083,"size":1877170548,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:014bc37f56ea8707a14d534c6076cfc9137fc4c1&amp;dn=Anally.Drilled.DiSC2.XXX.DVDRip.x264-CHiKANi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xxxlavalxxx","files":-1,"time":1375053505,"description":"Studio: Evil Angel \nCategories: Anal , POV  \nDirector: Mike Adriano  \nStarring: Aimee Black , Maxine X , Kristen Jordan , Lucky Starr , Sierra Sanders , Mia Rider , Mike Adriano , Natalia Moore  \n\nWhen a gorgeous porn starlet shows up for an on-camera fuck, she doesn't always know what to expect. But when her director is the notoriously butt-obsessed Mike Adriano, she can count on getting her ass bored out! In the double-disc 'Anally Drilled,' Mike's up-close 'POV+' camerawork showcases his ruthless, in-depth style of rectal exploration. The director puts his penetrating 'power tool' to full use in five filthy scenes plus an epic bonus blow job, all featuring plenty of gaping assholes and nasty ass-to-mouth cocksucking. Bodaciously buxom Mia Rider and sassy, bronzed Lucky Starr are two cock-hungry Asian cuties in lacy lingerie. Mike fills the girls' buttholes with butter and stuffs them full of stiff dick. Exotic, busty babe Maxine X exposes her thick, meaty ass and gags on the director's member, squeezing his shaft between her knockers. She even tongues Mike's bunghole before getting her rectum reamed!\n\n Long-legged blonde newbie Kristen Jordan takes a ferocious butt fuck that leaves her sphincter bruised and dilated. Sweet, petite, tattooed Aimee Black's greased-up buns get sodomized and splattered in sperm. Pale, curvaceous cutie Sierra Sanders spreads her thick, meaty buttocks for Mike's probing tongue. After an orifice-stretching session of intense buggery, Sierra enjoys a messy oral cum shot. A bonus oral session with all-natural young brunette Natalie Moore climaxes in an attempt at anal penetration that proves too intense for the beautiful model. The perverse action in 'Anally Drilled' is raw, stylish backdoor erotica from start to finish - you know the drill!","torrent":{"xt":"urn:btih:014bc37f56ea8707a14d534c6076cfc9137fc4c1","amp;dn":"Anally.Drilled.DiSC2.XXX.DVDRip.x264-CHiKANi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"014bc37f56ea8707a14d534c6076cfc9137fc4c1","infoHashBuffer":{"type":"Buffer","data":[1,75,195,127,86,234,135,7,161,77,83,76,96,118,207,201,19,127,196,193]},"announce":[],"urlList":[]}}