{"title":"Gurf Morlix...Cut N Shoot(2004)[FLAC]","uid":5597902,"size":281292516,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:028d95b1279a41bf672951acee7e1e9d9b6de18e&amp;dn=Gurf+Morlix...Cut+N+Shoot%282004%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"dickspic","files":17,"time":1275116290,"description":"Audio CD (April 20, 2004) \nOriginal Release Date: April 20, 2004 \nNumber of Discs: 1 \nLabel: Blue Corn Music \nASIN: B0001LYFLI \n\n    \n1. Yesterday She Didn't  \n2. Were You Lyin' Down?   \n3. Ten Years of Love   \n4. Without You  \n5. Whole Truth  \n6. Me &amp; You \n7. I'll Change   \n8. Where There Is Smoke \n9. Girl Like You \n10. Lost Without You  \n11. Grabbin' for Love  \n12. Your Sister  \n13. They're Hangin' Me Tonight\n\nIf you want more Nashville slick, you'll have to go elsewhere. Gurf Morlix's &quot;Cut &amp; Shoot&quot; is down home country that sets your toe tapping, warms your heart a bit, and puts a smile on your face. From the opener &quot;Yesterday She Didn't&quot; he takes a fairly simple lyric with a fairly simple tune and it simply works quite well, &quot;Yesterday she didn't, today she does, what I've been dreaming became what was, now I'm in heaven &amp; it's all because yesterday she didn't but today she does!&quot; My favorite track &quot;Were You Lyin' Down?&quot; takes a similar lyrical twist &amp; sets your toe tapping with some excellent guitar picking, &quot;Did you leave your lipstick on his coffee cup? You got me feeling like a lonely pup. Were you lying down when you stood me up?&quot; &quot;Ten Years of Love&quot; is an excellent tune with a great breakup lyric. &quot;The Whole Truth&quot; is another great toe tapper with an almost country-polka beat, &quot;I got half a mind to tell the whole truth.&quot; On &quot;I'll Change,&quot; Gurf does his Hank Williams vocal with his voice cracking into the upper range on a clunky lyric that makes it seem more heartfelt &amp; unpretentious, &quot;I'll change to win back your love, I'll rearrange the stars above, whatever it takes to do what I'm dreaming of.&quot; &quot;Where There Is Smoke&quot; written with Jim Lauderdale is another delightful midtempo tune. &quot;Your Sister&quot; is a gumdrop of a ballad with another humorous lyric that reflects Gurf's dry sense of humor, &quot;I'm gonna have to sleep with your sister; Since we broke up, I sure have missed her; I might even get a blister, but I'm gonna have to sleep with your sister.&quot; You remember the old saying, &quot;Man's reach must exceed his grasp or what is a heaven for?&quot; Well, Gurf, he don't reach all that far, but his grasp well exceeds his talent and results in this delightful set. None of these tunes will sound startlingly new. However, on a generation of Nashville slick in country music, it's nice to go back to country roots. Enjoy! \n\ncd ripped by dBpoweramp\n\nplease seed  \n","torrent":{"xt":"urn:btih:028d95b1279a41bf672951acee7e1e9d9b6de18e","amp;dn":"Gurf+Morlix...Cut+N+Shoot%282004%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"028d95b1279a41bf672951acee7e1e9d9b6de18e","infoHashBuffer":{"type":"Buffer","data":[2,141,149,177,39,154,65,191,103,41,81,172,238,126,30,157,155,109,225,142]},"announce":[],"urlList":[]}}