{"title":"Brillig - 3 Albums (2007-2009)","uid":5491193,"size":160056078,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0303540d56e35c600bd948e22de0f756658aa3bf&amp;dn=Brillig+-+3+Albums+%282007-2009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"zhmuplik","files":37,"time":1271009346,"description":"* BRILLIG BIOGRAPHY\n\n&quot;If you know what Cohen, Cash, Cave, &amp; The Cure \nhave in common, it's right here&quot; - Periplaneta, Germany\n\n\nCombining sea shanties, murder ballads, tender tales of lost love &amp; lost life, Brillig's inimitable style is enchantingly melancholic, beautifully tragic, and... strangely uplifting...!\n\nWith a deliciously dark look &amp; captivating stage presence, Brillig draws their audience in with infectious melodies and sweet harmonies. This dreamily romantic style draw influence from such noted songwriters &amp; storytellers as Nick Cave, The Decemberists, Leonard Cohen &amp; Neil Young. The result appeals to fans of all ages and genres.\n\nDriven by the vocal harmony &amp; interplay between lead singers and multi-instrumentalists Matt Swayne &amp; Elizabeth Reid, Brillig's trademark sound features a graceful combination of acoustic guitar, viola, autoharp, harmonica, banjo, piano accordion and ukulele. Bassist Denni Meredith combines thoughtful melody with smooth rhythm, while drummer Ben Macklin (ex-Bit By Bats) adds his subtle percussive style. \n\nBrillig perform as a duo, trio and full four-piece band, and suit any stage, intimate or immense. This versatility has seen them play to diverse audiences in theatres (e.g. Schauspielhaus in Leipzig, Germany), main festival stages (e.g. Semaphore Music Fest, Fleurieu Folk Fest SA), outdoor events (e.g. Garden of Unearthly Delights, Whitmore Square Arts Fair SA), and infamous venues across Australia &amp; Europe.\n\nBrillig has also supported such acclaimed acts as The Audreys, CW Stoneking, Ned Collette, Mick Thomas, The Handsome Family (USA), Sime Nugent, Martin Martini &amp; The Bone Palace Orchestra, &amp; many more.\n\nEarlier recordings have earned airplay on national tastemaker stations (e.g. Triple J,FBi, 4ZzZ) and numerous 1 hits on Three D Radio. Brillig have also had widespread international airplay, and reached 2 on the Italian Alternative Chart alongside \nInterpol &amp; The Editors (Oct '07).\n\nSigned to Germany's Black Rain indie label for European releases, whilst remaining independent in Australia, Brillig released their debut acoustic album &quot;The Red Coats&quot; across Europe, UK, Russia and North America in June 2009. The 12 track LP was recorded by famed South Australian producer Matt Hills (Wolf &amp; Cub, The Lucksmiths), and its overseas release coincided with tour dates in Berlin &amp; Prague and an international festival debut in Leipzig (Germany), where Brillig received a standing ovation. \n\n&quot;The Red Coats&quot; has been attracting incredible reviews, and over the last few months Brillig has been enjoying interviews in numerous glossy magazines and airplay across the globe, including Germany, Australia, UK, Spain, Belgium, Italy, France, Russia, Czech Republic, The Netherlands, USA, Switzerland, Portugal &amp; more. The Australian edition of the LP is scheduled for release at the Adelaide Fringe Festival 2010..\n\nAlbums:\n(2007) Mirror on the Wall\n(2007) The Plagiarist (CDM)\n(2009) The Red Coats\n","torrent":{"xt":"urn:btih:0303540d56e35c600bd948e22de0f756658aa3bf","amp;dn":"Brillig+-+3+Albums+%282007-2009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0303540d56e35c600bd948e22de0f756658aa3bf","infoHashBuffer":{"type":"Buffer","data":[3,3,84,13,86,227,92,96,11,217,72,226,45,224,247,86,101,138,163,191]},"announce":[],"urlList":[]}}