{"title":"Nine (film) por memitoxxx etorrents.org ( ingles - latino - port","uid":5636389,"size":4504385536,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:04a990d40301836689f0cc0a459ec21a973470c9&amp;dn=Nine+%28film%29+por+memitoxxx+etorrents.org+%28+ingles+-+latino+-+port&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"memitoxxx","files":-1,"time":1276908793,"description":"Directed by \tRob Marshall\nProduced by \tRob Marshall\nMarc Platt\nHarvey Weinstein\nBob Weinstein\nJohn DeLuca\nMaury Yeston\nWritten by \tMichael Tolkin\nAnthony Minghella\nStarring \tDaniel Day-Lewis\nMarion Cotillard\nPenÃƒÂ©lope Cruz\nJudi Dench\nFergie\nKate Hudson\nNicole Kidman\nSophia Loren\nMusic by \tAndrea Guerra (Score)\nMaury Yeston (Music and Lyrics)\nCinematography \tDion Beebe\nEditing by \tClaire Simpson\nWyatt Smith\nStudio \tRelativity Media\nLucamar Productions\nDistributed by \tThe Weinstein Company\nRelease date(s) \tDecember 18, 2009 (2009-12-18)\n(United States)\nJanuary 15, 2010 (2010-01-15)\n(Italy)\nRunning time \t118 minutes\nCountry \tUnited States\nItaly\nLanguage \tEnglish/latino/portugues\nBudget \t$80,000,000\nGross revenue \t$53,848,897\n\nGuido Contini, famous italian film director, has turned forty and faces a double crisis: he has to shoot a film for which he can't write the script, and his wife of twenty years, the film star Luisa del Forno, may be about to leave him if he can't pay more attention to the marriage. As it turns out, it is the same crisis.\n\nLuisa's efforts to talk to him seem to be drowned out by voices in his head: voices of women in his life, speaking through the walls of his memory, insistent, flirtatious, irresistable, potent. Women speaking beyond words (Overture delle Donne). And these are the women Guido has loved, and from whom he has derived the entire vitality of a creative life, now as stalled as his marriage.\n\nIn an attempt to find some peace and save the marriage, they go to a spa near Venice (Spa Music), where they are immediately hunted down by the press with intrusive questions about the marriage and -- something Guido had not told Luisa about -- his imminent film project (Not Since Chaplin).\n\nAs Guido struggles to find a story for his film, he becomes increasingly preoccupied -- his interior world sometimes becoming indistinguishable from the objective world (Guido's Song). His mistress Carla arrives in Venice, calling him from her lonely hotel room (A Call from the Vatican), his producer Liliane La Fleur, former vedette of the Folies Bergeres, insists he make a musical, an idea which itself veers off into a feminine fantasy of extraordinary vividness (The Script/Folies Berg eres). And all the while, Luisa watches, the resilience of her love being consummed by anxiety for him and a gathering dismay for their lives together (My Husband Makes Movies / Only With You).\n\nGuido's fugitive imagination, clutching at women like straws, eventually plunges through the floor of the present and into his own past where he encounters his mother, bathing a nine year old boy -- the young Guido himself (Nine). The vision leads him to re-encounter a glorious moment on a beach with Saraghina, the prostitute and outcast to whom he went as a curious child , creeping out of his Catholic boarding school St. Sebastian, to ask her to tell him about love. Her answer, be yourself (Ti Voglio Bene / Be Italian), and the dance she taught him on the sand echoes down to the forty-year old Guido as a talisman and a terrible reminder of the consequences of that night -- punishment by the nuns and rejection by his appalled mother (The Bells of St. Sebatian). Unable to bear the incomprehensible dread of the adults, the little boy runs back to the beach to find nothing but the sand and the wind -- an image of the vanishing nature of love, and the cause of Guido Contini's artistry and unanchored peril: a fugitive heart.\n\nBack into the present, Guido is on a beach once more. With him, Claudia Nardi, a film star, muse of his greatest successes, who has flown in from Paris because he needs her. But this time she doesn't want the role. He cannot fathom the rejection. He is enraged. He fails to understand that Claudia loves him too, but wants him to love her as a woman 'not a spirit' -- and he realizes too late that this was the real reason she came -- in order to know. And now she does. He can't love her that way. And she is in some way released to love him for what he is, and never to hope for him again. Wryly she calls him &quot;My charming Casanova!&quot; thereby involuntarily giving Guido the very inspiration he needs and has always looked to her for. As Claudia lets him go with &quot;Unusual Way&quot;, Guido grasps the last straw of all -- a desperate, inspired movie -- a 'spectacular in the vernacular' -- set on &quot;The Grand Canal&quot; and cast with every woman in his life.\n\nThe improvised movie is a spectacular collision between his real life and his creative one -- a film that is as self-lacerating as it is cruel, during which Carla races onto the set to announce her divorce and her delight that they can be married only to be brutally rejected by Guido in his desperate fixation with the next set-up, and which climaxes with Luisa, appalled and moved by his use of their intimacy -- and even her words -- as a source for the film, finally detonating with sadness and rage. Guido keeps the cameras rolling, capturing a scene of utter desolation -- the women he loves, and Luisa who he loves above all, littered like smashed porcelain across the frame of his hopelessly beautiful failure of a film. &quot;Cut. Print!&quot;\n\nThe film is dead. The cast leaves. They all leave. Carla, with &quot;Simple&quot; -- words from the articulate broken heart, Claudia with a letter from Paris to say she has married, and Luisa in a shattering exit from a marriage that has, as she says, been 'all of me' (Be On Your Own).\n\nGuido is alone. &quot;I Can't Make This Movie&quot; ascends into the scream of &quot;Guido out in space with no direction,' and he contemplates suicide. But, as the gun is at his head, there is a final life-saving interruption -- from his nine year old self (Getting Tall), in which the young Guido points out it is time to move on. To grow up. And Guido surrenders the gun. As the women return in a reprise of the Overture (Reprises), but this time to let him go, only one is absent. Luisa. And Guido feels the aching void left by the only woman he will ever love. In the 2003 Broadway production, as the boy led the women off into his own future to the strains of &quot;Be Italian&quot;, Luisa stepped into the room on the final note, and Guido turned towards her -- this time ready to listen.\n\nIMAGENES &lt;a href=&quot;\nhttp://img685.imageshack.us/img685/2727/nineaver4.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img685.imageshack.us/img685/2727/nineaver4.jpg&lt;/a&gt;\nhttp://img41.imageshack.us/img41/3050/420j.png\nhttp://img13.imageshack.us/img13/5270/sub420.png\nhttp://img819.imageshack.us/img819/4240/4201.png\nhttp://img267.imageshack.us/img267/3663/4202.png\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:04a990d40301836689f0cc0a459ec21a973470c9","amp;dn":"Nine+%28film%29+por+memitoxxx+etorrents.org+%28+ingles+-+latino+-+port","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04a990d40301836689f0cc0a459ec21a973470c9","infoHashBuffer":{"type":"Buffer","data":[4,169,144,212,3,1,131,102,137,240,204,10,69,158,194,26,151,52,112,201]},"announce":[],"urlList":[]}}