{"title":"Bun B - UGK - II Trill (Chopped Not Slopped)","uid":5491935,"size":77263092,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:04e359db9f649fcc0883c6908228eb63ac479f61&amp;dn=Bun+B+-+UGK+-+II+Trill+%28Chopped+Not+Slopped%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Cgoff87","files":-1,"time":1271071872,"description":"Bun B Presents: II Trill\n\n\nThree years after his definitive solo debut, Bun B reminds listeners why he's among the strongest lyricists out of the South. Aside from a guestlist longer than Manute Bol, II TRILL benefits from impeccable production work throughout (courtesy of Clinton Sparks, JR Rotem, DJ Khalil, and the Blackout Movement, among others), as well as Bun's precise flow, commanding vocal presence, and straight-up skills. Super Producer Chops puts together one of the smoothest, down south funk tracks of all time for the monumental collaboration between Bun and Lil Wayne on &quot;Damn, I'm Cold.&quot; Bun pays homage to his deceased partner Pimp C throughout II TRILL and reserves the heartfelt track &quot;Angel in the Sky&quot; as a personal eulogy. Z-Ro, J Prince, Sean Kingston, Lyfe Jennings, Junior Reid, Lil Razah, Juvenile, 8-Ball &amp; MJG, and Lupe Fiasco are just some of the guests.\n\nThe years between Bun B's debut solo album -- 2005's Trill -- and the sequel -- 2008's II Trill -- were turbulent. His longtime friend and partner in UGK, Pimp C, saw release from prison in late 2005 only to die two years later from an accidental overdose of codeine and promethazine. In the middle of it all were Bun's hit solo singles like &quot;Draped Up&quot; and &quot;Get Throwed&quot; plus the well-received double album Underground Kingz, which found the reunited UGK topping the album charts for the first time in their long career. It's a testament to Bun B's solid foundation that the more things change, the more he stays the same, refusing to be rattled by the highs or the lows and remaining true to his promise to stay &quot;UGK for life.&quot; Save an appearance from pop-rap singer Sean Kingston -- who really does add some great Island flavor to standout track &quot;That's Gangsta&quot; -- everything here should satisfy the loyal UGK fan's hunger for cold and unforgiving Dirty South music. There's the down but not out &quot;If It Was Up II Me,&quot; with reggae legend Junior Reid adding hope to Bun's tale of struggle, plus the message-filled &quot;Get Cha Issue,&quot; where the hard truth gets coated in Houston funk by producer Bigg Tyme. On &quot;Damn I'm Cold&quot; there's great chemistry between B and Lil Wayne (who offers the amusing &quot;Don't tell me how to spend it/And yes, I know the rules/Don't marry Robin Givens&quot;) while &quot;You're Everything&quot; overflows with guest stars with Bun at the center, keeping the track focused. While Pimp C's absence is addressed in a moving, bittersweet manner, it's hardly dwelled upon and his passing influences the album as much as his incarceration influenced the original Trill. Just like he was two years prior, Bun B is a reluctant solo artist on II Trill, burdened with keeping the UGK name alive on his lonesome. This time out, he's a single short and couple songs too long, but his back is strong enough to carry the weight, proving once again he's one of the Dirty South's most reliable voices. [II Trill was also made available in a Chopped &amp; Screwed version.]\n\n-This is the Chopped and Screwed Version\n\n\nTracks Featured:\n\n1.\tII Trill\t\t\n2.\tDamn I'm Cold\t\t\n3.\tGet Cha Issue\t\t\n4.\tKeep It 100\t\t\n5.\tUnderground Thang\t\t\n6.\tSwang on Em\t\t\n7.\tYou're Everything\t\t\n8.\tI Luv That\t\t\n9.\tPop It 4 Pimp\t\t\n10.\tGood II Me\t\t\n11.\tThat's Gangsta\t\t\n12.\tCity of the Swang\t\t\n13.\tAnother Soldier\t\t\n14.\tAngel in the Sky","torrent":{"xt":"urn:btih:04e359db9f649fcc0883c6908228eb63ac479f61","amp;dn":"Bun+B+-+UGK+-+II+Trill+%28Chopped+Not+Slopped%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04e359db9f649fcc0883c6908228eb63ac479f61","infoHashBuffer":{"type":"Buffer","data":[4,227,89,219,159,100,159,204,8,131,198,144,130,40,235,99,172,71,159,97]},"announce":[],"urlList":[]}}