{"title":"Madonna - Borderline","uid":8733166,"size":52390946,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:05200059ac12f3e82f6f6deddd85222818294618&amp;dn=Madonna+-+Borderline&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"fiveofseven","files":1,"time":1374638363,"description":"&quot;Borderline&quot; was filmed on location in Los Angeles, California from January 30 to February 2, 1984 and was the first video that Madonna made with director Mary Lambert, who would later also direct the videos &quot;Like a Virgin&quot;, &quot;Material Girl&quot;, &quot;La Isla Bonita&quot; and &quot;Like a Prayer&quot;. The video portrayed Madonna's then burgeoning star quality. It is regarded as one of her career-making moments when the video was started to be shown on MTV. She acted as the girlfriend of a Hispanic street guy who is picked up by a British photographer who publishes her picture on a magazine cover. The portrayal of the street life and high-fashion scene in the video was a reference to Madonna's life in the gritty, multiracial streets and clubs that she used to haunt while her career was beginning as well as the world of popularity and success she was experiencing at that moment. The storyline involved her being emotionally torn between the photographer and her boyfriend. Madonna's boyfriend in the video is portrayed as Latino and her struggles with this relationship depicted the struggle Hispanic women faced with their men. In the January 1997 issue of Rolling Stone, Mary Lambert described the video and its plot as, &quot;Boy and girl enjoy simple pleasures of barrio love, girl is tempted by fame, boy gets huffy, girl gets famous, but her new beau's out-of-line reaction to a behavioral trifle (all she did was to spray-paint his expensive sports car) drives her back to her true love.&quot;\n\n\n\nFile Name:\nMadonna Borderline\n\nFile Format:\nmp4\n\nDuration:\n00:03:56\n\nBit Rate:\n1772k\n\nFile Size:\n49.96 MB\n\nVideo Codec:\nh264\n\nVideo Bitrate:\n1642k\n\nVideo Size:\n720x528\n\nAspect Ratio:\n1.36:1\n\nFrame Rate:\n23.98fps\n\nAudio Codec:\nmp3\n\nAudio Bitrate:\n128k\n\nChannels:\n2\n\nSample Rate:\n48000","torrent":{"xt":"urn:btih:05200059ac12f3e82f6f6deddd85222818294618","amp;dn":"Madonna+-+Borderline","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05200059ac12f3e82f6f6deddd85222818294618","infoHashBuffer":{"type":"Buffer","data":[5,32,0,89,172,18,243,232,47,111,109,237,221,133,34,40,24,41,70,24]},"announce":[],"urlList":[]}}