{"title":"The Lost Coast (OMU) .avi","uid":5631611,"size":840327168,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0571db53ae93f5ff6002bf2ecf0332369e4edcc1&amp;dn=The+Lost+Coast+%28OMU%29+.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Herminsche","files":1,"time":1276706302,"description":"Plot:\nAs a group of old high school friends wander through San Francisco on Halloween night, two of them are forced to confront their unspoken sexual history.\n\nBeschreibung:\n\nWie geht ein heterosexueller Mann mit der ersten Jugendliebe um, wenn diese lange her und mittlerweile schwul ist?\nMark, Jasper und Lilly sind alte High-School-Freunde und mittlerweile junge Erwachsene. Mark ist schwul und wohnt mit Lily zusammen, wÃƒÂ¤hrend Jasper als Hetero bald heiraten wird. Als boshaftes Trio ziehen sie in der Halloween-Nacht durch San Franciscos Castro- Viertel und stellen mit stillem Unbehagen fest, dass ihre Freundschaft in die Jahre gekommen ist. Ihr Zusammensein reicht ÃƒÂ¼ber alte Reflexe kaum noch hinaus. Die allseits ausgelassene Stimmung der kostÃƒÂ¼mierten Menschenmengen will auch nicht so richtig auf die alten Freunde ÃƒÂ¼berspringen. So gerÃƒÂ¤t die unausgesprochene Suche nach ihrer frÃƒÂ¼heren Verbundenheit zu einer absurden Suche nach der alten Vertrautheit, die die Freunde wieder zusammenfÃƒÂ¼hren und den Abend noch retten sollen. Die gemeinsame Nacht nimmt aber zunehmend die ZÃƒÂ¼ge eines Trips an, den sie vor vielen Jahren gemeinsam zur Lost Coast gemacht haben. Mark und Jasper hatten damals etwas miteinander.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1189341/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1189341/&lt;/a&gt;","torrent":{"xt":"urn:btih:0571db53ae93f5ff6002bf2ecf0332369e4edcc1","amp;dn":"The+Lost+Coast+%28OMU%29+.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0571db53ae93f5ff6002bf2ecf0332369e4edcc1","infoHashBuffer":{"type":"Buffer","data":[5,113,219,83,174,147,245,255,96,2,191,46,207,3,50,54,158,78,220,193]},"announce":[],"urlList":[]}}