{"title":"Romantic Encounters 2012 Adam and Eve","uid":8820168,"size":5681639881,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:0575c5cb077e607a2064a7dcc316fbe1902ddfcc&amp;dn=Romantic+Encounters+2012+Adam+and+Eve&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"grighta","files":7,"time":1376683830,"description":"List at http://www.pornmoviesforwomen.com/adameveromance.html\n\nIn 2011 major porn studio Adam and Eve launched a series of films with a romantic bent - Romantic Encounters. These movies are designed to appeal to women who love a bit of sexy romance. They are feature movies with relatively advanced plotlines and high production values.\n\n\nMaid For Love (2012)\n\nThe blurb: Annabelle finds herself alone and in need of a job after she walks in on her boyfriend with another woman. After reluctantly taking a job as a maid for a charming and handsome millionaire, Annabelle starts falling for her boss despite his cunning fiance's attempts to keep them apart. Soon enough Annabelle realizes that she has to clean up her life as well as the house. \n\nStarring: Tommy Pistol, Amber Rayne, Victoria Lawson, Lily LaBeau, Jessie Andrews, Richie Calhoun\n\n\nCafe Amore (2012) http://www.adultfilmdatabase.com/video.cfm?videoid=96775\n\nThe blurb: Love is brewing at Vincent's popular coffee shop. As he pours his heart and soul into reopening his late wife's coffee shop, his customers are inspires to take a leap with their own journeys in love and lust. After watching from the sidelines for so long, will Vincent be able to move on and rediscover his own passion again as well? \n\nFollowing the tragic death of his wife, Rocco Reed takes over her coffee shop to honor her memory and starts playing match-maker with his customers! But can Rocco let go of his past when he meets his own match? \n\nStarring: Barrett Blade, Dana DeArmond, Anthony Rosano, David Lord, Alexis Texas, Andy San Dimas, Rocco Reed, Danny Mountain, Lily LaBeau\n\n\nVenus In Furs (2012) http://www.adultfilmdatabase.com/video.cfm?videoid=95473\n\nThe blurb: This is the story of two generations of men - a father and son - who fall in love with the same woman. The father, a widower, can't seem tot move on with any other woman until he meets a beautiful girl who calls herself &quot;Venus.&quot; As she re-awakes the erotic desires he thought were gone forever, his son thought were gone forever, his son is falling in love (and lust) with &quot;Vickie.&quot; But what starts as a casual erotic encounter with each develops into a deep but troubled love triangle when Venus and Vickie meet face to face. \n\nStarring: Tony Desergio, Chris Johnson, Marcus London, India Summer, Ann Marie Rios, Rocco Reed, Alanah Rae, Xander Corvus, Capri Cavanni\n\n\nTango To Romance (2011) http://www.adultfilmdatabase.com/video.cfm?videoid=97823\n\nThe blurb: A romantic story inspired by the raw passion and sex appeal of the tango! Andy San Dimas has the world at her feet until she meets a tall, dark stranger. Turned off by his womanizing ways at first, Andy feels the passion of the dance pulling them closer no matter how hard she resists. Then a shocking betrayal sends Andy racing into his arms where they discover the final secret to the tango together. \n\nStarring: Andy San Dimas, Alexis Ford, Vicki Chase, Marco Rivera, Jessie Andrews, Giovanni Francesco","torrent":{"xt":"urn:btih:0575c5cb077e607a2064a7dcc316fbe1902ddfcc","amp;dn":"Romantic+Encounters+2012+Adam+and+Eve","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0575c5cb077e607a2064a7dcc316fbe1902ddfcc","infoHashBuffer":{"type":"Buffer","data":[5,117,197,203,7,126,96,122,32,100,167,220,195,22,251,225,144,45,223,204]},"announce":[],"urlList":[]}}