{"title":"AMD Fusion for Intel","uid":5460829,"size":135479,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0695e478c4d64f434bccaa03377b147ee18b9ef1&amp;dn=AMD+Fusion+for+Intel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"narfdude","files":1,"time":1269464756,"description":"Designed to help optimize your PC the AMD Fusion Utility for Desktop can help you get smoother, more responsive performance and greater efficiency for the things you do most with your PC. With the simple touch of a button it works by temporarily shutting down software processes you may not need and boosting or optimizing processor speed depending on your intended task. That means you can you can run your PC even more efficiently when doing lighter tasks like enjoying multimedia or surfing but can get even more performance out of your PC when you demand it.\n\n    * Ignite gaming performance\n    * Optimize for media playback\n    * Make your PC hyper efficient \n\nMade with simplicity in mind, we still let you behind the curtains and into the advanced interface to change how the utility works. You can customize with user selectable profiles to further optimize your PC for for your own personal PC experience. Also, you can easily build your own profile and choose exactly what you want disabled for a leaner footprint. Want to squeeze every bit of performance from your system? Engage our most advanced acceleration technologies such as Auto-Tuning and Hard Drive Acceleration.2 Push the limits of how lean and mean you can make your PC.\n\n    * Choose from multiple pre-loaded profiles, performance and optimization\n    * Customize user profiles for personalized optimization\n    * Overclock or underclock and take control2\n    * Engage advanced acceleration technologies\n\n\n\nThis is a moddded executable for AMD's Fusion utility for desktops to allow it to run on systems with an Intel processor. (big thanks to the guys at Tom's Hardware) note: this is for version 1.1\n\nTo use this, install amd fusion version 1.1 and unzip and copy this file into the amd fusion install directory. To find where you installed it, right click the amd fusion shortcut on your desktop, click properties, and look for a box next to either &quot;target&quot; or &quot;start in&quot; with the address in it. You will then need to make a shortcut on your desktop to intel fusion by right-clicking intelfusion.exe and clicking send to- desktop.\n\nlink to amd fusion download page: &lt;a href=&quot;\nhttp://game.amd.com/us-en/drivers_fusion.aspx&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://game.amd.com/us-en/drivers_fusion.aspx&lt;/a&gt;\n\nlink to how-to article on tom's hardware &lt;a href=&quot;\nhttp://www.tomshardware.com/news/AMD-Fusion-Game-Utility-Intel,6883.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tomshardware.com/news/AMD-Fusion-Game-Utility-Intel,6883.html&lt;/a&gt;","torrent":{"xt":"urn:btih:0695e478c4d64f434bccaa03377b147ee18b9ef1","amp;dn":"AMD+Fusion+for+Intel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0695e478c4d64f434bccaa03377b147ee18b9ef1","infoHashBuffer":{"type":"Buffer","data":[6,149,228,120,196,214,79,67,75,204,170,3,55,123,20,126,225,139,158,241]},"announce":[],"urlList":[]}}