{"title":"Shotgun Messiah Harry Cody Demos (Stark Album etc)","uid":5545931,"size":108239564,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:084fc9bbd1f27ed86cdd0d28cf64ecca9bdc401f&amp;dn=Shotgun+Messiah+Harry+Cody+Demos+%28Stark+Album+etc%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dannyasia","files":17,"time":1273380490,"description":"These are Harry Codys demos after the Shotgun Messiah years. The Stark album is included and so are his other demos from Das Cabal. Also there are some Tim Skold traks that I presume Harry Cody were involved with. \nI found this torrent on a webpage a few months ago after looking for it for many years.\n\nFor Harry Cody fans that expects ripping guitar riffs and solos will surely be dissapointed. Yes there are guitars on these tracks. But especially the Stark and Das Cabal tracks are far from how we know Harry Cody and I think this has to do with the late 90s and what music was popular at that time. Harry Cody tried to sell his Stark demo to the record companies but it was not meant to be.\n\nI know that all of Harry Cody's fans wants to see more from this guy. The impact he had on the music scene in the 90s was remarkable. He is/was considered one of the 10 best guitarists and rightfully so.\nI think what people will notice is that Tim Skold and Harry Cody had a synergy that you seldom see in the music industry. You could compare them to BjÃƒÂ¶rn and Benny (ABBA), John Lennon and Mc Cartney or something like that.\n\nYes, Harry sings on most of the songs. He really has a good voice but it seems to fit softer songs better that true metal. Especially &quot;The Ultimate Kiss&quot; makes his voice sound perfect.\n\nEnjoy!\n\nPs. PLease buy Tim Skold new album whenever it comes out! It should be out sometime 2010.","torrent":{"xt":"urn:btih:084fc9bbd1f27ed86cdd0d28cf64ecca9bdc401f","amp;dn":"Shotgun+Messiah+Harry+Cody+Demos+%28Stark+Album+etc%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"084fc9bbd1f27ed86cdd0d28cf64ecca9bdc401f","infoHashBuffer":{"type":"Buffer","data":[8,79,201,187,209,242,126,216,108,221,13,40,207,100,236,202,155,220,64,31]},"announce":[],"urlList":[]}}