{"title":"The Nature of Computation","uid":8748110,"size":44308407,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:08ab23071a832da2a43d767919ec2d83066000a6&amp;dn=The+Nature+of+Computation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"livhre","files":-1,"time":1374974965,"description":"Format: ePub\n\nDRM stripped in Calibre.\n\nComputational complexity is one of the most beautiful fields of modern mathematics, and it is increasingly relevant to other sciences ranging from physics to biology. But this beauty is often buried underneath layers of unnecessary formalism, and exciting recent results like interactive proofs, phase transitions, and quantum computing are usually considered too advanced for the typical student. This book bridges these gaps by explaining the deep ideas of theoretical computer sciencein a clear and enjoyable fashion, making them accessible to non-computer scientists and to computer scientists who finally want to appreciate their field from a new point of view. The authors start with a lucid and playful explanation of the P vs. NP problem, explaining why it is so fundamental, andso hard to resolve. They then lead the reader through the complexity of mazes and games; optimization in theory and practice; randomized algorithms, interactive proofs, and pseudorandomness; Markov chains and phase transitions; and the outer reaches of quantum computing. At every turn, they use a minimum of formalism, providing explanations that are both deep and accessible. The book is intended for graduate and undergraduate students, scientists from other areas who have long wanted tounderstand this subject, and experts who want to fall in love with this field all over again.\n\nFollow me @livhre\n\nPlease seed and rate the torrents I upload. Go to kobobooks.com and choose books that you want uploaded and request them in the comments. \nNote: Comics on that site are in some weird ass format that only works on iOS and Android. To get those I have to go through the tired process of screen shots of each page, then create a word file, then convert to epub. Its a pain because even then the images may not show up right on some devices/apps.\n\nSupport Amas school of technology. The only school of its kind in an entire 3rd world country that doesn't force poor people to pay. We are a free school in Nicaragua that needs help to stay alive. \n\n\nDonate here https://www.paypal.com/cgi-bin/webscr?cmd=_s-xclick&amp;hosted_button_id=AVP8RK3DQ7UUU","torrent":{"xt":"urn:btih:08ab23071a832da2a43d767919ec2d83066000a6","amp;dn":"The+Nature+of+Computation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08ab23071a832da2a43d767919ec2d83066000a6","infoHashBuffer":{"type":"Buffer","data":[8,171,35,7,26,131,45,162,164,61,118,121,25,236,45,131,6,96,0,166]},"announce":[],"urlList":[]}}