{"title":"Jtag Saver 1.0 by Xbox1crew","uid":5538863,"size":512988,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:0961ea1b560f0e74934f833883cde652597e6dba&amp;dn=Jtag+Saver+1.0+by+Xbox1crew&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Sunblock.","files":1,"time":1273157955,"description":"Jtag Saver 1.0 by Xbox1crew\n\n\nReasoning behind the design:\nWe wanted a simple, easy, and effective way of shutting down the jtag when it wasnt needed any longer.  \nTrying a 555 timer circuit, the circuit worked well, but was too expensive for people to get behind. This revision\nactually costs about 2 dollars USD to implement and works well, without all of the extra components that were needed for\nour first revision.\n\nWhat will Jtag Saver do for me?\nIt will, in essence, allow you to safely use your jtagged xbox 360 without worry due to extra voltage or current being applied\nto areas that weren't meant to have them applied. This circuit will shut the jtag circuit off after 15 seconds to try and limit\nthe damage that could be caused after long periods of use.  \n\nWe developed this circuit after a few boards died soon after jtagging.  It was too close together to be coincidental.  Most boxes \nthat died did so within a week of jtagging.  THIS is the reason for our pursuit.\n\nThe circuit has been tested thoroughly.  Many on/off cycles were gone through to make sure that it worked every single time.  It did.\nOptionally, you can add a resistor and LED to pin 7 to show you when pin 6 is shut off (goes high).  A 220 ohm resistor should suffice, but\nthis part is up to the end user.\n\n\nDisclaimer:\nWe have no responsibility for anyone's damaged equipment, or for any misuse due to this circuit.  This circuit was designed as a help to the\njtagged system user.  Everything needed to get this circuit functioning, once you have the parts, is included in this file.\n\nEnjoy and THANKS!\n\nGreets:\nEMAXX\nRedline99\nHorneydvl\nc0z\nGreenGian\nIceKiller\ncrazie\nTeam XeDev\nfree60\nand Microsoft for making this fun :-D\n ","torrent":{"xt":"urn:btih:0961ea1b560f0e74934f833883cde652597e6dba","amp;dn":"Jtag+Saver+1.0+by+Xbox1crew","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0961ea1b560f0e74934f833883cde652597e6dba","infoHashBuffer":{"type":"Buffer","data":[9,97,234,27,86,15,14,116,147,79,131,56,131,205,230,82,89,126,109,186]},"announce":[],"urlList":[]}}