{"title":"AMERICA'S FIRST CLASH WITH IRAN: The Tanker War, 1987-88","uid":8730344,"size":3935024,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0aa9fcb76c29208b2ada0db7fd1ebbc0e12ad602&amp;dn=AMERICA%27S+FIRST+CLASH+WITH+IRAN%3A+The+Tanker+War%2C+1987-88&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Djofullinn","files":1,"time":1374590217,"description":"In May 1987 the US frigate Stark, calmly sailing the waters of the Persian Gulf, was suddenly blown apart by an Exocet missile fired from an Iraqi jet fighter. A fifth of the ship's crew was killed and many others horribly burned or wounded. This event jumpstarted one of the most mysterious conflicts in American history: &quot;The Tanker War,&quot; waged against Iran for control of the Persian Gulf.\n\nThis quasi-war took place at the climax of the mammoth Iran-Iraq War during the Reagan administration. Losing on the battlefield, Ayatollah Khomeini's Iran had decided to close the Persian Gulf against shipping from Iraq's oil-rich backers, the emirate of Kuwait. The Kuwaitis appealed for help and America sent a fleet to the Gulf, raising the Stars and Stripes over Kuwait's commercial tankers.\n\nThe result was a free-for-all, as the Iranians laid mines throughout the narrow passage and launched attack boats against both tankers and US warships. The sixth largest ship in the world, the tanker Bridgeton, hit an Iranian mine and flooded. The US Navy fought its largest surface battle since World War II against the Ayatollah's assault boats. Meanwhile, US Navy Seals arrived in the Gulf, setting up shop aboard two mobile platforms. As Saddam Hussein, who had instigated the conflict, looked on, Iranian gunners fired shore-based Silkworm missiles against US forces, actions which, if made known at the time, would have required the US Congress to declare war against Iran.\n\nIn July 1988, nervous sailors aboard the cruiser USS Vincennes shot an Iranian airliner out of the sky, killing 300 civilians. This event came one month before the end of the war, and may have been the final straw that influenced the Ayatollah to finally drink from his &quot;poisoned chalice.&quot;\n\nAuthor Lee Allen Zatarain, employing recently released Pentagon documents, firsthand interviews, and a determination to get to the truth, has revealed a conflict that few recognized at the time, but which may have presaged further battles to come.\n &lt;a href=&quot;\nhttp://www.amazon.com/AMERICAS-FIRST-CLASH-WITH-IRAN/dp/1935149369/ref=sr_1_fkmr0_1?ie=UTF8&amp;qid=1374582842&amp;sr=8-1-fkmr0&amp;keywords=america%C2%B4s+first+clash+with+iran&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/AMERICAS-FIRST-CLASH-WITH-IRAN/dp/1935149369/ref=sr_1_fkmr0_1?ie=UTF8&amp;qid=1374582842&amp;sr=8-1-fkmr0&amp;keywords=america%C2%B4s+first+clash+with+iran&lt;/a&gt;","torrent":{"xt":"urn:btih:0aa9fcb76c29208b2ada0db7fd1ebbc0e12ad602","amp;dn":"AMERICA%27S+FIRST+CLASH+WITH+IRAN%3A+The+Tanker+War%2C+1987-88","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0aa9fcb76c29208b2ada0db7fd1ebbc0e12ad602","infoHashBuffer":{"type":"Buffer","data":[10,169,252,183,108,41,32,139,42,218,13,183,253,30,187,192,225,42,214,2]},"announce":[],"urlList":[]}}