{"title":"Deftones 24 Bit Vinyl Pack","uid":8751201,"size":6993301283,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0afa93219347e13ce33db7d87823d7898c9f04f8&amp;dn=Deftones+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"politux","files":-1,"time":1375035743,"description":"\n  Deftones 24 Bit Vinyl Pack\n \n  Genre: Pop/Rock\n  Styles: Alternative Metal, Heavy Metal, Post-Grung\n  Source: vinyl\n  Codec: FLAC\n  Bit Rates: ~ 2,900 - 5,500 kbps\n  Bit Depth: 24\n  Sampling Rates: 96,000 Hz, 192,000 Hz\n\n  Adrenaline\n  Around the Fur (192,000 Hz)\n  Covers\n  Diamond Eyes\n  Saturday Night Wrist\n  White Pony\n\n  Deftones were one of the first groups to alternate heavy riffs and screamed vocals with more ethereal music and hushed singing -- spawning a fair amount of imitators in their wake. The group first formed in Sacramento, California during 1988, when then high school students Stephen Carpenter (guitar), Abe Cunningham (drums), and Chino Moreno (vocals) first began to jam together. They chose the name Deftones and began playing out locally shortly thereafter, going through several different bass players before finding a permanent bassist in the form of Chi Cheng.\n\n  Although the group was more heavy metal-based early on, the early '90s saw Deftones expand their sound even further, inspired by such groundbreakers as Tool, Rage Against the Machine, and Faith No More. A strong four-song demo was completed soon after, and it landed the group a recording contract with Madonna's label, Maverick. Enlisting the services of Soundgarden and Pantera producer Terry Date (who would eventually become a regular producer for the group), the quartet's debut full-length, Adrenaline, was issued in October of 1995. While the album wasn't an instant success, Deftones built a dedicated fan base the old-fashioned way -- by touring relentlessly (both on their own and opening for more established acts as Ozzy Osbourne, L7, and Korn). With sales of Adrenaline topping 200,000 copies, expectations were high for their sophomore release, Around the Fur. Issued in October of 1997, it more than delivered, catapulting the band to the top of the alt-metal mountain on the strength of such MTV/radio faves as &quot;My Own Summer (Shove It)&quot; and &quot;Be Quiet and Drive (Far Away).&quot; Sometime after the album's release, turntablist/keyboardist Frank Delgado (who had helped out on the first two albums) formally joined up and expanded the group's lineup to a five-piece.\n\n  A seven-track import EP, 1999's Live, was issued as a stopgap release as Deftones began work on their third studio effort (Cheng also issued a spoken word release, The Bamboo Parachute, around this time as well). White Pony was eventually released in June of 2000 and proved to be one of the most eagerly anticipated heavy rock releases of the year. The album was another success (debuting at number three on the album charts), and it showed the quintet unafraid to experiment with its sound, as Moreno let such '80s modern rock influences as the Cure and the Smiths seep into Deftones' sound. (After touring wrapped up for the album, Moreno formed Team Sleep and began recording an eponymous album, which was delayed numerous times but finally saw release in 2005.) Soon Deftones reunited to work on new ideas, and enlisted Date again to helm their new album. Eagerly anticipated by both fans and critics alike, Deftones dropped in May 2003 and spawned the single &quot;Minerva.&quot; The quintet then embarked on the Summer Sanitarium tour with Metallica and Linkin Park. Deftones ended up peaking at number two on the Billboard 200, and the band took a well-deserved break for rest and side projects. In October 2005, Deftones issued a two-disc set of B-sides and rarities before returning with a new studio full-length, Saturday Night Wrist, a year later.\n\n  In 2007, the band began working on Eros, which was set to be their sixth album. The album was delayed indefinitely when bassist Chi Cheng was involved in a serious car accident that left him in a coma. Cheng was replaced by Quicksand bassist Sergio Vega in 2009, and the band got back to touring and recording. Though Eros was still shelved, in 2010 the band released a new album, Diamond Eyes. Cheng partially regained consciousness in 2012 and returned home to recover, though he wouldn't be in good enough shape to appear on the band's seventh album, Koi No Yokan, which arrived later that year.\t\t","torrent":{"xt":"urn:btih:0afa93219347e13ce33db7d87823d7898c9f04f8","amp;dn":"Deftones+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0afa93219347e13ce33db7d87823d7898c9f04f8","infoHashBuffer":{"type":"Buffer","data":[10,250,147,33,147,71,225,60,227,61,183,216,120,35,215,137,140,159,4,248]},"announce":[],"urlList":[]}}