{"title":"Spring Break 2K9 (by SOMEntertainment)","uid":5471794,"size":6153639842,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0c6ad947a112d37f190fdfccefa9940e7c4a15bc&amp;dn=Spring+Break+2K9+%28by+SOMEntertainment%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"oldschool101","files":-1,"time":1269931108,"description":"PLEASE KEEP SEEDING THIS WHEN YOUR DONE!! DON'T KILL THE TRANSFER!!\n\n\nSpring Break 2K9 by SOMEntertainment. This is the official, DVD Release form of SPRING BREAK 2K9.\n\nPlease note, this is the main feature only, and that no bonus features, deleted scenes, interviews, or outtakes are included in this torrent. \n\nIf you enjoy the movie, and would like the official DVD (which contains everything, in an awesome and very professional looking case, pictured above), you can find us on Facebook by looking for our group page &quot;Spur Of the Moment Entertainment&quot;\n\n\nOr you can order a DVD with me by phone at (989) 545-1323 (leave detailed message for your order if the call is unable to be answered.)\n\n\n\nTHANK YOU for your interest in SB2K9! Please remember to keep the film alive by Seeding whenever you can!!\n\n\n\n\nDetails:\n\nSTARRING: NICK PRYOR, TRENT DANA, KEVIN HACKER, JORDAN DANCER, CHARLIE PRYOR, CHRIS McREAVY, and KYLE KIDD\n\n***Spring Break 2K9***\n- Seven college guys set out to get away from the cold and snow of Michigan, and head to Myrtle Beach, SC for a spring break trip they will never forget! Completely Unscripted and in true Spur Of the Moment Entertainment style comes the New full length feature that will have you laughing till your cheeks hurt -\n\nDirector/Producer/Editor: Charlie Pryor\nOriginal Music/Soundtrack Material created by: Shotaro Hakoyama\n\n\nTotal running time: 103 min.\nFormat: .mp4 H.264 encode.\n\nThis movie is not rated, and does contain strong language. Viewer discretion is advised. If your child learns bad words, it's not my fault!\n\n\n\n\n!!!!PLEASE KEEP THIS FILE ALIVE!! SEED WHEN YOUR DONE!! DON'T KILL IT!!!","torrent":{"xt":"urn:btih:0c6ad947a112d37f190fdfccefa9940e7c4a15bc","amp;dn":"Spring+Break+2K9+%28by+SOMEntertainment%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c6ad947a112d37f190fdfccefa9940e7c4a15bc","infoHashBuffer":{"type":"Buffer","data":[12,106,217,71,161,18,211,127,25,15,223,204,239,169,148,14,124,74,21,188]},"announce":[],"urlList":[]}}