{"title":"Ram Rajya (1943) Xvid 2cd_No Subs_Indian Cinema_The Early Years_","uid":8859007,"size":1513083271,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0cc1735e74e410d0c3a4d1ed62c46824496a5c50&amp;dn=Ram+Rajya+%281943%29+Xvid+2cd_No+Subs_Indian+Cinema_The+Early+Years_&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"SaM","files":-1,"time":1377730790,"description":"Ram Rajya (1943) Xvid 2cd_No Subs_Indian Cinema_The Early Years_Classic [DDR]\n\nCAST:- Prem Adib, Shobhna Samarth, Badri Persad, Chandrakant \n\nDirected by Vijay Bhatt\nMusic Director: Shankar Rao Vyas\t\nLyricist: Ramesh Gupta\t\n\nSongs are Included in MP3s\nRam Rajya (1943) 00. Aye Raghuvira, Title Music and Screen Credits, Shankar Rao Vyas\nRam Rajya (1943) 02. Dekho Dekho Ram Rajya Mein, Ramesh Gupta, Shankar Rao Vyas\nRam Rajya (1943) 03. Aao Ri Suhagan, Amirbai Karnataki, Ramesh Gupta, Shankar Rao Vyas\nRam Rajya (1943) 04. Surya Dev Jagadeesh, Ramesh Gupta, Shankar Rao Vyas\nRam Rajya (1943) 05. O Rani Maharani, Ramesh Gupta, Shankar Rao Vyas\nRam Rajya (1943) 06. Beena Madhura Madhura Kuch Bol, Saraswati Rane, Ramesh Gupta, Shankar Rao Vyas\nRam Rajya (1943) 07. Chal Tu Door Nagariya, Manna Dey, Ramesh Gupta, Shankar Rao Vyas\nRam Rajya (1943) 08. Ajab Vidhi Ka Lekh, Manna Dey, Ramesh Gupta, Shankar Rao Vyas\nRam Rajya (1943) 09. Aaj Anand Bhayo Re, Ramesh Gupta, Shankar Rao Vyas\nRam Rajya (1943) 10. Jhoole Mein Jhool Lal, Ramesh Gupta, Shankar Rao Vyas\nRam Rajya (1943) 11. Aaj Jiya Dole Anand Se, Ramesh Gupta, Shankar Rao Vyas\nRam Rajya (1943) 12. Bharat Ki Ek Sannari Ki Hum Katha Sunaate Hai Part 1, Madhusudan Ram Apte, Ramesh Gupta, Shankar Rao Vyas\nRam Rajya (1943) 13. Bharat Ki Ek Sannari Ki Hum Katha Sunaate Hai Part 2, Ramesh Gupta, Shankar Rao Vyas\nRam Rajya (1943) 14. Tyaagmayi Tu Gayi, Manna Dey, Ramesh Gupta, Shankar Rao Vyas\n\nSYNOPSIS:- Ram Rajya (1943)\nFollowing Bhagwan Shri Ram's 14 year exile, whereby he demolishes the evil empire of Lord Ravan, rescues his wife, Sita, and returns triumphantly home to Ayodhya to be crowned the King. Bhagwan Ram arranges for Sita to be placed on top a funeral pyre, and when she comes out unscathed with the Lord of Fire himself appearing and asking Bhagwan Ram to take Sita back as she is pure, and her presence has not only purified Ayodhya, but also Sri Lanka, as well as himself. Thus satiated, Ram and Sita return to Ayodhya, but not for long as the people, especially a washer-man (Dhobi) demands that Sita be expelled from the kingdom, as the people would like him to ask his wife to leave Ayodhya as she has spent several days and nights away from husband, and has thus maligned herself. Bhagwan Ram gives way to the demands of his people, and expels Sita, who then goes to reside with Lord Valmiki, calls herself Vandevi, and gives birth to twins - Luv and Kush. In the meantime, Valmiki has finished writing the Holy Book Ramayan, and ensures that the twins read and understand this, which they do. Then when Bhagwan Ram announces a Aswamedha Yagna (to expand Ayodhya's boundaries by letting a horse run through different kingdoms, and whosoever stops the horse, challenges Bhagwan Ram and his armies). When Vandevi hears of this, she is shocked as this Yagna can only be performed by a ruler with his wife at his side, is it that Bhagwan Ram is getting married again? Before she could find any answers to this question, she is told that her sons have stopped the horse from Ayodhya - and are ready to do battle with the powerful armies of Ayodhya.\n\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 1252 kbps\nVideo Resolution: 352x272\nVideo Aspect Ratio: 1.294:1\nFrames Per Second: 25.000\nAudio Codec: 0x0055 MPEG-1 Layer 3\nAudio Bitrate:103kb/s VBR 48000 Hz\nAudio Streams:  2\nAudio Languages: Hindi\nRunTime  2:12:01\nSubtitles:NONE\nRipped by: Trinidad [DDR]         \nDuration: 2:12:01","torrent":{"xt":"urn:btih:0cc1735e74e410d0c3a4d1ed62c46824496a5c50","amp;dn":"Ram+Rajya+%281943%29+Xvid+2cd_No+Subs_Indian+Cinema_The+Early+Years_","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cc1735e74e410d0c3a4d1ed62c46824496a5c50","infoHashBuffer":{"type":"Buffer","data":[12,193,115,94,116,228,16,208,195,164,209,237,98,196,104,36,73,106,92,80]},"announce":[],"urlList":[]}}