{"title":"Everybody Was In The French Resistance...Now - Fixin","uid":5600493,"size":68714489,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0eba790db94a527eb7855b592f20151dbb9b955d&amp;dn=Everybody+Was+In+The+French+Resistance...Now+-+Fixin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SoundbaronPirateBay","files":15,"time":1275277895,"description":"Music : Indie : MP3/Over 256Kbps\n\n\n\nEverybody Was In The French Resistance...Now! - Fixin' The Charts (2010)\n\n\n\n\n&quot;Answer records are not new,&quot; Time magazine wrote. That was in 1961. From &quot;Yes, I'm Lonesome Tonight&quot; to &quot;You Know I'll Love You Tomorrow&quot;, &quot;Roll With Me, Henry&quot; to &quot;Wearing His Rolex&quot;, songs that respond to other songs have long been a lively pop tradition. In 1995, German reissue label Bear Family put out a three-volume compilation series, And the Answer Is: Great Pop Answer Discs From the '50s and '60s. It shows that as engrossing as the answer record trend can be, most of the records themselves are for obsessives only.\n\nEddie Argos is such an obsessive. The plucky raconteur for UK rockers Art Brut has always portrayed himself less as a pop star than as the ultimate fan, whether California dreaming about Axl Rose on 2004 debut Bang Bang Rock &amp; Roll or belatedly discovering the Replacements on last year's Art Brut vs. Satan. And, as titles like &quot;Pump Up the Volume&quot;, &quot;Nag Nag Nag Nag&quot;, &quot;Twist and Shout&quot;, and &quot;The Passenger&quot; may indicate, Art Brut were already making &quot;answer songs&quot; of a sort.\n\nEverybody Was in the French Resistance... Now! is Argos' band with Dyan ValdÃƒÂ©s of L.A. group the Blood Arm. Produced by former Mighty Lemon Drops guitarist Dave Newton and recorded at Joshua Tree (take that, U2!!! ...I guess?), Fixin' the Charts, Vol. 1, an album-length excursion into answer songs, is only the latest example of Argos' fascination with participatory culture. Too often, though, its jokes are one-note, and so are its arrangements. It's irony. It's rock'n'roll. It's a listening experience not worth repeating a second time.\n\n\n\nWisely if foolhardily, Everybody Was in the French Resistance... Now! have chosen to respond to songs already rich in history. Wisely, because it's difficult not to take &quot;The Scarborough Affaire&quot; on its own terms when the Simon and Garfunkel original was already based on a Martin Carthy arrangement of a traditional song. Foolhardily, because this approach also highlights Fixin' the Charts' shortcomings: The limply parodic indie funk of &quot;Billie's Genes&quot; has nothing on earlier answer records like Lydia Murdock's Billie-Jean's-view &quot;Superstar&quot;.\n\nArgos is still witty, but here his punchlines tend to be predictable, due in part perhaps to the disc's overstretched answer-song conceit. I get that trying to reveal the emotional truth behind classic pop songs could theoretically be a way of giving Fixin' the Charts the sort of honesty about relationships that makes Bang Bang Rock &amp; Roll or Art Brut vs. Satan stick with you for so long. But to &quot;fix&quot; the tacit anti-feminism of Avril Lavigne's &quot;Girlfriend&quot;, &quot;G.I.R.L.F.R.E.N. (You Know I've Got A)&quot; would have to out-entertain her. Drunken indie-pop karaoke won't cause a generation of young women raised on Taylor Swift's &quot;You Belong With Me&quot; to stop fighting over boys and embrace girl power.\n\nThen again, everybody was on the right side of history... now. When the Replacements sang about a musical hero of theirs, on Pleased to Meet Me/&quot;Rock Band 2&quot; fave &quot;Alex Chilton&quot;, Paul Westerberg rasped, &quot;I'm in love/ What's that song?/ I'm in love/ With that song.&quot; On &quot;Hey! It's Jimmy Mack&quot;-- in which, guess what, Jimmy tells Martha and the Vandellas he's never coming back-- Argos quips, &quot;It certainly didn't deserve a song.&quot; What makes for a mildly amusing MySpace click can lead to a painfully obnoxious album. Particularly when, if you really think about it-- and I'm hardly the first person to have this idea-- every song is an answer song. Why else would you form a band?\n\n\n\n\n\nTracklist:\n\n1. Creeque Allies\n2. GIRLFREN (You Know I've Got A)\n3. I'm So Waldo P Emerson Jones\n4. Scarborough Affaire, The\n5. Billie's Genes\n6. Think Twice (It's Not Alright)\n7. Hey It's Jimmy Mack\n8. He's A Rebel\n9. Coal Digger\n10. My Way (Is Not Always The Best Way)\n11. Superglue\n12. Walk Alone\n\n\n\n\n\nMore info:\n\n &lt;a href=&quot;\nhttp://everybodywasinthefrenchresistancenow.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://everybodywasinthefrenchresistancenow.com/&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://pitchfork.com/reviews/albums/13895-fixin-the-charts-vol-1/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://pitchfork.com/reviews/albums/13895-fixin-the-charts-vol-1/&lt;/a&gt;\n\n\n\n\n\nENJOY &amp; REMEMBER TO KEEP SEEDING FOR OTHERS!!!\nTHANKS!!","torrent":{"xt":"urn:btih:0eba790db94a527eb7855b592f20151dbb9b955d","amp;dn":"Everybody+Was+In+The+French+Resistance...Now+-+Fixin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0eba790db94a527eb7855b592f20151dbb9b955d","infoHashBuffer":{"type":"Buffer","data":[14,186,121,13,185,74,82,126,183,133,91,89,47,32,21,29,187,155,149,93]},"announce":[],"urlList":[]}}