{"title":"IntoTheAttic - Bijou enema part(5.14.2009)","uid":5459863,"size":326577498,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:0fdea4ef422a7f0dac4becb8630f7af43ff512bd&amp;dn=IntoTheAttic+-+Bijou+enema+part%285.14.2009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"stf515515","files":1,"time":1269438716,"description":"30 year old Bijou came Into The Attic on her first visit ever. I suspect we'll be seeing her again soon. Let's dig in, if you will.\nBijou had told me she was on The Rag the day before she was to arrive. I told her to come on in, that we would turn that inconvenience into an asset. So once she was here I put her into a box tie, had her get on the Gyno table and roped her feet into the stirrups. Once I had her sequestered I started up a little video for the *Instead Softcup* product. Of course, I've never inserted a tampon into a girl before (I've pulled quite a few out) let alone utilized the latest revolution in feminine hygiene in 40 years. So after watching the videos and reading the step by step instructions as Bijou is bound up tightly beside me on the Gyno table and spider gagged, I got started inserting the new revolution in period protection. I collapsed the device, stuffed it in and then dug around to get it positioned properly. Frankly, I thought it was rather easy to get it in there and seated, like a bag on the top of an upside down volcano. I just hope she didn't find the fact that I'm a stranger, that she's tied to a Gyno table, while I wear latex gloves and dig around in her cunt with the latest revolution in feminine hygiene too impersonal or humiliating. Once done, I went ahead and hooked up electrodes to her clit and ass hole.\n\nVideo resolution is 720x480 (16:9) at 2000 Kb/s","torrent":{"xt":"urn:btih:0fdea4ef422a7f0dac4becb8630f7af43ff512bd","amp;dn":"IntoTheAttic+-+Bijou+enema+part%285.14.2009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fdea4ef422a7f0dac4becb8630f7af43ff512bd","infoHashBuffer":{"type":"Buffer","data":[15,222,164,239,66,42,127,13,172,75,236,184,99,15,122,244,63,245,18,189]},"announce":[],"urlList":[]}}