{"title":"Anal.Gorgeous.XXX.DVDRip.x264-SWE6RUS","uid":8862410,"size":2183640138,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:0ff093d8c26e23f0cdaff6979113fe47348d2bcc&amp;dn=Anal.Gorgeous.XXX.DVDRip.x264-SWE6RUS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":-1,"time":1377809830,"description":"Category Anal, Foreign\n\n Director Omar Galanti\n Starring Lindsey, Polly Sunshine, Nataly Gold, Kristall Rush, Omar Galanti, Lorrelai Gold\n\n All Anal Extravaganza!\n\n Perverted porn director/performer Omar Galanti likes sex good and rough - the tattooed Italian brute's ferocious anal scenes are famed for their intensity and nasty energy. In Omar's 'Anal Gorgeous,' the beefy madman puts five incredibly lovely Russian models through a crash course in Omar-style passion, with ruthless butt fucking, throat banging, rectal rimming and sheer nastiness. Each member of his beautiful cast comes out of her session looking a little the worse for wear, but fully satisfied. Omar's lovely-but-filthy actresses certainly live up to his movies title!\n\n All-natural Goth knockout Polly Sunshine; adorable, young brunette Nataly Gold; perky and willing 22-year-old Lindsey; naughty, black-haired bitch Kristall Rush; and auburn-haired rectal enthusiast Lorrelai Gold each gives up her sweet orifices to the twisted director with the enormous, thick, uncircumcised cock. Omar uses big vibrating wands, a variety of dildos and his own special finger techniques of G-spot stimulation to bring his luscious girls to juicy climax. Everyone goes home with a smile - and lots of Omar's creamy DNA - on her comely face. This combination of raunchy, hard-core sodomy and seductive Eastern European pulchritude can't be beat. 'Anal Gorgeous' is a vivid portrait of no-holes-barred, butt-banging beauty!\n\n &lt;a href=&quot;\nhttp://bayimg.com/aaPGkAaed&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/aaPGkAaed&lt;/a&gt;","torrent":{"xt":"urn:btih:0ff093d8c26e23f0cdaff6979113fe47348d2bcc","amp;dn":"Anal.Gorgeous.XXX.DVDRip.x264-SWE6RUS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ff093d8c26e23f0cdaff6979113fe47348d2bcc","infoHashBuffer":{"type":"Buffer","data":[15,240,147,216,194,110,35,240,205,175,246,151,145,19,254,71,52,141,43,204]},"announce":[],"urlList":[]}}