{"title":"La.Furia.De.Mackenzie.[DVDRip][Spanish].","uid":5540671,"size":681231690,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1131703527f5e679c719fff6ed7e915f00bea228&amp;dn=La.Furia.De.Mackenzie.%5BDVDRip%5D%5BSpanish%5D.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zurera","files":1,"time":1273217110,"description":"Titulo: La Furia De MacKenzie\nAÃƒÂ±o: 2009\nDirector:\nFelix CaÃƒÂ±a,Jose Luis Reinoso, Paco Campano\nGuiÃƒÂ³n: Felix CaÃƒÂ±a,Jose Luis Reinoso, Paco Campano\nPaÃƒÂ­s: EspaÃƒÂ±a\nGÃƒÂ©nero: Monster Movie, Gore, Parodia\n\n\nSinopsis:\n\nRuta 74. Cerca de la frontera. Un furgÃƒÂ³n policial transporta a dos peligrosos delincuentes, Mackenzie y Branson, a una muerte merecida. Pero el destino les reservarÃƒÂ¡ otro final y lograrÃƒÂ¡n escapar del temible Sheriff Apollo. En su huida secuestrarÃƒÂ¡n a una familia en apariencia normal. Mackenzie tendrÃƒÂ¡ que enfrentarse a las mismÃƒÂ­simas fuerzas del mal. Terribles criaturas acechan en los alrededores. Ã‚Â¿SerÃƒÂ¡n capaces de mantenerse unidos para sobrevivir?.\n\nDatos extras.\n\nDe eso se trata &quot;La furia de Mackenzie&quot;. De un grupo de amigos que se juntan para divertirse y de paso hacer una pelÃƒÂ­cula, sin dejar que la diversiÃƒÂ³n relegue la calidad. Todo lo contrario. Filmada durante los fines de semana, con mucho esfuerzo y mÃƒÂ¡s talento aÃƒÂºn, esta pelÃƒÂ­cula tiene la admirable cualidad del fanatismo. Algo que se nota en cada movimiento de cÃƒÂ¡mara, cada efecto especial, cada gag humorÃƒÂ­stico, elementos que elevan lo artesanal a otra dimensiÃƒÂ³n. Mackenzie es un prisionero de los peligrosos. Mientras es trasladado al lugar donde serÃƒÂ¡ ejecutado el Sheriff Apollo, decide ajusticiarlo en el medio del desierto. Pero Mackenzie logra escapar junto a un secuaz. Y todo los termina guiando hacia la casa de una familia cuya normalidad estÃƒÂ¡ por comprobarse. Si a todo esto le agregamos la presencia de siniestras y voraces criaturas de dudosa procedencia, no nos queda otra que prepararnos para lo inesperado. SÃƒÂ­, asÃƒÂ­ de paradÃƒÂ³jico es el asunto. Una pelÃƒÂ­cula alegremente desenfadada, cargada de un increÃƒÂ­ble desparpajo y un evidente amor por el gÃƒÂ©nero.","torrent":{"xt":"urn:btih:1131703527f5e679c719fff6ed7e915f00bea228","amp;dn":"La.Furia.De.Mackenzie.%5BDVDRip%5D%5BSpanish%5D.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1131703527f5e679c719fff6ed7e915f00bea228","infoHashBuffer":{"type":"Buffer","data":[17,49,112,53,39,245,230,121,199,25,255,246,237,126,145,95,0,190,162,40]},"announce":[],"urlList":[]}}