{"title":"POTHS - Secret Mysteries of Americas Beginning - Vol 8 - 911 Tru","uid":5474860,"size":3696668914,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:16206e8e667e37d2e5ba570cd0850b3f66f22ac6&amp;dn=POTHS+-+Secret+Mysteries+of+Americas+Beginning+-+Vol+8+-+911+Tru&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"awaken888","files":13,"time":1270080486,"description":"POTHS   -- Pointing Out The Hellish Scumbags -- Upload POTHS  everywhere -- POTHS -- Pouring Out The Holy Spirit\n\nI am using a SEED BOX that uploads at rates of up to 2mb/s per leecher. The Seed Box can be identified by this IP address perf029c.xirvik.net. If you hook up with this server open up your client for maximum download speed. Be patient, it takes a awhile to hook up to it and build up speed. Not all leechers hook up and get high download speeds, so it is important to seed long.\n\n911 WTC. The Next 3 torrents Volumes 7,8,&amp; 9 Are the Proof of that anyone can use to debunk the 911 story that has been released to the public. 911 must be exposed for the lie that it is. If you honestly think that a bunch of Arabs hiding in the caves of Afghanistan convinced the whole Air Defense of The USA to stand by using cell phones from caves, you need to catch up. They also stole from NASA, Thermite and Thermate, these explosives are found only at NASA and were used to melt the internal steel structure. They also got 3 skyscrapers to fall in the own foundations at FREE-FALL SPEED. The chance of building doing this is nil but 3 in one day. Impossible. Jet fuel burns at 1800 degrees and it burnt for 18 seconds at the WTC.  HERE it is. Steel melts at 3500 degrees. 18 seconds at 1800 degrees on Fireproofed steel would do NOTHING to the integrity of the steel structure. I am an Ironworker, I build Skyscrapers on the West Coast. That is my testimony.\n\nSeed long and Prosper.\n\nEphesians 5:11 KJV\n 11 And have no fellowship with the unfruitful works of darkness, but rather reprove them.","torrent":{"xt":"urn:btih:16206e8e667e37d2e5ba570cd0850b3f66f22ac6","amp;dn":"POTHS+-+Secret+Mysteries+of+Americas+Beginning+-+Vol+8+-+911+Tru","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16206e8e667e37d2e5ba570cd0850b3f66f22ac6","infoHashBuffer":{"type":"Buffer","data":[22,32,110,142,102,126,55,210,229,186,87,12,208,133,11,63,102,242,42,198]},"announce":[],"urlList":[]}}