{"title":"AlanWatt_2010Apr01_AuthoritarianHellSoTerriblyTragicWeveToFollow","uid":5477813,"size":11219487,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:16c00bb3952853cbc7f1953ba7f7d0a7cf54febe&amp;dn=AlanWatt_2010Apr01_AuthoritarianHellSoTerriblyTragicWeveToFollow&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":-1,"time":1270234700,"description":"Authoritarian Hell, So Terribly Tragic, We've to Follow U.K., It is the Flagship: &quot;Cognitive Dissonance Part of the Plan, Electronically Tagged Like this Elderly Gran, Who Never Dreamed They'd Stoop to Bring In a Young Boy for Goldfish, Setting a 'Sting', Make-Work Projects for Judges &amp; Coppers, Bring in the Loot to the Lawmakers' Coffers, It Seems the Law Boys' New Resolution, Is Targeting Citizens with Bizarre Persecution, Yet a Congolese Rapist Chose Victim to Ravage And Left Her On the Top of Local Garbage, Home Office -- He Can Stay, He's Allowed to Tarry, 'Cause Someone Came Forward, Offered to Marry, When Corrupt Politicos, Judges, Force Rule the Land, History Reveals Such Land Cannot Stand, New Global Society Shows All World the Same, Piratical Legal Hierarchy, Plunder for Gain&quot; }-- Council on Foreign Relations / Royal Institute of International Affairs (Tells U.N. What to Do) - Media Releases, Shocks, Punch-Drunk Effect, Pavlovian Conditioning - Test-Bed of Britain, Massive Taxation and Bureaucratic-Legal Tyranny, Training for Post-Consumer Society - Fees and Penalties for Cars, End of Private Transportation - Top Medical Care and Food for Politicians and Bureaucrats - Psychopaths in Govt., Tony Blair, Payoffs from Masters. Planned Societal Disruption - Crime, Rapes, Problems from Immigration, Special Treatment for Immigrants - Sting Operations (Entrapment), Make-Work Projects for Police, Persecution of the Public. Baja Beach Club, Implantable Chip, Hormonal Drives Used - Photo and Fingerprinting to Enter Australian Nightclubs - Human Body &quot;Input Device&quot; - RFID Tags in Clothing. &quot;Global Warming&quot;, Britain Colder than Moscow - 12 Years of Aerial Spraying - Scientists Might &quot;Try&quot; Geoengineering. Canada's $Millions Spent on Propaganda for its &quot;Wonderful&quot; Medical System - Walk-in Clinics, Waiting Lists - Health Care Systems Modeled on England - W.H.O., Minimal Healthcare. Bibles, Versions of Bibles for Political Purposes - Christianity, Paul and Disciples, Additions to Give Authority to Church and Priesthood - Catholic Church - Spirituality for the Individual - Writings in Talmud, Pharisee Priests, Laws. \n\n(ONLY ORIGINAL SEEDED FOR TWO DAYS) &lt;a href=&quot;\nhttp://www.republicbroadcasting.org/a_watt.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.republicbroadcasting.org/a_watt.html&lt;/a&gt;\nhttp://www.cuttingthroughthematrix.com/\n\n  ____                      _                      _   _       _\n / ___|___  _ __  ___ _ __ (_)_ __ __ _  ___ _   _| | | |_   _| |__\n| |   / _ \\| '_ \\/ __| '_ \\| | '__/ _` |/ __| | | | |_| | | | | '_ \\\n| |__| (_) | | | \\__ \\ |_) | | | | (_| | (__| |_| |  _  | |_| | |_) |\n \\____\\___/|_| |_|___/ .__/|_|_|  \\__,_|\\___|\\__, |_| |_|\\__,_|_.__/\n                     |_|                     |___/\n   ____\n  / ___|___  _ __ ___\n | |   / _ \\| '_ ` _ \\\n | |__| (_) | | | | | |\n(_)____\\___/|_| |_| |_|\n\n\nPLEASE KEEP SEEDED TO PASS ON THE MESSAGE.  PLEASE VISIT OUR SITE AND SHARE THE WORD!\nDOWNLOAD MAYBE SLOW BUT SURE! PLEASE ASSIST IN BANDWIDTH!\n\n* Don't Be Fooled Any Longer on Darwinism, Evolution, Global Warming Lies, Internationalism, etc.\n* Get The Message Out, Openly!","torrent":{"xt":"urn:btih:16c00bb3952853cbc7f1953ba7f7d0a7cf54febe","amp;dn":"AlanWatt_2010Apr01_AuthoritarianHellSoTerriblyTragicWeveToFollow","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16c00bb3952853cbc7f1953ba7f7d0a7cf54febe","infoHashBuffer":{"type":"Buffer","data":[22,192,11,179,149,40,83,203,199,241,149,59,167,247,208,167,207,84,254,190]},"announce":[],"urlList":[]}}