{"title":"Garbage - Stupid Girl  (2nafish)","uid":5622229,"size":164161540,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:17ad34e009ab7cbf6527a7a264e072c438d755ac&amp;dn=Garbage+-+Stupid+Girl++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1276326334,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Stupid Girl&quot; is a song by Garbage, released as a single in 1996, taken from their 1995 self-titled debut album. It became Garbage's highest charting single in many territories, including in the US Billboard Hot 100 and in the UK Singles Chart, where it peaked at #4. Its success was driven by an innovative music video and cutting-edge remixes which gained massive airplay across the world.\n\nThe success of &quot;Stupid Girl&quot; propelled sales of its parent album Garbage into the top twenty of the Billboard 200 and into the UK Albums Chart top ten. In 1997 the song was nominated for Grammy Awards for Best Rock Song and Best Rock Performance By A Duo Or Group.\n\nWritten by Garbage members Duke Erikson, Shirley Manson, Steve Marker and Butch Vig, the song is based upon a drum sample from The Clash's 1980 hit &quot;Train in Vain&quot;, whose writers Joe Strummer and Mick Jones were given a co-writing credit for the song. In 2007, &quot;Stupid Girl&quot; was remastered and included on Garbage's greatest hits album Absolute Garbage. The remaining members of The Clash, Paul Simonon and Topper Headon, were given a co-writing credit on the remastered version of the song.\n\nThe music video for &quot;Stupid Girl&quot; was filmed on January 16, 1996 in Los Angeles by director  Samuel Bayer. The video for single &quot;Only Happy When It Rains&quot; was shot at the same time. The video for &quot;Only Happy When It Rains&quot; was given a higher budget than the video for &quot;Stupid Girl&quot;, because Almo Sounds believed that the former would be a bigger hit than the latter. The video debuted internationally on February 1, 1996. MTV certified &quot;Stupid Girl&quot; a Buzz-clip, the band's third video in a row to be guaranteed heavy airplay on the network,  while VH1 included the video in a Pop Up Video episode.\n\nThe video for &quot;Stupid Girl&quot; is a performance piece, inspired by the title sequence from David Fincher's 1995 movie Se7en. The clip was shot in just four hours entirely within a warehouse. Bayer cut the film into pieces, and soaked it in his bath, applying deliberate fingerprints and abrasions to the footage before putting it back together by hand. Bayer later re-edited a second version of the video, with alternative footage from the original shoot for a remix version of &quot;Stupid Girl&quot; by Todd Terry.\n\nThe &quot;Stupid Girl&quot; video was first commercially released on VHS and Video-CD on 1996's Garbage Video, along with &quot;making of&quot; out-take footage. A remastered version was later included on Garbage's 2007 greatest hits DVD Absolute Garbage.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:17ad34e009ab7cbf6527a7a264e072c438d755ac","amp;dn":"Garbage+-+Stupid+Girl++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17ad34e009ab7cbf6527a7a264e072c438d755ac","infoHashBuffer":{"type":"Buffer","data":[23,173,52,224,9,171,124,191,101,39,167,162,100,224,114,196,56,215,85,172]},"announce":[],"urlList":[]}}