{"title":"Memoirs of a Bar Steward by Scott Evans","uid":8773012,"size":475583,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:19394c4302cc764b154c4271a607aa525c219c88&amp;dn=Memoirs+of+a+Bar+Steward+by+Scott+Evans&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"OrajelJunkie","files":-1,"time":1375494596,"description":"Where did it all go wrong for 18 year old Jacob Cox? His family business has been blown up with all of his new customers in it and he doesn't know who is to blame. Was it his ex gangster mother, his debt ridden father, his crazy brother, his evil little sister, the rival landlord he framed, the celebrity who wants bloody revenge, himself or one of the many other people he and his family has managed to piss off in the short time that they have been in charge of their new pub by the seaside?\n\nFollow the secret blog diary of Jacob Cox which leads up to this explosive finale and see if you can guess who is going to light the fuse! \n\nMemoirs of a bar steward is a crazy screwball comedy about one young mans mission to escape his family of villains, liars and psychopaths by making a success of the new family business so that he can make enough money to get away from everyone that he despises. However, is his family really as bad as he thinks or is he actually worse than all of them put together?","torrent":{"xt":"urn:btih:19394c4302cc764b154c4271a607aa525c219c88","amp;dn":"Memoirs+of+a+Bar+Steward+by+Scott+Evans","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19394c4302cc764b154c4271a607aa525c219c88","infoHashBuffer":{"type":"Buffer","data":[25,57,76,67,2,204,118,75,21,76,66,113,166,7,170,82,92,33,156,136]},"announce":[],"urlList":[]}}