{"title":"The Big Bang Theory Season 1 (if your a fan this is worth a look","uid":5635833,"size":6830753792,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1a5dbba5ec4531a19da30efa83496ae0945f0e9e&amp;dn=The+Big+Bang+Theory+Season+1+%28if+your+a+fan+this+is+worth+a+look&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Magash","files":60,"time":1276886069,"description":"Ok this is the first season of Big Bang Theory that aired 17 episodes but in this you get 19. What I have included is the first two versions of the pilot that didn't air. \n\nThe first version Sheldon and Lenard are in the sperm bank donating but after they leave on the way home they meet a girl on the street and invite her to the apt. The girl is named Katie and is played by a different person that ended up playing Penny. The actresses name is Amanda Walsh. In this version there  is no Howard and Raj instead Sheldon and Lenard have a friend played by a girl named Gildy (actresses name is Iris Bahr) who wants to be with Lenard but has been with Sheldon. \nThis version was not picked up so they redid the cast other then Sheldon and Lenard and rewrote the script. \n\nNow in the second version they are in the sperm bank after having made the donation then go to the apt where they meet penny and the rest of the episode is exactly like the one that aired. In this episode Raj and Howard (Played by Kunal Nayyar and Simon Helberg) are added to the cast and Gildy is gone and so is Katie replaced by Penny (Played by Kaley Cuoco)\n\nThen the pilot that aired is also started in the sperm bank but they decided not to make the donation before they left.\n\nThe first version of the pilot is very interesting esp for people that are really into the show to see the different cast. \n\nThe episode list is\n\n1.1 The first version of the show\n1.2 The first version of the pilot with the new cast\n1.3 The pilot that aired\n2. The Big Bran Hypothesis\n3. The Fuzzyboots Corollary\n4. The Luminous Fish Effect\n5. The Hamburger Postulate\n6. The Middle Earth Paradigm\n7. The Dumpling Paradox\n8. The Grasshopper Experiment\n9. The Cooper-Hofstadter Polarization\n10. The Loobenfeld Decay\n11. The Pancake Batter Anomaly\n12. The Jerusalem Duality\n13. The Bat Jar Conjecture\n14. The Nerdvana Annihilation\n15. The Pork Chop Indeterminacy\n16. The Peanut Reaction\n17. The Tangerine Factor\n\nNow I have put the episodes in dvd9 form and ready to burn. I used convertxtodvd4 to do it. The reason I didn't do it to a dvd5 was to keep the quality at the level that eztv put them up in. (Thanks eztv). The first two versions of the show I got from people that posted under the Anonymous name so thank you to you guys who ever you are. \n\nNTSC\n\nAfter you check it out please post a comment and tell what you think of the first pilot of the show esp if you are a big fan of the show. \n\n\n\n","torrent":{"xt":"urn:btih:1a5dbba5ec4531a19da30efa83496ae0945f0e9e","amp;dn":"The+Big+Bang+Theory+Season+1+%28if+your+a+fan+this+is+worth+a+look","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a5dbba5ec4531a19da30efa83496ae0945f0e9e","infoHashBuffer":{"type":"Buffer","data":[26,93,187,165,236,69,49,161,157,163,14,250,131,73,106,224,148,95,14,158]},"announce":[],"urlList":[]}}