{"title":"WinCatalog Standard 1.094 build 04.05 [Darkman]","uid":5623104,"size":2506110,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1a7161c5d717b9d9744c3b806836f2682fa90cfe&amp;dn=WinCatalog+Standard+1.094+build+04.05+%5BDarkman%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"DarkMan70","files":-1,"time":1276356647,"description":"WinCatalog Standard 1.094 build 04.05\n-------------------------------------\n\nWinCatalog Standard is a friendly and easy-to-use program for cataloging disks, folders and files. \n\nHave you ever had to look through dozens of CDs, trying to find some file or song? With WinCatalog Standard you will never have to waste your time again. Process your CDs with WinCatalog Standard just once and from this moment on finding you will be able to find any file in a few seconds without the need to insert the disk in the drive! \n\nWinCatalog Standard keeps in its database information about all files stored on your removable media. It can extract tags from MP3, HTML files and even retrieve Audio CD track names from the Internet. \n\nWinCatalog Standard takes cataloging to the next level. This software is as easy-to-use and friendly as the Light version, but at the same time it is much more powerful and functional. Many features of this program were inspired by users' requests and feedback. \n\nWinCatalog Standard makes managing your collection much easier: you can divide it by virtual folders and add to the catalog not only disks and folders, but also the individual files. There is one more new feature: WinCatalog Standard supports non-file items enabling you to catalog your books, videos or even postage stamps and coins!\n\nThe main program window is split in three parts providing quick access to any element properties. \n\nDrag'n'drop support lets you easily and quickly associate disks with users and assign keywords to the selected items. All this combined with the powerful report generator makes WinCatalog Standard the best cataloger for advanced users. \n\nWinCatalog Standard is the best choice for those who want to manage their disk collections effectively!\n\n\nInstallation\n------------\n\n1. Run &quot;wincatalogs10.exe&quot; and Install\n\n2. Place cracked &quot;WinCatalogS.exe&quot;, from Crack dir, in installed directory and overwrite existing one.\n\nEnjoy another fine release from ARTeam.\n\n-----------------------------------------------------------------------------------\n\n\nIt's very old version but coming with working crack.\n\nIMPORTANT for Vista and Win7 x64 users - Run this program in compability mode for: &quot;Windows XP (Service Pack 3)&quot;\n\n\nCheers,\n\nDarkman","torrent":{"xt":"urn:btih:1a7161c5d717b9d9744c3b806836f2682fa90cfe","amp;dn":"WinCatalog+Standard+1.094+build+04.05+%5BDarkman%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a7161c5d717b9d9744c3b806836f2682fa90cfe","infoHashBuffer":{"type":"Buffer","data":[26,113,97,197,215,23,185,217,116,76,59,128,104,54,242,104,47,169,12,254]},"announce":[],"urlList":[]}}