{"title":"Final Fantasy The Spirits Within dvd-r ntsc eng-spa","uid":5606303,"size":7650838528,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:1b1356d1041f002f6ed7f383dd09eee51b3fc568&amp;dn=Final+Fantasy+The+Spirits+Within+dvd-r+ntsc+eng-spa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"punisher_latin","files":-1,"time":1275602900,"description":"Final Fantasy The Spirits Within 2001 (DVD-R9) \n\n\n\nGÃƒÂ©nero                  Aventura\n\nNorma de video          NTSC\n\nFormato de pantalla     1:85 Widescreen\n\nIdioma de audio         Ingles 5.1, EspaÃƒÂ±ol Latino 5.1\n\nSubtitulos              Ingles, EspaÃƒÂ±ol\n\nMenu                    SI\n\n\n\nSinopsis / Comentarios\n\n\nLa Tierra, en el aÃƒÂ±o 2065, es un caos en el que la destrucciÃƒÂ³n y la confusiÃƒÂ³n dominan todo. Las ciudades se encuentran desiertas, la poblaciÃƒÂ³n diezmada, y los pocos humanos que aÃƒÂºn quedan deben encontrar la manera para sobrevivir. Una invasiÃƒÂ³n amenaza con extinguir lo que queda de la raza humana, y posiblemente a toda criatura que habita el planeta. Ante semejante panorama, el destino de la vida en La Tierra estÃƒÂ¡ en los hombros de una mujer. Pero el tiempo se estÃƒÂ¡ agotando. Con sÃƒÂ³lo una esperanza a la vista, Aki Ross - bajo la tutela de su mentor, el Dr. Sid, y la ayuda del escuadrÃƒÂ³n Ojos Profundos - buscan la ola orgÃƒÂ¡nica, la ÃƒÂºnica esperanza para contrarestar la invasiÃƒÂ³n sin destruir el planeta. Mortalmente infectada por un extraterrestre, Aki tiene la llave para descubrir el secreto que derrotarÃƒÂ¡ a los depredadores extraterrestres. Pero la militante oposiciÃƒÂ³n del General Hein, quien planea utilizar un masivo caÃƒÂ±ÃƒÂ³n espacial que aniquilarÃƒÂ­a a los invasores y posiblemente a toda la Tierra, pone en peligro su misiÃƒÂ³n. En este mundo, la ciencia ha analizado a la vida y a la muerte, expresando a la vida como una forma de energÃƒÂ­a. A medida que el reloj avanza, Aki busca dentro de sus sueÃƒÂ±os una respuesta al misterio de los extraterrestres, mientras viaja por La Tierra recolectando las ocho olas espirituales que considere van a salvar al planeta.","torrent":{"xt":"urn:btih:1b1356d1041f002f6ed7f383dd09eee51b3fc568","amp;dn":"Final+Fantasy+The+Spirits+Within+dvd-r+ntsc+eng-spa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b1356d1041f002f6ed7f383dd09eee51b3fc568","infoHashBuffer":{"type":"Buffer","data":[27,19,86,209,4,31,0,47,110,215,243,131,221,9,238,229,27,63,197,104]},"announce":[],"urlList":[]}}