{"title":"Alex Jones Show - 2013 Jul 21 SU [sebaygo1]","uid":8723405,"size":40304424,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:1c67ec913181adf4c0b75fcce111c086f3750127&amp;dn=Alex+Jones+Show+-+2013+Jul+21+SU+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sebaygo1","files":9,"time":1374463424,"description":"\t\t\t\t\t\t\t\nThe Alex Jones Show\nSunday, 21 July 2013\n\n\n[sebaygo1]\n\nShow description from theweb site :: Alex is back in studio for this Sunday, July 21 edition of The Alex Jones Show. Obama continues his public rollout of scandals and his latest one completely eclipses the NSA spy gate. The Obamacare Federal Data Services Hub allows federal agencies to exchange Americans' personal data with each other. &quot;Alphabet&quot; agencies such as the IRS, DHS, DOJ, etc. can now pry on Americans at will by pulling up a complete federal dossier compiled on every American. \n\nGoogle expresses its intentions to &quot;transform the ways people interact with Google.&quot; The company envisions planting computer chips into people's heads. \n\nJames David Manning, chief pastor of the ATLAH World Missionary Church in New York City, joins to show to discuss the aftermath of the George Zimmerman trial. \n\nAlex also reveals the released photo of Boston bombing suspect Dzhokar Tsarnaev surrendering to authorities without a gunshot wound in his throat, stunning proof that the &quot;official&quot; story is completely wrong.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n.\n","torrent":{"xt":"urn:btih:1c67ec913181adf4c0b75fcce111c086f3750127","amp;dn":"Alex+Jones+Show+-+2013+Jul+21+SU+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c67ec913181adf4c0b75fcce111c086f3750127","infoHashBuffer":{"type":"Buffer","data":[28,103,236,145,49,129,173,244,192,183,95,204,225,17,192,134,243,117,1,39]},"announce":[],"urlList":[]}}