{"title":"Deadline Live with Jack Blood - 2010 May 05 WE [sebaygo1]","uid":5540447,"size":21540864,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:1c97711a3266d16b7045fbbfc951d363dfd89ef4&amp;dn=Deadline+Live+with+Jack+Blood+-+2010+May+05+WE+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sebaygo1","files":4,"time":1273205382,"description":"\t.\n\n\tDeadline Live with Jack Blood\n\tWednesday, 05 May 2010\n\n\taudio files are divided on hour breaks\n\n\n\n\t[sebaygo1]\n\n\n\n\n\t[show description as reported in Jack's archives]\n\n\n\n\n\tHour 1: \n\n\tPetro Cash from BP for cousin Barry and much more..\n\t[Obama was No. 1 recipient of BP political contributions in 2008]\n\n\n\n\tHour 2: \n\n\tBrian Sussman - CLIMATEGATE AUTHOR - TOPIC: TAKING ADVANTAGE OF AN OIL CRISIS \n\tBrian Sussman is author of the new bestseller \n\tClimategate: a veteran meteorologist exposes the global warming scam. \n\tAuthor Profile and Information Click Here: DebateMeAlGore.com  \n\tABOUT THE AUTHOR: \n\tFor more than 20 years Brian Sussman served as the Bay Area's most celebrated television science reporter and meteorologist, having earned honors from The Associated Press, the Radio-Television News Directors Association, the National Education Association, and the National Academy of Television Arts and Sciences. He's now the new morning man at KSFO (560 AM)the highest rated talk show in the San Francisco Bay Area and the fourth largest radio market in the country. In 2001, Brian shocked the television community by daring to leave for a career in conservative talk radio. Joining the line-up on San Francisco's KSFO-AM, Sussman has achieved huge ratings success with his program, Right Thinking from the Left Coast a steady source of irritation to the Bay Area's liberal establishment.\n\n\n\t[lengthy &quot;live-commercial&quot; for sponsor, EnerFood, toward end of hour 1]\n\n\n\n\t#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\tNot able to find a torrent of mine where or when you \n\texpected it?\n\tCheck out my torrents blog for info about what I am\n\tuploading, tracker problems, etc..\n\n\tSome sites will not allow a blogspot URL in an \n\tuploaded torrent's description, so I have included \n\tthe blog's web address in a file included with this\n\ttorrent named:\n\tsebaygo1_torrents_info_PLEASE-READ.txt\n\t#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n\t_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n\n\t It is my opinion that in this time it is virtually\n\t essential to seek information from a variety of sources, \n\t to listen to a spectrum of voices in order to better \n\t understand the &quot;big picture.&quot; A reliance solely upon\n\t mainstream corporate media for news and info is a \n\t prescription for ignorance. I try to share information\n\t that counters the monotone of mainstream corporate media.\n\t \n\t NOTE: The material here is made available strictly as\n\t information. Do not assume support or endorsement on my\n\t part of the contents. \n\n\t Think for yourself!\n\t To paraphrase the late William Cooper: \n\t Read everything, listen to everything, but believe nothing \n\t until you've researched it yourself.\n\n\t_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n\n\n\n\t==============================\n\tDeadline Live with Jack Blood is now in its 8th year of broadcasting. With several years of research and comprehensive information gathering, Jack has a serious understanding of how the Global Super Elite do their business, and delivers a daily analysis of world events with satire and a song.\n\n\tHe understands and decodes the doublespeak, and groupthink of the mainstream media, and outlines the agenda of those who would seek to kill off or enslave the planet. Jack discusses mind control, corporate corruption, the police state, globalism, the United Nations agenda (inalienable rights vs UN privileges), secret societies, government sponsored terrorism, and collectivism vs individual sovereignty.\n\n\tJack Blood is an activist, an investigative blogger, multimedia artist, and a thought criminal. Deadline Live is an Infusion of music, culture, news du jour, opinions, and reality.\n\t==============================\n\t.","torrent":{"xt":"urn:btih:1c97711a3266d16b7045fbbfc951d363dfd89ef4","amp;dn":"Deadline+Live+with+Jack+Blood+-+2010+May+05+WE+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c97711a3266d16b7045fbbfc951d363dfd89ef4","infoHashBuffer":{"type":"Buffer","data":[28,151,113,26,50,102,209,107,112,69,251,191,201,81,211,99,223,216,158,244]},"announce":[],"urlList":[]}}