{"title":"PC Ã‚Â» TRANSFORMERS - WAR FOR CYBERTRON Full Game directplay by g","uid":5649566,"size":3416190959,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1cbb272a34f8cf22de5495c911b5c68a41ebb589&amp;dn=PC+%C3%82%C2%BB+TRANSFORMERS+-+WAR+FOR+CYBERTRON+Full+Game+directplay+by+g&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"globeplus","files":-1,"time":1277610529,"description":"* Hello PC games fans ...\n\n\n* Play this new transformers game ...\n\n\nFILE INFO : few videos without sound but the subtitles do the trick and no multiplayer\n\n\n\n* GAMEPLAY : *\n\n* The plot of Transformers: War for Cybertron is set long before the events of the Transformers: Prime television series. It begins with the Decepticon campaign, though players can choose to begin with the Autobot campaign and return to the Decepticon campaign later. In the Decepticon campaign Megatron is fighting to return Cybertron to his version of the &quot;golden age&quot;, using means he considers necessary. He discovers a source of all-powerful dark energon guarded by Starscream in his research station. Megatron obtains it after a battle with Starscream and immerses himself in the dark energon. Starscream asks Megatron to teach him how to use dark energon in return for his service to Megatron. Shocked by his betrayal, Starscream's colleague Jetfire escapes the space station.\nStarscream offers to send Thundercracker and Skywarp after him, but Megatron sends the trio to reactivate the energon bridge connecting Starscream's space station and Cybertron. Megatron then develops a plan to infect the core of Cybertron with dark energon, destroying the Autobots. For this plan to succeed, Megatron launches a full-scale assault on Iacon, looking for an item called the Omega Key. The Decepticons learn that Zeta Prime has placed the key under his personal guard. Megatron's forces enter the chambers of Zeta Prime and defeat him in battle, taking him prisoner. Zeta Prime tells Megatron that the Omega Key is not actually the key, but is the means to activate the true key, a transformer known as Omega Supreme. Omega Supreme chases and attacks Megatron and his minions relentlessly. Megatron, realizing his impending peril, hatches a plan to lure Omega Supreme to a rooftop defended with turrets, where Omega Supreme is ambushed. Omega Supreme sustains heavy damage and plummets into Cybertron's lower levels.\nIn the Autobot campaign, the Autobot leader, Zeta Prime, has been reported dead and Optimus temporarily takes up the mantle of leadership. He begins recruiting new Transformers to the Autobot cause in order to fight Megatron and the Decepticons. The Autobot campaign begins with Optimus, Bumblebee and Ratchet defending their \nhome city of Iacon. Optimus, Ratchet and Bumblebee then proceed to defend Iacon by activating the planetary guns. Afterward they reactivate the communication grid and defend the Decagon from Decepticons. After reaching the Decagon, the Autobots fight Starscream and are successful in driving him into a cowardly retreat.\n\n\n\nMinimum System Requirements for Microsoft(R) Windows(R) XP / Windows Vista(R) / Windows(R) 7:\n=============================================================================================\n \n3D hardware accelerator card required - 100% DirectX(R) 9.0c-compliant 256 MB video card and drivers* \nMicrosoft(R) Windows(R) XP / Windows Vista(R) / Windows(R) 7 \nIntel(R) Core(TM) 2 Duo E4300 1.80 GHz or AMD Athlon(TM) 64 X2 Dual-Core 4000+ 2.0 GHz \n2 GB of RAM \n9 GB of uncompressed hard disk space (plus 400 MB for the Windows(R) swap file and 12 KB free for saved games) \nA 100% Windows(R) XP / Windows Vista(R) / Windows(R) 7-compatible computer system including: \nDirectX(R) 9.0c (Included) \n100% DirectX(R) 9.0c-compliant true 16-bit sound card and drivers \n100% Windows(R) XP / Windows Vista(R) / Windows(R) 7-compatible mouse, keyboard and drivers \n100% Windows(R) XP / Windows Vista(R) / Windows(R) 7-compatible 6x speed DVD-ROM drive (600 K/sec sustained \n\ntransfer rate) and drivers \n \n\n*Supported Chipsets for Windows(R) XP / Windows Vista(R) / Windows(R) 7\n\nAll NVIDIA(R) GeForce(R) 7900 GT 256 MB RAM and better chipsets (excluding 8400 cards)\n\nAll ATI Radeon (TM) X1900 256 MB RAM and better chipsets (excluding Radeon HD2400, Radeon HD2600, and Radeon \n\nHD3450)\n\nMotherboard integrated video chipsets not supported\n\n \n\nNOTICE: This game contains technology intended to prevent copying that may conflict with some disc and virtual \n\ndrives.\n\n \n\n*Versions Digitally Distributed do not require the required DVD-ROM drive.\n\n\n\n\n                          ***** enjoy ... *****","torrent":{"xt":"urn:btih:1cbb272a34f8cf22de5495c911b5c68a41ebb589","amp;dn":"PC+%C3%82%C2%BB+TRANSFORMERS+-+WAR+FOR+CYBERTRON+Full+Game+directplay+by+g","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1cbb272a34f8cf22de5495c911b5c68a41ebb589","infoHashBuffer":{"type":"Buffer","data":[28,187,39,42,52,248,207,34,222,84,149,201,17,181,198,138,65,235,181,137]},"announce":[],"urlList":[]}}