{"title":"BBC Life (2010) (Retail) (5 x DVDr) Complete [NLUPPER]","uid":5542525,"size":23438973561,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:1cf21a1c04443b3d708148cc794698c6c93a48e2&amp;dn=BBC+Life+%282010%29+%28Retail%29+%285+x+DVDr%29+Complete+%5BNLUPPER%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"NLUPPER","files":-1,"time":1273277807,"description":"BBC Life (2010)(Retail)(5 x DVDr) Complete\n\nDVD1:\n\n1:: Challenges of Life\nDieren en planten hebben allerlei verrassende strategieÃƒÂ«n ontwikkeld om te overleven. In deze aflevering zien we onder meer kapucijneraapjes die stenen 'hamers' gebruiken om noten te kraken, kameleons die de prooien van spinnen stelen en jachtluipaarden die met doordacht teamwerk jagen op struisvogels.\n\n2: Reptiles and Amphibians\nReptielen en amfibieÃƒÂ«n combineren hun oeroude, koudbloedige strategieÃƒÂ«n met verrassend slimme nieuwe trucjes om zelfs onder de meest barre omstandigheden te overleven. Zo zien we Komodo-varanen die op buffels jagen en kikkers die vleermuizen verschalken.\n\nDVD2:\n\n3: Mammals\nWij zoogdieren hebben het op aarde voor het zeggen. Maar waarom zijn we eigenlijk zo succesvol geweest? Deze aflevering laat het zien: tot in de meest extreme leefgebieden hebben de makers dierengedrag vastgelegd zoals dat nog nooit te zien is geweest.\n\n4: Fish\nIn de wereldzeeÃƒÂ«n zijn de vissen de baas. Ze zijn er in alle soorten en maten, van de majestueuze maar gevaarlijke pijlstaartrog tot het vriendelijke zeepaardje.\n\nDVD3:\n\n5: Birds\nVogels zijn de kleurrijke, dynamische meesters van het luchtruim. Met spectaculaire, speciaal voor Life ontwikkelde cameratechnieken betreden we hun wereld. We doen fascinerende ontdekkingen over hun gedrag en krijgen een compleet nieuwe kijk op deze prachtige schepsels.\n\n6: Insects\nInsecten vormen de meest diverse ÃƒÂ©n succesvolle categorie dieren op aarde. Hun grote geheim is een pantser dat alle zachte delen beschermt. In deze aflevering zien we onder meer sterk uitvergrote beelden van insecten die er plotseling uitzien als angstaanjagende monsters\n\nDVD4:\n\n7: Hunters and Hunted\nEen indrukwekkende aflevering over de dramatische wereld waarin de carnivoor en zijn prooi elke dag opnieuw als vijanden tegenover elkaar staan. We rennen mee met een jagende troep jachtluipaarden, zien hoe zeeleeuwen een dodelijk kat-en-muisspel spelen met witte haaien en hoe leeuwen en buffels samen een wankel evenwicht in stand houden. \n\n8: Creatures of the Deep\nDe zee, de grootste habitat die de aarde rijk is, herbergt vele geheimen en gevaren. Gewapend met de meest geavanceerde onderwatercamera's dalen we af naar diepten die nog nooit eerder werden verkend. We doen verbijsterende ontdekkingen en maken kennis met monsterlijke krabben, reusachtige octopussen en andere bizarre diersoorten.\n\nDVD5:\n\n9: Plants\nPlanten zijn de meest agressieve, opportunistische en egoÃƒÂ¯stische organismen ter wereld. Dat is pas ÃƒÂ©cht goed te zien met behulp van moderne filmtechnieken. Deze aflevering bevat bijvoorbeeld unieke beelden van hoe de Venus vliegenvanger zijn prooi uitzoekt en hoe sommige planten hun zaden als kanonskogels afschieten.\n\n10: Primates\nPrimaten zijn buitengewoon intelligent. Tijdens hun lange leven houden ze zich bezig met het oplossen van problemen, communicatie, het gebruiken van werktuigen en intieme sociale interactie. Deze aflevering biedt een nieuw en ongekend gedetailleerd beeld van hun wereld.\n\n\nINFO\n\nFormat : DVD5 \nSource: Retail\nSubs: Dutch ( select ) \nGenre : Docu\nAudio: English DD5.1\nVideo: 16:9\n \n","torrent":{"xt":"urn:btih:1cf21a1c04443b3d708148cc794698c6c93a48e2","amp;dn":"BBC+Life+%282010%29+%28Retail%29+%285+x+DVDr%29+Complete+%5BNLUPPER%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1cf21a1c04443b3d708148cc794698c6c93a48e2","infoHashBuffer":{"type":"Buffer","data":[28,242,26,28,4,68,59,61,112,129,72,204,121,70,152,198,201,58,72,226]},"announce":[],"urlList":[]}}