{"title":"Digimon Zero Two - S02E50","uid":5598073,"size":175245312,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1d74e45331d9dcc23b3cc7b7bfdf5e133f8365ec&amp;dn=Digimon+Zero+Two+-+S02E50&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"yulie","files":1,"time":1275129448,"description":"Synopsis:\nThe story starts again three years later, in April 2002. T. K. and Kari, now 11 years, starting the 5th year when they are called back to duty. However, as the elders are busy, between school, club and personal life, come three new Chosen Children: Davis, Yolei and Cody.\n\nThen formed a new group of DigiDestined, and while the older (especially Tai and Izzy) give a helping hand from time to time, is definitely a secondary role in history.\n\nThe enemy this time is the self-proclaimed Emperor Digimon, a boy who aspires to dominate and enslave the Digimon with the help of his Dark Tower, which prevent the Digimon of digivolved states. With the discovery Digieggs, the problem resolves itself, and then the children begin to destroy the Towers, one after another.\n\nAfter defeating the Digimon Emperor: who actually called Ken, they discover that this is nothing less than a Chosen Child and then he becomes a member of the group. They continue to fight against evil, and with the help of the Chosen Children all over the world, overcome the enemy. Since then, all people get a partner Digimon and Digital World is open to all.\n\nTwenty-five years later, we can see all the children with their adult children, who should continue the mission of the parents.\n\nThe second adventure is a little different from its predecessor, it is considerably more fun, active and mature. The animation and character design has evolved considerably, and the OST is excellent quality.\n\nThis story basically explains why almost everything that has happened before, and new things (like the existence of several other fantastic worlds and hundreds of other Chosen Children) and gives us a deeper perspective on the relationship Light / Darkness .\n\nFurthermore, the characters change so much as one would expect in three years. They are more mature and show unknown facets (like the impressive dark side of TK) or simply new lifestyles. What also changes is the relationship between the Chosen, the strong bonds and semi-friendly rivalry add to idolatrous admiration, relations of strong mutual respect and a multitude of love triangles.\n\n\n\n\nSinopse:\n\nA histÃƒÂ³ria recomeÃƒÂ§a trÃƒÂªs anos depois, em Abril de 2002. T. K. e Kari, agora com 11 anos, comeÃƒÂ§am o 5Ã‚Âº ano quando sÃƒÂ£o novamente chamados ao dever. No entanto, como os mais velhos estÃƒÂ£o ocupados, entre a escola, clubes e vida pessoal, trÃƒÂªs novas CrianÃƒÂ§as Escolhidas surgem: Davis, Yolei  e Cody.\n\nForma-se entÃƒÂ£o um novo grupo de DigiEscolhidos, e embora os mais velhos (em especial Izzy e Tai) deÃƒÂªm uma mÃƒÂ£ozinha de vez em quando, tem um papel definitivamente secundÃƒÂ¡rio na histÃƒÂ³ria.\n\nO inimigo desta vez ÃƒÂ© o auto-proclamado Imperador Digimon, um rapaz que ambiciona escravizar e dominar os Digimons com a ajuda das suas Torres Negras, que impedem os Digimons de DigiEvoluir. Com a descoberta dos DigiOvos, o problema soluciona-se, e entÃƒÂ£o as CrianÃƒÂ§as comeÃƒÂ§am a destruir as Torres, uma apÃƒÂ³s outra.\n\nDepois de derrotarem o Imperador Digimon: que na verdade se chama Ken, descobrem que este ÃƒÂ© nada mais nada menos do que uma CrianÃƒÂ§a Escolhida e entÃƒÂ£o ele torna-se um membro do grupo. Eles continuam a luta contra o mal, e com a ajuda das CrianÃƒÂ§as Escolhidas um pouco por todo o mundo, vencem o inimigo. A partir de entÃƒÂ£o, todas as pessoas recebem um parceiro Digimon e o Mundo Digital fica aberto a todos.\n\nVinte e cinco anos depois, podemos ver todas as CrianÃƒÂ§as adultas com os seus filhos, a quem cabe continuar a missÃƒÂ£o dos pais.\n\nA segunda aventura ÃƒÂ© um pouco diferente da anterior, pois ÃƒÂ© consideravelmente mais divertida, activa e madura. A animaÃƒÂ§ÃƒÂ£o e o desenho dos personagens evoluiu bastante, e a OST ÃƒÂ© de uma qualidade excelente.\n\nEsta histÃƒÂ³ria explica basicamente o porque de quase tudo o que sucedeu anteriormente, bem como novas coisas (como a existÃƒÂªncia de vÃƒÂ¡rios outros mundos fantÃƒÂ¡sticos e centenas de outras CrianÃƒÂ§as Escolhidas) e dÃƒÂ¡-nos um ponto de vista mais profundo sobre a relaÃƒÂ§ÃƒÂ£o Luz/EscuridÃƒÂ£o.\n\nPor outro lado, os personagens mudam tanto como se esperaria em trÃƒÂªs anos. EstÃƒÂ£o mais maduras e mostram facetas desconhecidas (como o impressionante lado dark de T. K.) ou simplesmente estilos de vida novos. O que tambÃƒÂ©m muda sÃƒÂ£o as relaÃƒÂ§ÃƒÂµes entre os Escolhidos, aos laÃƒÂ§os fortes e rivalidades semi-amistosas somam-se admiraÃƒÂ§ÃƒÂµes idÃƒÂ³latras, relaÃƒÂ§ÃƒÂµes de forte respeito mÃƒÂºtuo e uma infinidade de triÃƒÂ¢ngulos amorosos.\n\n\n\n\n\n\n\n\n\n\nSize:167MB\nMedia Length:00:22:40\nVideo Size:640 x 480\n\nVideo: XVID 640x480 23.98fps 892Kbps \nAudio: MPEG Audio Layer 3 44100Hz stereo 128Kbps ","torrent":{"xt":"urn:btih:1d74e45331d9dcc23b3cc7b7bfdf5e133f8365ec","amp;dn":"Digimon+Zero+Two+-+S02E50","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d74e45331d9dcc23b3cc7b7bfdf5e133f8365ec","infoHashBuffer":{"type":"Buffer","data":[29,116,228,83,49,217,220,194,59,60,199,183,191,223,94,19,63,131,101,236]},"announce":[],"urlList":[]}}