{"title":"500.Days.of.Summer.2009.1080p.BluRay-Rip.german.AC3.XviD.by.DMXC","uid":5526940,"size":1572700160,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:20582f8d962bd9db727f66e7bdde03f588e03d00&amp;dn=500.Days.of.Summer.2009.1080p.BluRay-Rip.german.AC3.XviD.by.DMXC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"DMXCrew","files":-1,"time":1272805809,"description":"(500) Days of Summer - BluRay-Rip 1080p AC3 - DTS-HD\n\nDies ist die Geschichte von einem Jungen und einem MÃƒÂ¤dchen. Aber keine Liebesgeschichte. So sieht es jedenfalls die bezaubernde Summer (Zooey Deschanel), in die sich der GruÃƒÅ¸kartenschreiber Tom (Joseph Gordon-Levitt) unsterblich verliebt hat. Doch ist es so, wie sie sagt oder ist da doch mehr? FÃƒÂ¼r ihn ist Summer ein magisches Mysterium, das ihn in einen Rausch zwischen Euphorie und Melancholie stÃƒÂ¼rzt. Doch es wird 500 Tage dauern, bis Summer weiÃƒÅ¸, ob Tom der Richtige fÃƒÂ¼r sie ist...\n\nSchon der Beginn von '(500) Days of Summer' macht klar, dass dies kein gewÃƒÂ¶hnlicher Liebesfilm ist. Nein, 500 Days ist in der Tat einer der wenigen auÃƒÅ¸ergewÃƒÂ¶hnlichen romantischen Filme, die mich begeistern - einer der nicht alle Tage in die Kinos oder auf DVD erscheint. Wir erleben 500 Tage im Leben des GruÃƒÅ¸kartentexters Tom, der sich unsterblich in Summer verliebt. Der Film begeistert dabei durch eine auÃƒÅ¸ergewÃƒÂ¶hnliche, non-lineare ErzÃƒÂ¤hlweise und vor allem durch zwei klasse Hauptdarsteller. Zooey Deschanel als Summer ist einfach zum Verlieben sÃƒÂ¼ÃƒÅ¸ und mit Gordon-Joseph Levitt kann man sofort mitfÃƒÂ¼hlen. \n\nErwÃƒÂ¤hnenswert auch: der grandiose Soundtrack, der sich perfekt in den Film einfÃƒÂ¼gt und mit GrÃƒÂ¶ÃƒÅ¸en wie den Smiths, Regina Spektor oder Feist sehr ÃƒÂ¼berzeugt und eine besondere AtmosphÃƒÂ¤re schafft. \n\nFazit: Eine perfekte Mischung, die dazu noch mit einem interessanten Ende aufwartet. Auf jeden Fall anschauen - einer der besten Filme aus 2009! Auch fÃƒÂ¼r &quot;Aussenstehende&quot; des Genres empfehlenswert. ","torrent":{"xt":"urn:btih:20582f8d962bd9db727f66e7bdde03f588e03d00","amp;dn":"500.Days.of.Summer.2009.1080p.BluRay-Rip.german.AC3.XviD.by.DMXC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20582f8d962bd9db727f66e7bdde03f588e03d00","infoHashBuffer":{"type":"Buffer","data":[32,88,47,141,150,43,217,219,114,127,102,231,189,222,3,245,136,224,61,0]},"announce":[],"urlList":[]}}