{"title":"[Kurai-Ken] Juuni Kokuki (The Twelve Kingdoms) 01-45 COMPLETO PT","uid":5614823,"size":10745218036,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:20637c4b6e3bef96cdb41e7c8d854a0cfd319c70&amp;dn=%5BKurai-Ken%5D+Juuni+Kokuki+%28The+Twelve+Kingdoms%29+01-45+COMPLETO+PT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ghalladryel","files":45,"time":1276027443,"description":"Anime Completo: 45 episÃƒÂ³dios\nNome:\n\n    * Juuni Kokuki\n\n    * The Twelve Kingdoms\n\n    * 12 Reinos\n\nFormato: *.avi\nAudio: JaponÃƒÂªs\nLegendas: PortuguÃƒÂªs BR\n\nSinopse\n\nNakajima Yoko ÃƒÂ© uma representante de classe que tenta levar uma vida normal de aluna do segundo grau. Mas com pesadelos periodicos e tendo um cabelo naturalmente vermelho, ela reconhece que ÃƒÂ© diferente de outras pessoas e nÃƒÂ£o consegue se encaixar no ambiente em que vive. Certo dia, um estranho chamado Keiki aparece e jura protege-la. Ele lhe informa que ela ÃƒÂ© seu mestre e que deve acompanha-lo para seu mundo. LÃƒÂ¡, no misterioso mundo dos 12 reinos (Juuni Kokuki), Yoko haverÃƒÂ¡ de se encontrar com o seu verdadeiro destino.\n\nO desenvolvimento dos personagens e da estÃƒÂ³ria proporciona um clima de ÃƒÂ©pico que entretÃƒÂ©m e captura sua imaginaÃƒÂ§ÃƒÂ£o. Juuni Kokuki avanÃƒÂ§a em um passo firme e atÃƒÂ© os episÃƒÂ³dios de recapitulaÃƒÂ§ÃƒÂ£o incluem algumas novas informaÃƒÂ§ÃƒÂµes em lugar de amarrar junto alguns retrospectos fortuitos. E com a histÃƒÂ³ria global dividida em capÃƒÂ­tulos, cada arco da estÃƒÂ³ria introduz personagens que estarÃƒÂ£o completamente explorados ao final da sÃƒÂ©rie. Ok, um dos capÃƒÂ­tulos intermediÃƒÂ¡rios deixa o mistÃƒÂ©rio de Takasato Kaname sem maiores explicaÃƒÂ§ÃƒÂµes, porÃƒÂ©m seu arco da estÃƒÂ³ria introduz um personagem que desempenharÃƒÂ¡ um papel importante no capÃƒÂ­tulo seguinte, e tambÃƒÂ©m servindo para familiarizar o espectador com o mundo de Juuni Kokuki. A sÃƒÂ©rie termina com uma pequena estÃƒÂ³ria secundÃƒÂ¡ria depois de finalizar em grande estilo o enredo principal; embora verdade seja dita, o anime nÃƒÂ£o aproveitou toda a estÃƒÂ³ria dos livros de que se originou.\n\nCom uma bela arte e um enredo complexo, este anime transporta vocÃƒÂª para uma terra rica em magia e histÃƒÂ³ria, e a trilha sonora combina com esta colocaÃƒÂ§ÃƒÂ£o, assim como o idioma contribui para a atmosfera, introduzindo novas palavras para conceitos conectados somente a este mundo singular. PoderÃƒÂ¡ ser duro para alguns espectadores se acostumar com palavras como &quot;kaikyaku&quot;, &quot;taiho&quot; e semelhantes - podendo ser chato para a pessoa aprender um novo vocabulÃƒÂ¡rio de mais de cinqÃƒÂ¼enta palavras para somente o primeiro arco da estÃƒÂ³ria - mas isto ajuda a formar um mundo bem desenvolvido e familiar quando o anime chega ao fim.","torrent":{"xt":"urn:btih:20637c4b6e3bef96cdb41e7c8d854a0cfd319c70","amp;dn":"%5BKurai-Ken%5D+Juuni+Kokuki+%28The+Twelve+Kingdoms%29+01-45+COMPLETO+PT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20637c4b6e3bef96cdb41e7c8d854a0cfd319c70","infoHashBuffer":{"type":"Buffer","data":[32,99,124,75,110,59,239,150,205,180,30,124,141,133,74,12,253,49,156,112]},"announce":[],"urlList":[]}}