{"title":"HOSTAGE","uid":5463890,"size":383368116,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:22eaef869c7ff32171175183a3a660333961594b&amp;dn=HOSTAGE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"nesperi","files":8,"time":1269554895,"description":"This is a cassette book. 6:56\n\nThis is the novell to the movie Hostage\n\nBook Summary\n\nThe bestselling author of Demolition Angel and L.A. Requiem returns with his most intense and intricate thriller yet. \n\nAs the Los Angeles Times said, Robert Crais is &quot;a crime writer operating at the top of his game.&quot; His complex heroes and heroines, his mastery of noir atmosphere, and his brilliant, taut plots have catapulted him into the front rank of a new breed of thriller writers. Hostage proves his earlier success was no fluke. It's an unstoppable read. \n\nAn ex-con with delusions of grandeur and his tagalong brother unwittingly team up with a psychopath one wrong word away from meltdown. When their late afternoon joyride turns into a random act of violence, they take a family hostage in the affluent bedroom community of Bristo Camino. Enter Chief of Police Jeff Talley, a stressed-out former LAPD SWAT negotiator who is hiding from his past. Plunged back into the high-pressure world that he desperately wants to forget, Talley soon learns that his nightmare has only begun. \n\nThe hostages are not who they seem, and the home contains secrets that even L.A.'s most lethal and volatile crime lord, Sonny Benza, fears. As Talley tries to hold himself together and save the people inside, the full weight of Benza's wrath descends on him, putting the police chief and his own family at risk. Soon, all involved are held hostage by the exigencies of fate and the only one capable of diffusing the standoff is the least stable of them all. \n\nHostage is a blistering stand-alone thriller with superb characters in crisis, multistranded plotting, and pitch-perfect Southern California sensibility.\n\n","torrent":{"xt":"urn:btih:22eaef869c7ff32171175183a3a660333961594b","amp;dn":"HOSTAGE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22eaef869c7ff32171175183a3a660333961594b","infoHashBuffer":{"type":"Buffer","data":[34,234,239,134,156,127,243,33,113,23,81,131,163,166,96,51,57,97,89,75]},"announce":[],"urlList":[]}}