{"title":"Canal seis de julio - Que se haga la luz - documental, SME","uid":5595724,"size":267456512,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:22f382676116bdf92a4ff9f6d1ecbbf3be02e2fe&amp;dn=Canal+seis+de+julio+-+Que+se+haga+la+luz+-+documental%2C+SME&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"neto79","files":-1,"time":1275032007,"description":"POR FAVOR DIFUNDAN ESTE VIDEO!\n\n\n\nDuraciÃƒÂ³n: 28:27 min.\n\nVideo: Xvid 512 x 384      29.97fps\n\nAudio: MPEG Audio Layer 3 48000Hz stereo 101kbps\n\n\n------------------------------------------------------------------------------\n\nQue se haga la luz, documental de Canal Seis de julio acerca del conflicto del SME y la privatizaciÃƒÂ³n de la energÃƒÂ­a elÃƒÂ©ctrica en MÃƒÂ©xico, es un esfuerzo para proporcionar informaciÃƒÂ³n que las televisoras y el gobierno federal han omitido o tergiversado, en un afÃƒÂ¡n de lesionar lo mÃƒÂ¡s posible al pueblo trabajador, no sÃƒÂ³lo quitÃƒÂ¡ndole su forma de sustento, sino tambiÃƒÂ©n por la vÃƒÂ­a de sustraerle los bienes que pertenecen a la naciÃƒÂ³n, como es el caso de la energÃƒÂ­a elÃƒÂ©ctrica, y mediante la satanizaciÃƒÂ³n polÃƒÂ­tica y mediÃƒÂ¡tica de los sindicatos y los logros contractuales.\n\nEl documental hace frente al principal argumento del gobierno de PAN, acerca de que es el SME la causa principal del quebranto de la CompaÃƒÂ±ÃƒÂ­a de Luz y Fuerza del Centro, y se exhiben datos de los &quot;favores&quot; del gobierno federal para la iniciativa privada e instituciones gubernamentales, incluida la residencia presidencial de Los Pinos, todos excusados de pagar sus recibos de consumo, mientras que al pueblo trabajador se le hace pagar a gran costo un servicio que empeora con el paso del tiempo.\n\nSe hace el recuento de las compaÃƒÂ±ÃƒÂ­as transnacionales que son las principales beneficiarias de la privatizaciÃƒÂ³n de la industria elÃƒÂ©ctrica mexicana, de la apresurada instalaciÃƒÂ³n de la fibra ÃƒÂ³ptica a cargo de compaÃƒÂ±ÃƒÂ­as propiedad de dos ex-secretarios panistas, asÃƒÂ­ como de las protestas en varias partes del paÃƒÂ­s por mal servicio y costos excesivos de la CFE.\n\nTambiÃƒÂ©n se incluyen reflexiones sobre el tema realizadas por el escritor Carlos Montemayor y se entregan dos mensajes de solidaridad con los trabajadores electricistas del SME, del escritor Paco Ignacio Taibo y de monseÃƒÂ±or Samuel Ruiz, respectivamente. &lt;a href=&quot;\nhttp://www.kaosenlared.net/noticia/video-mexico-que-se-haga-luz&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.kaosenlared.net/noticia/video-mexico-que-se-haga-luz&lt;/a&gt;\n\n-------------------------------------------------------------------------------\n\nCanalseisdejulio es un pequeÃƒÂ±o medio de comunicaciÃƒÂ³n que difunde informaciÃƒÂ³n y opiniÃƒÂ³n acerca de temas que la televisiÃƒÂ³n comercial mexicana omite o distorsiona.\n\nLa prÃƒÂ¡ctica de la piraterÃƒÂ­a ha contribuido a ampliar la difusiÃƒÂ³n de diversos documentales del canalseisdejulio.\n\nNo obstante, el copiado no autorizado de estos trabajos es cada vez mayor y pone en riesgo la continuidad de un proyecto que no comercializa sus contenidos, no recibe subsidios y requiere de recursos econÃƒÂ³micos para la producciÃƒÂ³n de nuevos documentales.\n\nEs deseable que quienes aprecian la labor que desarrolla canalseisdejulio procuren adquirir las copias originales que este grupo difunde directamente; es justo que quienes practican la piraterÃƒÂ­a le devuelvan al canalseisdejulio una parte de la utilidad que obtienen del esfuerzo que estÃƒÂ¡ detrÃƒÂ¡s de cada uno de esos documentales\n &lt;a href=&quot;\nhttp://www.canalseisdejulio.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.canalseisdejulio.com/&lt;/a&gt;","torrent":{"xt":"urn:btih:22f382676116bdf92a4ff9f6d1ecbbf3be02e2fe","amp;dn":"Canal+seis+de+julio+-+Que+se+haga+la+luz+-+documental%2C+SME","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22f382676116bdf92a4ff9f6d1ecbbf3be02e2fe","infoHashBuffer":{"type":"Buffer","data":[34,243,130,103,97,22,189,249,42,79,249,246,209,236,187,243,190,2,226,254]},"announce":[],"urlList":[]}}