{"title":"Henok_Achido-Almaz_Charming_Child-2009-pLAN9","uid":5457962,"size":81547723,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:259683876dacbcf44e2017d52189e484f0829040&amp;dn=Henok_Achido-Almaz_Charming_Child-2009-pLAN9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tekarr","files":18,"time":1269380787,"description":"\n+----------------+------------------------------------------+----------------+\n|                                                                            |\n|   Artist  : Henok Achido                                                   |\n|   Album   : Almaz Charming Child                                           |\n|   Bitrate : 186 kbps avg                                                   |\n|                                                                            |\n+-------------------------------[Release Info]-------------------------------+\n|                                                                            |\n|   Source     : CD                                                          |\n|   Label      : DLX                                                         |\n|   Year       : 2009                                                        |\n|   Genre      : Hip-Hop                                                     |\n|                                                                            |\n|   Rip date   : 2009-02-26                                                  |\n|   Store date : 2009-02-25                                                  |\n|                                                                            |\n|   Encoder    : LAME                                                        |\n|   Size       : 81.00 megs                                                  |\n|                                                                            |\n+--------------------------------[Track List]--------------------------------+\n|                                                                            |\n|  1.  Intro (Featuring Aaron Phiri)                                  2:19   |\n|  2.  Almaz Charming Child                                           2:53   |\n|  3.  No Rest For The Wicked                                         4:37   |\n|  4.  Crazy                                                          4:53   |\n|  5.  Fly Fresh                                                      5:04   |\n|  6.  Holes In My Dreams (Featuring Joey Fever)                      3:42   |\n|  7.  Pusher (Featuring Sophia Somajo)                               4:10   |\n|  8.  Heartbreak Hotel                                               3:50   |\n|  9.  Tower Of Hope (Interlude)                                      1:51   |\n|  10. Stones In My Shoe (Featuring The Sun)                          4:56   |\n|  11. High On Life (When The Drugs Don't Work)                       4:52   |\n|  12. Mirror Performance                                             4:57   |\n|  13. Achido For Winner                                              4:57   |\n|  14. Can I (Bonus)                                                  3:35   |\n|  -----------------------------------------------------------------------   |\n|                                                                    56:36   |\n|                                                                            |\n+-------------------------------[Release Notes]------------------------------+\n|                                                                            |\n|  Henok Achido took his first step into the light in music in 2001. His     |\n|  legendary feature on the two grammy winning song -Mina Hundar- became a   |\n|  controversy on the Swedish hiphop scene, only at the age of 18. After     |\n|  his guest appearance and touring all over Scandinavia, he still did not   |\n|  create music consistently, due to personal reasons and lacking            |\n|  motivation to persuade his own music career but that would took a huge    |\n|  turn on the summer of 2006.                                               |\n|                                                                            |\n|  Henok Achido was born Henok Meharena on the 5th of September 1982,        |\n|  raised in a single parent home in the southern parts of Sweden. The       |\n|  musical influence originated from his family, mainly his mother, uncle &amp;  |\n|  cousins, all huge music fans, which later persuaded him to purchase his   |\n|  first vinyl with the weekly allowance at the age of 8. Although the       |\n|  response for Henok was massive, he still did not feel satisfied with the  |\n|  mind state and lacked maturity and the preparation to be the complete     |\n|  musician he desired. After, Mina Hundar, Henok dropped out of high        |\n|  school and moved to Stockholm to continue recordings but still did not    |\n|  feel that his timing was right. However, that all changed in mid 2006.    |\n|                                                                            |\n|  Henok Achido has always been known for having a strong character, plus    |\n|  the combination of unique flow, determination, cockiness &amp; inventive      |\n|  word play describes Henoks Achido the artist best. In early 2006, Henok   |\n|  recorded a song called 'Million Dollar Baby' that was a groundbreaking    |\n|  change and took him back to the light of music. The song received         |\n|  massive response and was featured in TV (MTV), Radio (P3), Skatefilms     |\n|  (La Famillionaire, Aggressive sport commercial for Stadium), and          |\n|  Compilation albums (Scandinavian Hiphop invasion (Fr), Nu Jerzey Devil &amp;  |\n|  BWS presents Hell Raiser vol.2 (US). The musicvideo for Million Dollar    |\n|  Baby was directed by Tecle Street in the summer in 2006 and shortly       |\n|  after Henok was signed to label DLX entertainment by co-founder Astma.    |\n|  After being signed to DLX, Henok released an 8 track free download EP     |\n|  called -That Fucking Guy The EP- in May 2007 that received more than      |\n|  35.000 downloads worldwide. Furthermore, In October 07, He was asked to   |\n|  perform as supporting act for legendary rapper Rakims' European Tour but  |\n|  unfortunately his tour was cancelled at last minute, however, Henok has   |\n|  already a few artist under his belt as a supporting act such as Saigon    |\n|  (US), DJ Drama (US), Willie Da Kid (US), Onyx (US) and Gangstarr (US).    |\n|                                                                            |\n|  At this moment, Henok is recording his highly anticipated debut album     |\n|  called Almaz Charming Child and did earlier this year also release 2      |\n|  free downloads called Henok vs The Prodigy.1 and 2, where he raps on the  |\n|  legendary techno songs No Good &amp; Magic people. The controversial songs    |\n|  did receive more than 10,000 downloads and controversial discussion       |\n|  regarding his flows' potential and placed his capacity beyond anything    |\n|  else Sweden has ever seen before. The free download EP and songs did      |\n|  also result in Henok starting to receive more attention overseas and was  |\n|  just recently posted as new artist spotlight on two of the biggest U.S    |\n|  hip hop blogs (www.realtalkny.net) and (www.youheardthatnew.com). 2008    |\n|  will be busy year for Henok Achido, at the moment he is recording his     |\n|  album, doing interviews for websites, magazines and radio and has done    |\n|  shows all over Sweden, France, Holland and Poland. Henok also came        |\n|  second place on the Swizz Beatz competition organized by the Source       |\n|  Magazine &amp; Musicvideo20.com which will result in short coverage in next   |\n|  edition of the Source mag.                                                |\n|                                                                            |\n|  His first video from the debut album -Almaz Charming Child- called Can I  |\n|  has just finished its recordings and premiered on TV a few weeks ago.     |\n|  The video is created by 5 different directors, Senay, Kristoff Kolacz,    |\n|  Tekle Street, Morgan RÃƒÂ¶hl and Douglas Wahlberg and is already airing on   |\n|  TV.                                                                       |\n|                                                                            |\n|  Henok Achido music has been cherished by people from the globes all       |\n|  continents and the breakthrough of his music career is one song away.     |\n|                                                                            |\n+----------------------------------------------------------------------------+\n","torrent":{"xt":"urn:btih:259683876dacbcf44e2017d52189e484f0829040","amp;dn":"Henok_Achido-Almaz_Charming_Child-2009-pLAN9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"259683876dacbcf44e2017d52189e484f0829040","infoHashBuffer":{"type":"Buffer","data":[37,150,131,135,109,172,188,244,78,32,23,213,33,137,228,132,240,130,144,64]},"announce":[],"urlList":[]}}