{"title":"Alchemy.Mindworks.Screen.Saver.Construction.Set.v2.0a.46.Incl.Ke","uid":5469600,"size":8805325,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2827a033b5028e374a4b834d4c532874b74afa46&amp;dn=Alchemy.Mindworks.Screen.Saver.Construction.Set.v2.0a.46.Incl.Ke&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"artpepper","files":-1,"time":1269809399,"description":"Alchemy Mindworks Screen Saver Construction Set v2.0a.46 | 8.18 Mb\n\nScreen Saver Construction Set is the ultimate platform to build distributable multimedia Windows screen savers.Fast,flexible and easy to use, it will let you assemble screen savers of your own design out of pictures,animations,text and sounds.It will import graphics from most popular formats,including JPG,PCX,TGA,BMP,GIF and PNG,and sounds from WAV and MIDI files.\n\n\n\nScreen Saver Construction Set also includes ANIMAL, a powerful development environment that will provide you with the tools to build screen savers to do just about anything you can imagine. The ANIMAL programming language is dead easy to master, even if all your previous computer programming has involved an eight-pound sledge hammer and a chain saw.\n\nThe extensive documentation and tutorials included with Screen Saver Construction Set will typically get you up to speed in less than twelve seconds. Your performance may vary slightly, but it will still be impressively quick.\n\nBuild screen savers of your family, your corporate logo, advertisements for your products, desktop themes or your most inventive fantasies.\n\n\nBuild screen savers effortlessly.\nImport graphics from many other popular Windows applications.\nAdd sound effects and background music to your screen savers.\nInclude sophisticated animations in your screen savers.\nAdd applets of your own devising.\nDistribute your screen savers with no run-times or DLLs to lose.\nCreate professional Windows installers for your screen savers.\nPassword-protect your screen savers to keep your work safe.\n\nHome Page - http://www.mindworkshop.com/alchemy/scspro.html\n\n1. Install app\n2. When asked to register, use keygen to generate your registration data\n","torrent":{"xt":"urn:btih:2827a033b5028e374a4b834d4c532874b74afa46","amp;dn":"Alchemy.Mindworks.Screen.Saver.Construction.Set.v2.0a.46.Incl.Ke","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2827a033b5028e374a4b834d4c532874b74afa46","infoHashBuffer":{"type":"Buffer","data":[40,39,160,51,181,2,142,55,74,75,131,77,76,83,40,116,183,74,250,70]},"announce":[],"urlList":[]}}