{"title":"Martin Conisby's Vengeance by Jeffery Farnol","uid":8745044,"size":354515,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:282fabbc58e6edde40c9d3d3b498fe6a7cbec802&amp;dn=Martin+Conisby%27s+Vengeance+by+Jeffery+Farnol&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"OrajelJunkie","files":-1,"time":1374900992,"description":"Author: Jeffery Farnol\nPublished: 1921\nLanguage: English\nWordcount: 98,271 / 279 pg\n\n\nThis book was originally published prior to 1923, and represents a reproduction of an important historical work, maintaining the same format as the original work. While some publishers have opted to apply OCR (optical character recognition) technology to the process, we believe this leads to sub-optimal results (frequent typographical errors, strange characters and confusing formatting) and does not adequately preserve the historical character of the original artifact. We believe this work is culturally important in its original archival form. While we strive to adequately clean and digitally enhance the original work, there are occasionally instances where imperfections such as blurred or missing pages, poor pictures or errant marks may have been introduced due to either the quality of the original work or the scanning process itself. Despite these occasional imperfections, we have brought it back into print as part of our ongoing global book preservation commitment, providing customers with access to the best possible historical reprints. We appreciate your understanding of these occasional imperfections, and sincerely hope you enjoy seeing the book in a format as close as possible to that intended by the original publisher.","torrent":{"xt":"urn:btih:282fabbc58e6edde40c9d3d3b498fe6a7cbec802","amp;dn":"Martin+Conisby%27s+Vengeance+by+Jeffery+Farnol","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"282fabbc58e6edde40c9d3d3b498fe6a7cbec802","infoHashBuffer":{"type":"Buffer","data":[40,47,171,188,88,230,237,222,64,201,211,211,180,152,254,106,124,190,200,2]},"announce":[],"urlList":[]}}