{"title":"Front Line Assembly 100% Lossless - 100% Discography","uid":5466650,"size":13776582627,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:28aad8cbecbac20e4d61885f55fdb8355a6d373b&amp;dn=Front+Line+Assembly+100%25+Lossless+-+100%25+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"NINgod","files":369,"time":1269650024,"description":"Okay, enough dicking around with you folks. I have gone ALL OUT. I have every single official, non-live Front Line Assembly release in 100% lossless. This of course excludes Nerve War which was released on tape, so lossless is physically impossible, but i included it anyway. All were ripped by snooty private tracker people or me with the best cd ripper available for OS X, which is XLD (equivalent to EAC for Windows).\n\nThis will be my final discography for Front Line Assembly. I will only update it with amendments as they release more albums. \n\nI did not include pointless albums like &quot;Explosion&quot; since every song on that compilation is already within all the other albums. &quot;Total Terror&quot; is the same since &quot;Complete Total Terror&quot; is remastered and includes an extra track or two.\n\n\nREMEMBER FRIENDS; LOSSLESS TO LOSSLESS = LOSSLESS, LOSSLESS TO MP3 = LOSSY FOREVER (no more high quality, ever again)\n\n\nI don't care about live bootlegs etc. so if you want them, find them.\n\nAll album artwork comes in corresponding album folder. All artwork is high quality and run through Photoshop individually. Perfect for iTunes Cover Flow or just for kicks. \n\nVERY organized because i am OCD about that kinda stuff\n\nCan't go wrong if you love industrial because along with Skinny Puppy, Front 242, Ministry, KMFDM, and Throbbing Gristle they started industrial music as we know it.\n\nYou will not find a better collection period. All the other runner-ups were made by me anyway. Just in case, here is why mine rocks your face:\nA] 100% discography\nB] Organized\nC] High quality album art\nD] Lossless\n\nLove you and SEED!!! WHOOOO!\n-AkW","torrent":{"xt":"urn:btih:28aad8cbecbac20e4d61885f55fdb8355a6d373b","amp;dn":"Front+Line+Assembly+100%25+Lossless+-+100%25+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28aad8cbecbac20e4d61885f55fdb8355a6d373b","infoHashBuffer":{"type":"Buffer","data":[40,170,216,203,236,186,194,14,77,97,136,95,85,253,184,53,90,109,55,59]},"announce":[],"urlList":[]}}