{"title":"Queen - Innuendo  (2nafish)","uid":5472074,"size":235038724,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:292886dcecd7040610ac1296edec3f67197d7388&amp;dn=Queen+-+Innuendo++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1269945930,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Innuendo&quot; is a song by English rock band Queen. It is the opening track on the 1991 album of the same name. Though credited to the whole band, the song's mainly written by Freddie Mercury, with lyrics by Roger Taylor. At six and a half minutes, it is one of Queen's longest songs, and their longest ever released as a single, exceeding &quot;Bohemian Rhapsody&quot; by 35 seconds. Like &quot;Bohemian Rhapsody&quot;, it was released as the first single from its parent album, despite its length and complexity, going straight to #1 in the UK Singles Chart. Featured is a flamenco  guitar section performed by Yes  guitarist Steve Howe and Brian May, an operatic interlude that harks back to the Queen of old, sections of heavy metal, and lyrics inspired in part by Mercury's illness. Accompanied by a powerful music video featuring animated representations of the band on a cinema screen akin to Nineteen Eighty-Four, eerie plasticine figure stop motion and harrowing imagery, it has been described as one of the band's darkest and most moving works.\n\nA very elaborate music video was created to accompany the single, combining Stop Motion animation with live action and digital mask replacement and featuring plasticine figures reminiscent of the album artwork in a detailed miniature cinema set. The band members only appear as illustrations and images, mainly taken from earlier Queen music videos (such as &quot;The Miracle&quot;, &quot;Scandal&quot;, &quot;Breakthru&quot;, &quot;The Invisible Man&quot;, &quot;I Want It All&quot;, and clips from &quot;Live at Wembley Stadium 1986&quot;), on a cinema screen in the same manner as in the film Nineteen Eighty-Four, with Freddie drawn in the style of Leonardo da Vinci, Brian in the style of Victorian etchings, Roger in the style of Jackson Pollock, and John in the style of Pablo Picasso. It also featured a montage of historical images and photographs. The video won production company DoRo (who also produced the videos to all other singles from the Innuendo album) a Monitor Award  for Best Achievement in Music Video.\n\nAn early draft of the video for Innuendo was banned from American television due to the inclusion of footage from the Gulf War. An alternate video (without the footage) was released and received moderate airplay in the United States.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:292886dcecd7040610ac1296edec3f67197d7388","amp;dn":"Queen+-+Innuendo++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"292886dcecd7040610ac1296edec3f67197d7388","infoHashBuffer":{"type":"Buffer","data":[41,40,134,220,236,215,4,6,16,172,18,150,237,236,63,103,25,125,115,136]},"announce":[],"urlList":[]}}