{"title":"Nobel Peace Prize movie collection version 01","uid":5605085,"size":734113133,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:29698f249094ddaaa9e0d789397db5870383411f&amp;dn=Nobel+Peace+Prize+movie+collection+version+01&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"best_collections","files":7,"time":1275549818,"description":"Make sure to check back my user page soon: the version 2 will come out soon with much more documents. Comments and suggestions are welcome.\n\n\n--\nI may not be able to seed 24h/24, but I will seed at least until version 2 of this collection comes out. Thank you for helping me seed.\n\n----\nHello,\n\nThank for your downloading and seeding the Nobel Peace Prize movie collection.\n\nFirst of all, make sure you are downloading the latest version of the collection.\nAs the collection is being built up, files and movies will be added to the collection.\nOlder versions of the collection will no longer be seeded in order to upload newer versions.\nSo, before you carry on downloading this torrent, check that you are downloading the latest version\nat the following address: &lt;a href=&quot;\nhttp://thepiratebay.se/user/best_collections&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/best_collections&lt;/a&gt;\n\nIf you have already partly or completely downloaded an earlier version of this collection, you do\nnot need to download the whole collection all over again. Simply download the newest version into the same\ndirectory, and instruct your bittorrent client to do a checksum against the new torrent so that you only\ndownload the newest files (I welcome more precise instructions for each bittorrent client.\nI'll include the instructions here.)\n\nCheck the CHANGELOG.txt file to see what has changed between versions and for more precise instructions on\ncompleting the collection.\n\nI welcome any suggestions for inclusion in this collection. I'll check all your comments on the torrent download\npage of the newest version of this collection.\n\nPlease remember to seed!\n\nTogether, we can make this torrent the best collection available.\n\n\n\nThank you.\n\n\nBest Collections.\n\nNobel Peace Prize movie collection.\n-----------------------------------\n\nReview this CHANGELOG carefully. For each new file, we try to add the source so that\nif you already downloaded the file from that same source, you only need to change the\nfile name as indicated and get your bittorrent client to do a hash check, so that you\ncan complete this torrent and seed quicker.\n\n\n\nComing soon:\n------------\nVersion 2 of this collection will include &quot;An Inconvenient Truth&quot; downloaded from here:\nhttp://thepiratebay.se/torrent/5355296/An.Inconvenient.Truth.2006.720p.HDTV.x264-CHD\nYou can download it now so that you can help us seed the next version of this collection.\n\nWanted:\n-------\nThe movie 'Ghandi'. Even though Ghandi was not a Nobel Peace Prize laureate, following his assassination\nin 1948 the committee considered awarding it to him posthumously but decided against it and instead\nwithheld the prize that year with the explanation that &quot;there was no suitable living candidate.&quot;\n\n\n\n\n===================\nVersion 01\n===================\nRelease date: 3rd June 2010.\n\nAdded:\n1991_Aung_San_Suu_Kyi/Beyond_Rangoon_1995.avi\nThe movie originates from:\nhttp://thepiratebay.se/torrent/4913589/Beyond_Rangoon\nThe file name has been changed thus:\nbeyond.rangoon.avi -&gt; Beyond_Rangoon_1995.avi\n\n\nAung San Suu Kyi\n\nNobel Peace Prize laureate in 1991 &quot;for her non-violent struggle for democracy and human rights&quot; &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Aung_San_Suu_Kyi&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Aung_San_Suu_Kyi&lt;/a&gt;\nhttp://nobelprize.org/nobel_prizes/peace/laureates/1991/kyi.html\n\nAung San Suu Kyi (born 19 June 1945) is a Burmese opposition politician and was General Secretary of the National League for Democracy. In the 1990 general election, Aung San Suu Kyi was elected Prime Minister, as leader of the winning National League for Democracy party, which won 59% of the vote and 394 of 492 seats. She had, however, already been detained under house arrest before the elections. She has remained under house arrest in Myanmar for almost 14 out of the past 20 years.\n\nAung San Suu Kyi was the recipient of the Rafto Prize and the Sakharov Prize for Freedom of Thought in 1990 and the Nobel Peace Prize in 1991. In 1992 she was awarded the Jawaharlal Nehru Award for International Understanding by the Government of India.\n\n== MEDIA ==\n\n\n1 - Beyond Rangoon\n================== &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0112495/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0112495/&lt;/a&gt;\nhttp://en.wikipedia.org/wiki/Beyond_Rangoon\n\nBeyond Rangoon is a 1995 drama film directed by John Boorman about Laura Bowman (played by Patricia Arquette), an American tourist who vacations in Burma (Myanmar) in 1988, the year in which the 8888 Uprising takes place. The film was mostly filmed in Malaysia, and, though a work of fiction, was inspired by real people and real events.\n\nThe film was an official selection at the 1995 Cannes Film Festival, where it was one of the popular hits of the event.\n\nThe film may have had an impact beyond movie screens. Only weeks into its European run, the Burmese military junta freed Nobel Peace Prize winner Aung San Suu Kyi (depicted in the film) after several years under strict house arrest. The celebrated democracy leader thanked the filmmakers in her first interview with the BBC. As the world knows, Suu Kyi was re-arrested a few years later, but Beyond Rangoon had already helped raise world attention on a previously &quot;invisible&quot; tragedy: the Massacres of 1988 and the cruelty of her country's military rulers. &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/8888_Uprising&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/8888_Uprising&lt;/a&gt;\n\n\n\n","torrent":{"xt":"urn:btih:29698f249094ddaaa9e0d789397db5870383411f","amp;dn":"Nobel+Peace+Prize+movie+collection+version+01","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29698f249094ddaaa9e0d789397db5870383411f","infoHashBuffer":{"type":"Buffer","data":[41,105,143,36,144,148,221,170,169,224,215,137,57,125,181,135,3,131,65,31]},"announce":[],"urlList":[]}}