{"title":"First.Gape.Experience.XXX.DVDRip","uid":8862055,"size":1661101927,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:2a12d80e2e85e0ed52473d086db1050c91041733&amp;dn=First.Gape.Experience.XXX.DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":-1,"time":1377800899,"description":"Category Anal\n\n Director Omar Galanti\n Starring Lizaveta, Branda Hally, Bella Marichelli, Suzana Scott\n\n All Anal POV Extravaganza!\n\n Because nothing in a young woman's life could be more poignant than her anal gaping debut, ass-crazed director Omar Galanti initiates his favorite starlets with colon-expanding sessions of hard-core rectal pounding. In 'First Gape Experience,' the notorious Italian pervert buggers a bevy of beautiful, all-natural Russian models, stretching their virgin buttholes with his massive, menacing prick until their bungholes yawn widely for the first time. Soft, sexy Bella Marchelli receives a blindfolded mouth-fuck, then takes the director's giant cock up her plush, round bottom till her sphincter dilates. Bella slurps his thick tool ass-to-mouth, and her pretty face ends up dripping messy sperm.\n\n Next, dick-starved, fishnet-clad harlot Suzanna Scott gets her fleshy rump reamed by the beefy bald stud! Omar opens her rectal cavity with phallic toys and thrusts his veiny cock deep into Suzanna's bowels in a passionate introduction to the joys of asshole wreckage. Slim, petite brunette Lizaveta K. orally worships his meaty tool, rides Omar's fat shaft and gets her flat tummy splattered with spunk. Up steps Branda Hally, an ultra-skinny girl with a hairy pussy; she can take plenty of slapping, deep-throat face fucking and anal plunging. Omar punishes Branda's booty, loosening it with dildos and his giant dick, and pulls the kinky slut's mouth open for his cum with a dental spreader! An anal whore never forgets her first time, and after these stunning young women have graduated from Omar Galanti's 'First Gape Experience,' there's no going back - sex will never be normal again!\n\n\n &lt;a href=&quot;\nhttp://bayimg.com/AAPFJaaed&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/AAPFJaaed&lt;/a&gt;","torrent":{"xt":"urn:btih:2a12d80e2e85e0ed52473d086db1050c91041733","amp;dn":"First.Gape.Experience.XXX.DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a12d80e2e85e0ed52473d086db1050c91041733","infoHashBuffer":{"type":"Buffer","data":[42,18,216,14,46,133,224,237,82,71,61,8,109,177,5,12,145,4,23,51]},"announce":[],"urlList":[]}}