{"title":"A Night to Remember","uid":8860406,"size":3076282368,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:2bfba91d7a78aa0509c9270553b67e1a69cce4f1&amp;dn=A+Night+to+Remember&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":7,"time":1377759593,"description":"Director: Roy Ward Baker \nWriters: Walter Lord (from the book by), Eric Ambler (screenplay) \nStars: Kenneth More, Ronald Allen, Robert Ayres\n\n\n\nStoryline\n\n A successful attempt at an even-handed portrayal of the White Star Line's (later part of Cunard) luxury liner R.M.S. Titanic's sinking from the standpoint of 2nd Officer Charles Herbert Lightoller, himself the most senior of the ill-fated ship's Deck Officers to survive the disaster. (Lightoller later went on to distinguish himself as a line British Naval Officer during the First World War and served as a Senior Naval Staff Officer (convoys) during WWII. Between wars he owned and operated a successful family business producing pleasure craft.) His own survival of the sinking, along with several others, is shown atop one of the liner's two &quot;collapsible&quot; lifeboats which was capsized in floating off the liner as it sank. The picture depicts then known facts (c1958) as reported after the sinking; such as the woeful lack of adequate lifeboats, the ship's band playing true to the very end, White Star's co-owner Bruce Ismay's somewhat less than chivalrous departure from the sinking vessel -...","torrent":{"xt":"urn:btih:2bfba91d7a78aa0509c9270553b67e1a69cce4f1","amp;dn":"A+Night+to+Remember","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bfba91d7a78aa0509c9270553b67e1a69cce4f1","infoHashBuffer":{"type":"Buffer","data":[43,251,169,29,122,120,170,5,9,201,39,5,83,182,126,26,105,204,228,241]},"announce":[],"urlList":[]}}