{"title":"Windows Loader v 1.8.2.zip   carter67","uid":5598280,"size":1279883,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2c4811c583e938134598f8fed20d271d6cc3778a&amp;dn=Windows+Loader+v+1.8.2.zip+++carter67&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"carter67","files":1,"time":1275142866,"description":"I claim no credit for making this...Thanks to DMAN999 &amp; DAZ\n\nAbout:\nThis is the loader application thats used by millions of people worldwide, \nwell known for passing Microsoft's WAT (Windows Activation Technologies) and is arguably the safest Windows activation exploit ever created. \nThe application itself injects a SLIC (Software Licensing Description Table) into your system before Windows boots, \nthis is what fools Windows into thinking it's genuine.\n\nFeatures\nÃƒÂ¯Ã‚Â¿Ã‚Â½Can be run as a standalone application\nÃƒÂ¯Ã‚Â¿Ã‚Â½Works well with all system languages\nÃƒÂ¯Ã‚Â¿Ã‚Â½Argument support for silent installs\nÃƒÂ¯Ã‚Â¿Ã‚Â½Can be used for pre-activation\nÃƒÂ¯Ã‚Â¿Ã‚Â½Application integrity checking\nÃƒÂ¯Ã‚Â¿Ã‚Â½Custom error handling\nÃƒÂ¯Ã‚Â¿Ã‚Â½Support for hidden partitions and complex setups\nÃƒÂ¯Ã‚Â¿Ã‚Â½Can work alongside Linux's GRUB or any other boot manager\nÃƒÂ¯Ã‚Â¿Ã‚Â½Works with TrueCrypt and many other types of hard drive encryption applications\nÃƒÂ¯Ã‚Â¿Ã‚Â½Add your own certificates and serials externally\nÃƒÂ¯Ã‚Â¿Ã‚Â½Offers certificate and serial installation only for users with an existing SLIC 2.1\nÃƒÂ¯Ã‚Â¿Ã‚Â½Automated system profiling (The application matches everything up for you)\n\nThe rundown\nÃƒÂ¯Ã‚Â¿Ã‚Â½This will run on x86 and x64 systems \nÃƒÂ¯Ã‚Â¿Ã‚Â½This can activate all Windows versions at the same time, just install it on each \nÃƒÂ¯Ã‚Â¿Ã‚Â½No core system files get modified \nÃƒÂ¯Ã‚Â¿Ã‚Â½No extra processes are run so you have nothing eating at your RAM \nÃƒÂ¯Ã‚Â¿Ã‚Â½All key parts of the exploit are encrypted with a custom encryption \nÃƒÂ¯Ã‚Â¿Ã‚Â½The exploit runs before Windows so it's harder for Microsoft to prevent \nÃƒÂ¯Ã‚Â¿Ã‚Â½The exploit patches all necessary tables making activation look authentic \nÃƒÂ¯Ã‚Â¿Ã‚Â½The application will select the best profile for your system during installation \nÃƒÂ¯Ã‚Â¿Ã‚Â½Each and every user has a unique version of the exploit installed on his/her system \n\nSupported operating systems\nÃƒÂ¯Ã‚Â¿Ã‚Â½Windows 7 Ultimate\nÃƒÂ¯Ã‚Â¿Ã‚Â½Windows 7 Professional\nÃƒÂ¯Ã‚Â¿Ã‚Â½Windows 7 Home Premium\nÃƒÂ¯Ã‚Â¿Ã‚Â½Windows 7 Home Basic\nÃƒÂ¯Ã‚Â¿Ã‚Â½Windows 7 Starter\nÃƒÂ¯Ã‚Â¿Ã‚Â½Windows Vista Ultimate\nÃƒÂ¯Ã‚Â¿Ã‚Â½Windows Vista Business\nÃƒÂ¯Ã‚Â¿Ã‚Â½Windows Vista Business N\nÃƒÂ¯Ã‚Â¿Ã‚Â½Windows Vista Home Premium\nÃƒÂ¯Ã‚Â¿Ã‚Â½Windows Vista Home Basic\nÃƒÂ¯Ã‚Â¿Ã‚Â½Windows Vista Starter\nÃƒÂ¯Ã‚Â¿Ã‚Â½Windows Server 2008 R2: Enterprise\nÃƒÂ¯Ã‚Â¿Ã‚Â½Windows Server 2008 R2: Standard\nÃƒÂ¯Ã‚Â¿Ã‚Â½Windows Server 2008 R2: Foundation\nÃƒÂ¯Ã‚Â¿Ã‚Â½Windows Server 2008: Enterprise\nÃƒÂ¯Ã‚Â¿Ã‚Â½Windows Server 2008: Standard\nÃƒÂ¯Ã‚Â¿Ã‚Â½Windows Server 2008: Foundation\nÃƒÂ¯Ã‚Â¿Ã‚Â½Windows Small Business Server 2008\nNote: You must be running build 7600 or greater for Windows 7 and Windows Server 2008 R2.\nNote: Windows 7 N and E editions will only be supported when OEM SLP serials leak for them editions.\n\nVersion 1.8 changes:\n* Cleaned up and improved a lot of code\n* Added a new GRLDR version (Thanks to lash78 for spending a few hours helping to debug)\n* Made the UI even more user friendly\n* Added some new serials\n* Improved certificate OEMID to system OEMID installation\n* Made OEM recovery partition ignoring optional\n\nApplication integrity checking?\nHover your mouse over the green, amber or red icon to see detailed application information.\nNote: Even if the icon is green someone might have found a way around the protection system so it's worth checking that the applications path is always the same as the location from which you launched the application. You should also check that the MD5 matches the MD5 found online.\n\nWhats the goal of this program?\nTo activate you in a clean and simple way without putting a load of buttons and checkboxes on your screen and expecting you to know what to do. It's all about keeping it simple!\n\nWhat makes this different from every other loader out at the moment?\nIt's the only fully coded API based loader application, this means it cuts out the middle man (.NET framework) and can handle everything on it's own. This increases reliability and is considered the professional coder approach.\n\nSo whats the advantages and why should you care?\nWith me building this loader as an application I can access system details and create declares for many of the functions. This means anyone that uses this loader should have a greater chance of success!\n\nWhats the differences between each loader option?\nEach option uses a slightly different method to get you activated, of course the custom menu.lst option should be ignored unless you know what you're doing.\n\nOK so how do I run it?\nIn general you simply press Install!\n\nI activated Windows 7 and now I want to activate Windows Vista, why isn't it working?\nUse the uninstall option while on Windows 7 and reboot into Windows Vista. Next install your selected cert/slic in Windows Vista and then reboot back to Windows 7 and click install.\n\nActivation failed, now what?\nTry again with one of the other loader options, maybe one of them might just work for you.\n\nApplication integrity checking?\nHover your mouse over the green, amber or red icon towards the bottom right of the window to see the information.\n\nI should note that even if the icon is green someone might have found a way around it so it's worth checking that the applications path is always the same as the location from where you launched the application. You should also check that the MD5 matches the MD5 found online.\n\nSupport Page: http://forums.mydigitallife.info/showthread.php?t=8632\n\nWindows Loader.exe Hashes:\nMD5: 8e3982049e03023f39c4cf6dec74c1e3\nSHA-1: 3ab1bb831ab3ebb3cdf4d486939aea0eb2881e1b","torrent":{"xt":"urn:btih:2c4811c583e938134598f8fed20d271d6cc3778a","amp;dn":"Windows+Loader+v+1.8.2.zip+++carter67","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c4811c583e938134598f8fed20d271d6cc3778a","infoHashBuffer":{"type":"Buffer","data":[44,72,17,197,131,233,56,19,69,152,248,254,210,13,39,29,108,195,119,138]},"announce":[],"urlList":[]}}