{"title":"Jimmy Page - Wasting My Time  (2nafish)","uid":5628494,"size":152926212,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:2cdc99d3b88f0fb4f11d1414f6e9a00fea7b14ed&amp;dn=Jimmy+Page+-+Wasting+My+Time++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1276577688,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\nOutrider is an album by Jimmy Page, released by Geffen Records on 19 June 1988. It is his first (and to date, only) genuine solo album, and the first time since 1969 he recorded with a record label other than Atlantic Records/Swan Song Records. It was recorded at The Sol, Page's personal studio. Robert Plant guests on one track, &quot;The Only One&quot;, while John Bonham's son Jason drums with Page for the first time on record.\n\nThis was originally intended to be a two album release. However, during the early recording stages of this album, Page's house was broken into and amongst the items stolen were the demo tapes which had been recorded up to that point. Reportedly some of these demos were released as bootleg recordings and according to various Led Zeppelin biographies, Page was rather demoralized in regards to the break-in and the album suffered as a result.\n\nThe album reached #26 on Billboard's Billboard 200 chart, also peaking at #27 on the UK Album Chart.\n\nYears later, Page reflected on the album in rather positive terms:\n\n    Outrider's all right. It's demo-like compared with those overproduced albums that came out at the time. It didn't do very well - doesn't matter - but I did tour. I was playing music on that tour going right back to The Yardbirds. Jason [Bonham] was the drummer on that tour.\n\nJames Patrick Page, OBE (born 9 January 1944) is an English guitarist, songwriter, and record producer. He began his career as a studio session guitarist in London and was subsequently a member of The Yardbirds from 1966 to 1968, after which he founded the English rock band Led Zeppelin.\n\nPage is described by Allmusic as &quot;unquestionably one of the all-time most influential, important, and versatile guitarists and songwriters in rock history&quot;, and by Rolling Stone as &quot;the pontiff of power riffing &amp; probably the most digitally sampled artist in pop today after James Brown.&quot; In 2007, Page was ranked at #4 on Classic Rock Magazine's list of the &quot;100 Wildest Guitar Heroes&quot;, and Rolling Stone ranked him number nine in their list of the 100 Greatest Guitarists of All Time in 2003. He has been inducted into the Rock and Roll Hall of Fame twice, once as a member of The Yardbirds (1992) and once as a member of Led Zeppelin (1995). In 2010, Page was ranked #2 on Gibson's &quot;Top 50 Guitarists of All Time&quot;.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:2cdc99d3b88f0fb4f11d1414f6e9a00fea7b14ed","amp;dn":"Jimmy+Page+-+Wasting+My+Time++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2cdc99d3b88f0fb4f11d1414f6e9a00fea7b14ed","infoHashBuffer":{"type":"Buffer","data":[44,220,153,211,184,143,15,180,241,29,20,20,246,233,160,15,234,123,20,237]},"announce":[],"urlList":[]}}