{"title":"Action Launcher Pro v1.2.4-Android 4.0.3 Plus-AnDrOiD","uid":8735467,"size":2816110,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:2e4c66e06e71b9bcb07f2b4fa1f5bef847889013&amp;dn=Action+Launcher+Pro+v1.2.4-Android+4.0.3+Plus-AnDrOiD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"philmon","files":-1,"time":1374678157,"description":"â˜…â˜…â˜… &quot;Action Launcher is something special.&quot; - Android Police â˜…â˜…â˜…\nâ˜…â˜…â˜… &quot;Action Launcher brings something new to the table, and it's definitely worth a look.&quot; - Android Central â˜…â˜…â˜…\nAction Launcher looks and feels like a natural launching pad for the Android ecosystem, and is designed to get you where you need to go, faster.\nStandout features include:\n* A sliding quickdrawer for instant access to all your apps and widgets.\n* 'Covers', an innovative new way to quickly launch apps and shortcuts without compromising the look of your carefully crafted homescreen.\n* 'Shutters', a unique feature that unlocks the power and potential of Android widgets. Swipe an app icon, and that app's widget is automatically created.\n* Quicksearch, a fast and powerful feature that allows you to search for apps, contacts and even music directly from the action bar. \n* Android's unique and powerful action bar is fully integrated into your desktop.\n* Full tablet support (including the Nexus 10).\n* Icon pack support.\n* Desktop layouts can be backed up and restored to and from an SD card.\n* All of the settings you expect from custom launcher: specify apps to hide, adjustable number of home screen pages, grid sizes, page margins, dock toggles, scaling icons, lock desktop, resize any widget, etc.\n* Strong Play Store integration.\nAction Launcher allows you to import from existing launcher layout from other launchers such as Apex, Nova, Sense, TouchWiz and the stock Android launcher, so you'll instantly feel right at home.\nRegarding permissions:\n* CALL_PHONE: Required so that any Direct Dial shortcuts you create can initiate a phone call.\n* READ_CONTACTS: Used to instantly filter your contacts via the integrated quicksearch.\n* READ_EXTERNAL_STORAGE/WRITE_EXTERNAL_STORAGE: For backing exporting and restoring to and from an SD card.\nAction Launcher never transfers your personal data off your device.","torrent":{"xt":"urn:btih:2e4c66e06e71b9bcb07f2b4fa1f5bef847889013","amp;dn":"Action+Launcher+Pro+v1.2.4-Android+4.0.3+Plus-AnDrOiD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e4c66e06e71b9bcb07f2b4fa1f5bef847889013","infoHashBuffer":{"type":"Buffer","data":[46,76,102,224,110,113,185,188,176,127,43,79,161,245,190,248,71,136,144,19]},"announce":[],"urlList":[]}}