{"title":"Black.Bottom.Girls.7.[English].XXX.DVDRiP.XviD-","uid":5647811,"size":1459210240,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:306a573bad9c6b13395a5d9dd87636f10ce759a0&amp;dn=Black.Bottom.Girls.7.%5BEnglish%5D.XXX.DVDRiP.XviD-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"trxt","files":2,"time":1277434188,"description":"Having won AVN's coveted Best Interracial Series award two years in a row for Vouyer Media's It's Big, It's Black, It's Jack franchise, acclaimed actor/director Jack Napier is proud to announce that he's &quot;back in black&quot; and hitting the sack with some new Black Bottom Girls. \n\nThe tastemakers at AVN have nominated this signature line for Best Ethnic Series - Black every year since the franchise began, and Black Bottom Girls #7 is likely to take the acclaim to new heights once it arrives in stores.\n\nSweet-faced ebony beauty Samone Taylor kicks off the action in style, and delivers the opening tease with such gusto that the director himself is quick to praise this gorgeous girl's performance, treating the viewer to some rather compelling observations as she seduces him. \n\nAs the next segment unfolds, the camera follows mocha-skinned McKenzie Sweet through a brief but memorable striptease. She's new to the game but delivers an athletic screw that comes complete with splayed pussy close-ups and a powerful facial at the scene's end. \n\nTasty Candi Dreamz more than lives up to her moniker in the following sequence, serving up her hot, sweet and sticky snatch to Jack before mounting his formidable rod.\n\nSultry cover beauty Evanni Solei and torrid Codi Bryant flesh the movie out nicely, sucking and screwing the irrepressible director through multiple on-camera orgasms. \n\nThe plentiful extras include some sizzling behind-the-scenes footage, a generous still gallery, and an all-new bonus scene that pairs Mr. Napier up with petite Vouyer Media favorite Osa Lovely. As always, all of Jack's scenes have been filmed and edited in widescreen HD. This beautifully rendered DVD comes nestled in an attractive O-card that shows off Evanni Solei's delicious physique to near-perfect effect.","torrent":{"xt":"urn:btih:306a573bad9c6b13395a5d9dd87636f10ce759a0","amp;dn":"Black.Bottom.Girls.7.%5BEnglish%5D.XXX.DVDRiP.XviD-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"306a573bad9c6b13395a5d9dd87636f10ce759a0","infoHashBuffer":{"type":"Buffer","data":[48,106,87,59,173,156,107,19,57,90,93,157,216,118,54,241,12,231,89,160]},"announce":[],"urlList":[]}}