{"title":"Once You Go Black You Never Go Back #5 - London Keys &amp;  Mr. Marc","uid":5540230,"size":420005894,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:308693099977356f329f0ec98fafe9c7d971d3cb&amp;dn=Once+You+Go+Black+You+Never+Go+Back+%235+-+London+Keys+%26++Mr.+Marc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Stinger459","files":-1,"time":1273200316,"description":"Scene which begins with London coming into the offices and she's here to chat with Jules about doing a scene-- send her right in!! So up she goes to the palatial offices and Jules has a few words with Miss Keys. Gotta like the desk too, it's adorned with several AVN awards! The two talk about working together, Jules shows a few dvds to London to give her an idea of what he does. Jules inquires about anal but not quite yet she says- but there's hope! Ok so London sees Marcus on a dvd cover and inquires about him so Jules makes the call. So the call ends and I'm thinking Marcus is heading right over, lol. So as she starts to show off the bod a little Mr. Marcus shows up and the action commences- titties come out to play and what a rack! London's a horny gal and she's all over that cock in short order and I mean she's all over it, deep throating with no problems. Her approach is much more aggressive than we saw with Natalia but both were equally hot to this viewer. The heads so strong here that spit flows down her chest to the outfit she stills has on- a great ground shot going up captures this bit of action. So after some of the best head you'll see anywhere we have Marcus sliding in from behind-- that dick should be rock hard after that oral display from London. She's talking dirty too, very much into the scene. Cowgirl, mish-- it's all working here and the energy from London is just awesome, you will not have shred of doubt about her being into the action and I bet Marcus loved it too, helps make his job much easier and more fun too! A good facial pop closes this excellent pairing, wow London impresses here bigtime.\n","torrent":{"xt":"urn:btih:308693099977356f329f0ec98fafe9c7d971d3cb","amp;dn":"Once+You+Go+Black+You+Never+Go+Back+%235+-+London+Keys+%26++Mr.+Marc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"308693099977356f329f0ec98fafe9c7d971d3cb","infoHashBuffer":{"type":"Buffer","data":[48,134,147,9,153,119,53,111,50,159,14,201,143,175,233,199,217,113,211,203]},"announce":[],"urlList":[]}}