{"title":"Alex Jones Show - 2010 June 13 SU [sebaygo1]","uid":5625999,"size":51052150,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:30de49333105f63c92faa5eafac3bba058cdd143&amp;dn=Alex+Jones+Show+-+2010+June+13+SU+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sebaygo1","files":5,"time":1276482502,"description":".\n\t\t\t\t\t\t\t\nThe Alex Jones Show\nSunday, 13 June 2010\n\n\n[sebaygo1]\n\n\n\nA live show today!\n\nThe 2 hour Sunday show is typically a review of the past week's news and a look forward to the coming week's events.\n\n\n[description from Infowars web site:]\nOn this Sunday Edition, Alex talks with physician and Republican Congressman for the 14th congressional district of Texas, Ron Paul. Dr. Paul is the founder of Campaign for Liberty and author of End The Fed and The Revolution: A Manifesto. Additional guests include international bestselling author Jeffrey M. Smith who is the leading spokesperson on the health dangers of GMO foods, Evening Standard and The Guardian  journalist Charlie Skelton, journalist for the American Free Press and Bilderberg hound Jim Tucker, and longtime newsman working as the deputy editor the American Free Press, Mark Anderson.\n[most, perhaps all, of the guests are not live, but rather excerpts from previous broadcast interviews]\n\n\n\n#####\n..........\nIMHO, as anti-GMO-Foods activists go, Jeffrey Smith is one of the most effective spokespeople.  I enjoy any chance to hear him being interviewed.  I am including as a bonus with this torrent an interview from May 25th's Jeff Rense Show.  All the original capture and editing work credit for this goes to &quot;gkjrrs&quot; of Demonoid and Fenopy.  I merely supplied mp3 tags.\n....................\n#########################\n\n\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_torrents_info_PLEASE-READ.txt\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n\n It is my opinion that in this time it is virtually\n essential to seek information from a variety of sources, \n to listen to a spectrum of voices in order to better \n understand the &quot;big picture.&quot; A reliance solely upon\n mainstream corporate media for news and info is a \n prescription for ignorance. I try to share information\n that counters the monotone of mainstream corporate media.\n \n NOTE: The material here is made available strictly as\n information. Do not assume support or endorsement on my\n part of the contents. \n\n Think for yourself!\n To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n.","torrent":{"xt":"urn:btih:30de49333105f63c92faa5eafac3bba058cdd143","amp;dn":"Alex+Jones+Show+-+2010+June+13+SU+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30de49333105f63c92faa5eafac3bba058cdd143","infoHashBuffer":{"type":"Buffer","data":[48,222,73,51,49,5,246,60,146,250,165,234,250,195,187,160,88,205,209,67]},"announce":[],"urlList":[]}}