{"title":"Dead End - 1937","uid":5628025,"size":1095447222,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:341ab699b8e270320ed153745b8f440188b18f7c&amp;dn=Dead+End+-+1937&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"DogNo7","files":-1,"time":1276555689,"description":"The story of one day in a slum area of New York. Noted gangster Baby Face Martin, who grew up in the neighborhood, decides to come home to visit his mother and the girl he left behind when he was sentenced to reform school. While he is there he hooks up with Dave Connell, a former friend who is now a struggling architect. At first Connell is a little disturbed that &quot;Marty&quot; is back in the neighborhood, but he goes along with him. When Marty sees his mother, she rejects him because of what he has become. He later sees his girl Francie, who is now a prostitute in the throes of syphilis. All this turns drives Marty to the edge...\n\nThe Dead End Kids are introduced in their intricate East Side slum, overlooked by the apartments of the rich. Their antics, some funny, some vicious, alternate with subplots: unemployed architect Dave is torn between Drina, sweet but equally poor, and Kay, a rich man's mistress; gangster Baby Face Martin returns to his old neighborhood and finds that nobody is glad to see him. Then violent crime, both juvenile and adult, impacts the neighborhood and its people.","torrent":{"xt":"urn:btih:341ab699b8e270320ed153745b8f440188b18f7c","amp;dn":"Dead+End+-+1937","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"341ab699b8e270320ed153745b8f440188b18f7c","infoHashBuffer":{"type":"Buffer","data":[52,26,182,153,184,226,112,50,14,209,83,116,91,143,68,1,136,177,143,124]},"announce":[],"urlList":[]}}