{"title":"Alex Jones Show - 2013 Jul 24 WE [sebaygo1]","uid":8737697,"size":62618358,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:34f6121c0eedd7ade577582e6551ad465ac81f9a&amp;dn=Alex+Jones+Show+-+2013+Jul+24+WE+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sebaygo1","files":11,"time":1374711800,"description":"\t\t\t\t\t\t\t\nThe Alex Jones Show\nWednesday, 24 July 2013\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the Infowars web site :: On this Wednesday, July 24 edition of The Alex Jones Show, Alex talks about the increasing frequency of police state violence as a cop kills a family dog in Virginia while delivering the tragic news that their son had been killed. Executing family pets is now routine behavior for many police departments around the country. \n\nAlex also looks at pro-Trayvon protests organized by a communist who idolizes the historical mass murderers Stalin and Mao as the effort to persecute George Zimmerman for exercising his right to self defense turns into a distorted and preverse &quot;civil rights&quot; campaign led by notorious ambulance chasers and other political opportunists. \n\nAlex runs down other important news items on today's worldwide broadcast, including an effort in Congress to take the air out of the NSA's surveillance grid and put a stop to the Stasi state.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n.\n","torrent":{"xt":"urn:btih:34f6121c0eedd7ade577582e6551ad465ac81f9a","amp;dn":"Alex+Jones+Show+-+2013+Jul+24+WE+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34f6121c0eedd7ade577582e6551ad465ac81f9a","infoHashBuffer":{"type":"Buffer","data":[52,246,18,28,14,237,215,173,229,119,88,46,101,81,173,70,90,200,31,154]},"announce":[],"urlList":[]}}