{"title":"Pinky.Violence-Killing.Melody.1973.DVDRip.XviD-Allzine","uid":5610392,"size":751075433,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:362d6dc2d578cf5a9eefd73483a4b0e60294b042&amp;dn=Pinky.Violence-Killing.Melody.1973.DVDRip.XviD-Allzine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"thelad53","files":52,"time":1275835594,"description":"The first film in the set takes place in a grim and dirty woman's prison - always a great spot to set an exploitation film - shortly after a few foxy woman have been thrown in the slammer for various reasons.\n\nA few of the women, who have been cell mates for a while, don't take too kindly to the newest girl, played by Reiko Ike, who doesn't want to explain to them what she's been locked up for. They feel that since they all spilled their guts in front of her, she owes them the same. This leads to some tension, and soon she's being tied up to Mike Sugimoto for an all out prison bitch knife fight out in the courtyard.\n\nBoth girls survive, but manage to give one another quite a beating. Once this is out of the way with, we find out that the reason she's in prison is because she attacked a Yakuza who killed her father. Her heart still burns with the hunger for revenge, and once she can get out of the big house, she's going to go right back after the sons of bitches who did in dear old daddy and give them what for.\n\nNow that the women all respect one another, the girls decide to help Reiko out with her cause and soon they've formed a gang of their own, bent on punishing the Yakuza that wronged one of their own. That doesn't mean tensions won't arise between the ladies though - things are still far from perfect between them.\n\nFast paced, sexy, and violent, Criminal Woman - Killing Melody benefits from the exceptionally cool screen presence of Reiko Ike and the exceptionally alluring charms of her co-star, Miki Sugimoto, who would go on to blow more than a few minds in Zero Woman - Red Handcuffs. Director Atsushi Mihori directs with plenty of style, the camera doing a fine job of capturing all of the over the top set pieces and swanky seventies settings. The lens leers quite a bit over the girls in the film, but we're all the better off for it. The men who play the Yakuza in the movie are completely despicable and ever so easy to hate, making the girl gang a little more sympathetic than they might be otherwise, even if they are obviously not the kind of women you'd want to bring home to your mother.\n\nRough, dirty, trashy and slicker than grease, Criminal Woman - Killing Melody is like mainlining a hit of trash cinema smack right into your veins. It comes up on you quickly and ends far sooner than you want it to.\n\nRip iNFO\n\nName.........: 01-Criminal.Woman-Killing.Melody.1973.DVDRip.XviD-Allzine.avi\nFilesize.....: 696 MB\nRuntime......: 01:22:47\nVideo Codec..: XviD\nVideo Bitrate: 1055 kb/s\nAudio Codec..: MPEG-1 Layer 3\nAudio Bitrate: 113 kb/s (56/ch, stereo) VBR LAME3.90\nFrame Size...: 616x256 (2.41:1)\nQf...........: .279 bits/pixel\n\n...also included, the movie trailer in QuickTime format...","torrent":{"xt":"urn:btih:362d6dc2d578cf5a9eefd73483a4b0e60294b042","amp;dn":"Pinky.Violence-Killing.Melody.1973.DVDRip.XviD-Allzine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"362d6dc2d578cf5a9eefd73483a4b0e60294b042","infoHashBuffer":{"type":"Buffer","data":[54,45,109,194,213,120,207,90,158,239,215,52,131,164,176,230,2,148,176,66]},"announce":[],"urlList":[]}}