{"title":"Emer Kenny Collection","uid":5492724,"size":156037186,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:375e1bc1da4b58b094731749de5680094dfa8ab0&amp;dn=Emer+Kenny+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"darkpoet1978","files":23,"time":1271098844,"description":"Emer Kenny\n\n2 Albums:\n\nEmer Kenny (1997) 192kbps\nParting Glass (2004) 256 kbps\n\n\n\nMixing ethereal electronic beats with Gaelic harp, vocalist/harpist Emer Kenny has gathered a loyal fan base worldwide with her consistently beautiful and wistful recordings. Born in Dublin, Kenny started playing the harp at the age of nine. After studying music at the College of Music in Dublin and the Trinity College of Music in London, Kenny became involved in writing music for Dublin's live theaters. Appearances on television attracted the attention of Dublin's media and eventually the U.K. branch of the Mercury label. They issued her self-titled debut in 1997 with guest spots from Secret Garden violinist Fionnuala Sherry and original Chieftains percussionist Peadar Mercier. Her version of the Stranglers' &quot;Golden Brown&quot; drew much airplay and attention, while the album's &quot;Heaven&quot; became the soundtrack to television commercials on both sides of the Atlantic and stormed up worldwide dance charts in its Junior Vasquez remix. Triloka issued the album in the States, as they did her 2001 release, Fades into Day, an album that included more downtempo electronic beats and pop sensibilities than before. A more even mix of organic/electronic was to be found on Kenny's 2004 album, Parting Glass, with her Triloka label joining the successful Artemis family.\n\n~ David Jeffries, All Music Guide","torrent":{"xt":"urn:btih:375e1bc1da4b58b094731749de5680094dfa8ab0","amp;dn":"Emer+Kenny+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"375e1bc1da4b58b094731749de5680094dfa8ab0","infoHashBuffer":{"type":"Buffer","data":[55,94,27,193,218,75,88,176,148,115,23,73,222,86,128,9,77,250,138,176]},"announce":[],"urlList":[]}}