{"title":"Dementium II [Multi5]","uid":5550797,"size":56962215,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:394720a5d2627e6c7d4025190d4a76877e1041fb&amp;dn=Dementium+II+%5BMulti5%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chusca","files":3,"time":1273536934,"description":"Nintendo DS tambiÃƒÂ©n tiene potencia para aterrorizarnos; Dementium 2 es la secuela de un survival horror en primera persona donde nada es lo que parece. Tu Nintendo DS ya no volverÃƒÂ¡ a ser la misma. Renegade Kid ha creado uno de los engines 3D mÃƒÂ¡s competentes y funcionales de Nintendo DS; Dementium 2 vuelve a mostrar entornos sÃƒÂ³lidos perfectamente ambientados, ademÃƒÂ¡s de un control pulido para asegurar una mejor experiencia de Juego. Terror portÃƒÂ¡til. Incluye espaÃƒÂ±ol. Nueva version parcheada de Xenophobia.\nLa extraÃƒÂ±a introducciÃƒÂ³n que abrÃƒÂ­a este avance sirve como preludio para conocer la historia de Dementium II, en la que bÃƒÂ¡sicamente nos ponemos en la piel de un enfermo mental que se interna en un hospital psiquiÃƒÂ¡trico de alto estÃƒÂ¡ndar para alejar de su cabeza los flashbacks que le culpan del asesinato de su mujer y ÃƒÂºnico hijo. Renegade Kid sabe cÃƒÂ³mo planificar un guiÃƒÂ³n confundiendo a los jugadores hasta los ÃƒÂºltimos compases de la aventura, esperando hasta el ÃƒÂºltimo segundo para ofrecer la llave que abre todas las puertas que creÃƒÂ­amos cerradas hasta el enfrentamiento con el enemigo final de turno. La descripciÃƒÂ³n que se ha hecho del argumento ha venido acompaÃƒÂ±ada por una interesante campaÃƒÂ±a de publicidad viral que ofrece a los curiosos la posibilidad de conocer mÃƒÂ¡s sobre el centro Bright Dawn. Las citas de los pacientes que ya han recibido tratamiento en estas instalaciones no tienen pÃƒÂ©rdida, y son el mejor trasfondo que podrÃƒÂ­amos necesitar para comprender en quÃƒÂ© direcciÃƒÂ³n van los tiros esta vez. \n\n\n","torrent":{"xt":"urn:btih:394720a5d2627e6c7d4025190d4a76877e1041fb","amp;dn":"Dementium+II+%5BMulti5%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"394720a5d2627e6c7d4025190d4a76877e1041fb","infoHashBuffer":{"type":"Buffer","data":[57,71,32,165,210,98,126,108,125,64,37,25,13,74,118,135,126,16,65,251]},"announce":[],"urlList":[]}}