{"title":"Janina - Fantasma (Alone)  (2nafish)","uid":5596489,"size":100919300,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3d730419f068190614f9589afdf2df541a6b7cc1&amp;dn=Janina+-+Fantasma+%28Alone%29++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1275052052,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles and is a Spanish version of Heart's hit single,&quot;Alone.&quot;\n\n\n&quot;Alone&quot; is a song composed by Billy Steinberg and Tom Kelly. It first appeared on via Steinberg and Kelly's pet project, 1983's I-Ten, Taking a Cold Look. It was later recorded by John Stamos in his role as Gino Minelli, on the original soundtrack of the CBS sitcom Dreams in 1984. American rock  band Heart made it a hit in 1987. Twenty years later, CÃƒÂ©line Dion recorded it for her album Taking Chances.\n\n&quot;Janina Irizarry Nazario&quot; (or simply Janina) is a Puerto Rican singer more known for being the winner of the first season of Objetivo Fama, a singing talent contest held in Puerto Rico. Janina has also hosted several television shows in the island. She is a member of Mu Alpha Phi sorority.\n\nOn January 27, 2009, she released a new song &quot;Ya No MÃƒÂ¡s&quot; being the first single of her new album titled &quot;Janina&quot;, but in May 19, 2009, she release &quot;Ya No MÃƒÂ¡s Remixes&quot; by digital download. Now on September 15, 2009, Janina release a single called &quot;Fantasma&quot; a covered version of the song &quot;Alone&quot;.\n\nFrom her early teens, Janina was frequent participant in talent contests and artistic events at the student. In 2000, counting the time 17 years, represented Puerto Rico at a convention and competition for amateur artists called &quot;Connections&quot;, which was held in the U.S. state of Florida. The fate led her in that contest, she won the First Prize.\n\nAfter completing her degrees she joined the Inter-American University campus of San GermÃƒÂ¡n, Puerto Rico, where she continued her musical studies. During the four years she spent in this room formed part of the rock group No Mistake, against whom she had opportunity to perform at festivals and nightclubs in many cities, including San Juan.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:3d730419f068190614f9589afdf2df541a6b7cc1","amp;dn":"Janina+-+Fantasma+%28Alone%29++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d730419f068190614f9589afdf2df541a6b7cc1","infoHashBuffer":{"type":"Buffer","data":[61,115,4,25,240,104,25,6,20,249,88,154,253,242,223,84,26,107,124,193]},"announce":[],"urlList":[]}}