{"title":"World Cup 2010 spreadsheet","uid":5608677,"size":2458112,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3dbaf731dc873b9f06e9ce2c8071ef9170e32856&amp;dn=World+Cup+2010+spreadsheet&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bonienl","files":1,"time":1275731805,"description":"This Excel spreadsheet allows you to fill-in and view the progress of the upcoming World Cup 2010 in South Africa.\n\nThe file is created with standard Excel formulas, it does not contain any macros to perform its functions. It will run with Excel 2000 or higher.\n\nYou can choose from 20 different languages to display the content in your preferred language. The layout of dates and times is formatted accordingly.\n\nBy selecting the time zone you are living in all match times will be displayed in your local time. It supports daylight saving - if applicable.\n\nTo follow your favorite team more closely, select it from the drop-down menu and all its matches will be highlighted.\n\nA 'prediction' function is built-in to show how teams will advance and who will be the eventual world champion.\n\nOnce the tournament is over and all results are filled-in you can create a one-page overview which is suitable for printing and is a nice reminder to the event.\n\nDiscover some of the other hidden information yourself and enjoy this spreadsheet and the tournament.\n\nBonieNL","torrent":{"xt":"urn:btih:3dbaf731dc873b9f06e9ce2c8071ef9170e32856","amp;dn":"World+Cup+2010+spreadsheet","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3dbaf731dc873b9f06e9ce2c8071ef9170e32856","infoHashBuffer":{"type":"Buffer","data":[61,186,247,49,220,135,59,159,6,233,206,44,128,113,239,145,112,227,40,86]},"announce":[],"urlList":[]}}