{"title":"Garm Hava, India, 1973","uid":5537724,"size":1540671670,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3f0d6af3c904815818c5cd67a25f078339e6a3e1&amp;dn=Garm+Hava%2C+India%2C+1973&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nunicorn","files":1,"time":1273125691,"description":"Garm Hava (Hot Winds or Scorching Winds)\n\n\n(1973/Colour/146 min/Hindi)\n\n\nGarm Hava is a 1973 Hindi film directed by M. S. Sathyu, based on an unpublished short story by Ismat Chughtai and adapted for screen by Kaifi Azmi, who also wrote its lyrics.\n\nThe film deals with the plight of a North Indian Muslim family, in the years post partition of India in 1947, as film's protagonist, deals with this dilemma of whether to move to Pakistan or stay back, the film details the slow disintegration of his family, and is one of the most poignant films ever made on India's partition,and remains the only film, that deals with the plight of Muslims, in Post-partition India, with the sole exception being, Shyam Benegal's Mammo (1994).\n\nIt is often credited with pioneering a new wave of Art cinema movement in India, and alongside, film from another debutant film director, Shyam Benegal, Ankur (1973), are considered landmarks of Indian Parallel Cinema. The movie also launched the career of actor, Farooq Shaikh. It was India's official entry to the Academy Award's Best Foreign Film category, nominated for the Golden Palm at the Cannes Film Festival, won a National Film Award and three Filmfare Awards. In 2005, Indiatimes Movies ranked the movie amongst the Top 25 Must See Bollywood Films","torrent":{"xt":"urn:btih:3f0d6af3c904815818c5cd67a25f078339e6a3e1","amp;dn":"Garm+Hava%2C+India%2C+1973","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f0d6af3c904815818c5cd67a25f078339e6a3e1","infoHashBuffer":{"type":"Buffer","data":[63,13,106,243,201,4,129,88,24,197,205,103,162,95,7,131,57,230,163,225]},"announce":[],"urlList":[]}}