{"title":"K-1 World MAX Collection","uid":5476570,"size":39739682856,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3f8a9a7c403449c18a6803b5e164f91cdd61bd70&amp;dn=K-1+World+MAX+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"s2nur","files":88,"time":1270182066,"description":"Description from Wikipedia:\n\nK-1 is a Japanese kickboxing promotion based in Tokyo who organize combat sport events in Japan, and around the world, that include events by the mixed martial arts promotion Dream. K-1 combines stand up techniques from Karate, Muay Thai, Taekwondo, Savate, San Shou, Kickboxing, western-style Boxing, and other martial arts. It's rules are similar to those of kickboxing but they have been simplified to promote exciting matches that may end in a knockout win. K-1 MAX (&quot;Middleweight Artistic Xtreme&quot;) is the 70 kg (154 lb) Super Middleweight division of K-1.\n\nNotes on this torrent:\n\nThis is my personal collection of K-1 World MAX events, which I gathered throughout the years, mainly from private trackers dedicated to martial arts. Since these trackers are nowadays very small and closed communities, I feel that many fans and potential fans are being kept from some of the most amazing fights in the history of kickboxing. So it's about time someone shared all this with the rest of the world, no strings attached. Enjoy.\n\nMost of the nfo files seem to be missing. I can't even tell whether it's the original uploaders' fault or mine. In any case, I apologize to the release groups that worked hard to rip and distribute these files. I tried to keep all the files as I got them, renaming only the folders to match each event's official name and the date it took place.\n\nSome of the fightcards were already included in each event's torrent, others I made myself. I can't really vouch for how accurate they are, specifically to which fights are fully or partially included and which are missing. They shouldn't be too off, though.\n\nPlease be patient and seed when you're done. My upload bandwidth is only 512 kbps, which means it will take at least one whole week before there are any other seeders.","torrent":{"xt":"urn:btih:3f8a9a7c403449c18a6803b5e164f91cdd61bd70","amp;dn":"K-1+World+MAX+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f8a9a7c403449c18a6803b5e164f91cdd61bd70","infoHashBuffer":{"type":"Buffer","data":[63,138,154,124,64,52,73,193,138,104,3,181,225,100,249,28,221,97,189,112]},"announce":[],"urlList":[]}}