{"title":"Junge Madchen Heisse Korper (1985)","uid":8768051,"size":948725160,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:404df6cdbd0a294418f98f41c6328d0072584ee0&amp;dn=Junge+Madchen+Heisse+Korper+%281985%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1375380613,"description":"Cover: &lt;a href=&quot;\nhttp://aveimage.biz/?cmd=browse&amp;view=1&amp;id=225&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://aveimage.biz/?cmd=browse&amp;view=1&amp;id=225&lt;/a&gt;\n\n\nPreview: &lt;a href=&quot;\nhttp://aveimage.biz/?cmd=browse&amp;view=1&amp;id=226&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://aveimage.biz/?cmd=browse&amp;view=1&amp;id=226&lt;/a&gt;\n\n\nCountry: Germany / USA\nLanguage: German\nGenre: Feature, Classic\nDuration: 01:19:14\n\nStarring:\nIsabelle Torilla plays a girl in the sauna\nMichaela Peters plays Rita, probably as Michaela Schindler\nSimone Graf pre-tattoo and as a brunette, girl at party\n\nDescription:\nThis is a very plot-based porn movie which comes along with a strong moral attitude: anonymous sex parties with multiple partners are not the key to happiness in life, but just a sign of moral decay. Maybe it's just meant as a warning, as the movie was made in the early 80's, when the AIDS crisis got under way. Anyway, the flick contains group sex but Angie, the leading character, gets along without any hardcore scenes at all. All in all it's similar to Hei?e Schnecken.\n\nAngie, a tall attractive blonde, works at a boutique. All she needs is a friendly face, but she's not really satisfied. Her colleague Michaela invites her to what turns out to be a spin-the-bottle party, including some striptease and hard sex. Angie is disgusted and leaves early. She makes an appointment with an old friend of her's, Rita. Together they visit a discotheque. The two girls want to spend the night together, but Rita's pushy boyfriend makes Angie run away. While Rita and the guy have sex, Angie's car fails to start. She gets some unexpected help from a stranger named Charlie.\n\nNext day she has a dispute with her boss and quits her job. But the search for a new one isn't easy at all. All advertised vacancies (sauna club, model for a painter and art photographer) involve sex and that's not what Angie is looking for. Accidently the friendly mechanic crosses her path a second time and turns out to be a rich and charming guy.\n\nShe gets her own boutique and the search for some mannequins leads her to an old girlfriend named Babs, who's running some kind of club. Charlie, who has become distrustful, tries to lead her into temptation and she gets an invitation for another group sex party, but she resists and eventually becomes his wife.\n\nRecommendable only to collectors and those with a strong interest in classic porn, but too greasy for my taste.","torrent":{"xt":"urn:btih:404df6cdbd0a294418f98f41c6328d0072584ee0","amp;dn":"Junge+Madchen+Heisse+Korper+%281985%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"404df6cdbd0a294418f98f41c6328d0072584ee0","infoHashBuffer":{"type":"Buffer","data":[64,77,246,205,189,10,41,68,24,249,143,65,198,50,141,0,114,88,78,224]},"announce":[],"urlList":[]}}