{"title":"Fraps 3.2.1.11425 Retail -[HB]","uid":5474554,"size":2594252,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:420cbb357ae21cf24b3e386dc04f0f973d7bfc74&amp;dn=Fraps+3.2.1.11425+Retail+-%5BHB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"[HB]","files":-1,"time":1270063416,"description":"+------------------------------+\n|Fraps 3.2.1.11425 Retail -[HB]|\n+------------------------------+\n\nFraps - a program for counting the number of FPS in applications running in OpenGL and Direct3D. The utility is able to take screenshots and record video with the image on the screen. This is a universal application that can work with all games using DirectX technology or OpenGL. Manage the program without leaving the game, with the help of hot keys. Above all, in advance, make sure that the keyboard shortcuts Fraps does not coincide with the keys used in the game. With Fraps can capture the best moments not only in the form of single frames, but in motion with sound. Allows you to display statistics of the parameter frames per second, by writing to a file, or display the counter in one corner of the screen. Save individual frames by pressing a hotkey.\n\nFraps universal program for the operating system Windows, which can be used by any games that support the technology DirectX or OpenGL. You can see how many frames per second (FPS) gives your computer in a certain game. Indicator will be located (by default) in the upper left corner of the screen. Adjust the program and measure the rate of frames per second. between two points. Save the statistics to disk and then use their own purposes. Remove a screenshot by pressing just one button! No need to constantly roll up and save your pictures manually, as the pictures will be automatically named and saved.\n\nHave you ever wanted to make a video how to play your favorite game? Throw away your VCR, forget about using DV, because the video recording has never been so simple. Fraps can capture audio and video with the expansion of 1152x864 and a frequency of 100 frames per second on a single nuclear computers and 2560x1600 on dual-core. In the third version of the program came full support Windows 7 and DirectX 11.\n\n\n+----------------------------+\n|Changes in 3.2.1 Build 11425|\n+----------------------------+\n\n* Fixed screen capture of large resolutions (ATI Eyefinity)\n\n* Fixed counter disappearing in some games when switching resolution\n\n* Improved recording speed on SLI configurations\n\n* Other minor bug/crash fixes\n","torrent":{"xt":"urn:btih:420cbb357ae21cf24b3e386dc04f0f973d7bfc74","amp;dn":"Fraps+3.2.1.11425+Retail+-%5BHB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"420cbb357ae21cf24b3e386dc04f0f973d7bfc74","infoHashBuffer":{"type":"Buffer","data":[66,12,187,53,122,226,28,242,75,62,56,109,192,79,15,151,61,123,252,116]},"announce":[],"urlList":[]}}