{"title":"Shadows Fall - Bark At The Moon (2nafish)","uid":5631224,"size":153733124,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:42b4b4c0c27b0cf276ba54f7d855e313a2cab3a7&amp;dn=Shadows+Fall+-+Bark+At+The+Moon+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1276689516,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Bark at the Moon&quot; is a metal song by Ozzy Osbourne. It is the first track on his 1983 album Bark at the Moon. The song was composed by Jake E. Lee and Bob Daisley with minor contributions from Osbourne and is four minutes and 17 seconds long.\n\nThe song itself is about a mythical beast that once terrorized a town, was killed and then resurrected itself to once more wreak havoc. The music video, however, is about a scientist (played by Osbourne) who accidentally turns himself into a beast, is killed, and resurrected as a free human again.\n\nThis song marked the first recording after the death of Ozzy's original guitarist Randy Rhoads, with replacement Jake E. Lee.\n\nMetal band Shadows Fall recorded a cover of this song available on the Deluxe Edition of their 2009 album Retribution. The cover is also set to be released as a single on March 15 alongside a promo video directed by David Brodsky  in early 2010.\n\nShadows Fall is an American thrash metal band from Springfield, Massachusetts, formed in 1995. They are one of the few contemporary metal bands who take their lyrical influence from Eastern philosophy. Although the band has experienced several line-up changes, for most of its recording career Shadows Fall has been composed of Brian Fair (vocals), Jonathan Donais (lead guitar), Matt Bachand (guitar), Paul Romanko (bass), and Jason Bittner (drums).\n\nSince their formation, Shadows Fall have released six studio albums, two compilation albums, and one DVD. The band's first album featured Philip Labonte on vocals, although he was soon replaced by Fair. Shadows Fall's first two studio albums featured David Germain playing drums, but in 2002 Bittner joined the band full time. In February 2008, the band was a Grammy Award nominee in the category Best Metal Performance for the song &quot;Redemption&quot; off the album Threads of Life.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:42b4b4c0c27b0cf276ba54f7d855e313a2cab3a7","amp;dn":"Shadows+Fall+-+Bark+At+The+Moon+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42b4b4c0c27b0cf276ba54f7d855e313a2cab3a7","infoHashBuffer":{"type":"Buffer","data":[66,180,180,192,194,123,12,242,118,186,84,247,216,85,227,19,162,202,179,167]},"announce":[],"urlList":[]}}