{"title":"Jaden Vs Yugi Rap Battle - King Of Rhymes [MP3-320]","uid":5543160,"size":10682005,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:42fcf77ae0f67a4fc8d6b99717c425efb4327720&amp;dn=Jaden+Vs+Yugi+Rap+Battle+-+King+Of+Rhymes+%5BMP3-320%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"BlakeAlexanderSwift","files":1,"time":1273302757,"description":"As made by LittleKuriboh and introducing ShadyVox as the voice of Jaden.\n\n\n'LittleKuriboh Ft. ShadyVox - The King Of Rhymes'\n\n\n\n--------------------------------------------------------\n\n\n\n[Jaden]\n\nThis is it Yugi. Me and you. The final battle. \nThe duel that everyone's been waiting for. I'm not gonna' hold back!\n\n[Yugi]\n\nYou bet Jaden. This is gonna' be super special awesome! I can't wait to see your strength.\n\n[Jaden]\n\nWell, alright. Yugi, it's time! ...To spit some rhymes!\n\n[Yugi]\n\nBring it on Ja- ...Wait what? Oh you have got to be f*cking kidding me...\n\n[Jaden]\n\nAlright Yugi check it out it's Jaden from GX.\nAnd sad to say dogg you're my new test subject.\nSo listen up, here it is, the awesome challenge I suggest.\nWho ever spits the best rap outta' you and me will be the best\nduelist in the world and the 'King of Games'.\nYou know I got you beat but homie don't be lame.\nThis is serious, you gotta' do it, your title says you have to.\nIf you decline a challenge by default that means I beat you.\nYugi I hope you're ready, cos this is gonna' be heavy.\nI know you might think it's unnecessary,\nbut that's tough, suck it up dogg, it's something that you gotta' do.\nOr you could leave and loose your throne, it's up to you.\n\n[Yugi]\n\nOh, you think you're hot sh*t, huh? Okay, check this out.\n\nPrime! (mouth noises) Cut! (mouth noises)\nMiggidy-mo-mac-daddy (Whuzzup!)\nI said a jizzah bang. (Boom boom boom!)\nDuh-diggy dog.\nI said-a-dog. (A dog)\nA-dog. (A dog)\nA-diggity dawg!\nHey whatcha say, Jay. Okay, your repartee's clichÃƒÂ©.\nForget trading cards, you should just take up ballet.\nYou wanna duel, don't act the fool,\nor I'll just tell you bitch please!\nThe only consolation here is you're not from 5D's.\nSo play the damn card, punk. Cause it's time to throw down.\nI'm glad it's one on one because all your friends are clowns.\nCan't wait to see your face turn to sheer disgrace,\nwhen I duel your punk ass right outta' this place.\nMy name is Yugi Moto!\nSaid your show's really lame.\nEach episode's the same, yes they are.\nNow get yourself set to be ashamed\nby the King of Games. (Gaaames)\n\n[Jaden]\n\nHeh, that was ight. But let me lay somet fresh on ya.\n\n[Yugi]\n\nEh Jaden, you're not black...\n\n[Jaden]\n\nYou're 'bout to witness me be absolutely flawless.\nThe best kind you'll ever see, I'm being honest.\nI'm the hardest, the most purest, known artist.\nAnd oh, F.Y.I. Yugi?... I've been taking ballet for 6 years regardless.\nBut let me lay you something fresh dogg, what I'm gonna' do,\nI'ma tell you something that's a hundred percent true.\nYou're not the King of Games homie, no sorry, not you.\nIt's your weird egyptian friend thats stuck inside you.\nYou're a lazy sucker, he does all the work for you.\nThen you claim the fame for all the shiz and stuff he do.\nWhat you even doing being inside him anyway?\nEveryone agrees dude, that is pretty gay.\n\n[Yami]\n\nYou know something, Jaden. I don't think you know who you're dealing with. \nWell allow me to fill you in.\n\nI'm the mother flippin' King of Games. \nMy hair's spiked, and my pants are really tight.\nAnd I'm sexy (I'm sexy!)\nIf you choose to defend, I'm gonna condescend.\nCause my Dark Magic Attack will drive you straight round the bend.\nI've got God Cards I won from Battle City.\nDon't believe me? Listen carefully to this ditty.\nAnd by the by your cards are sh**y.\nAnd so's your show!\nWatch what happens when Slifer takes on Winged Kuriboh.\n\n[Celtic Guardian]\n\nThey call me the, Celtic Guardian\nMy lyrics will blow your cranium'.. Um... Uh...\n\n[Yami]\n\nOh come on, Dave.\n\n[Celtic Guardian]\n\nI'm thinking! Um... Uh...\n\n[Yami]\n\nUgh. And he wonders why I never summon him.\n\n[Celtic Guardian] \n\nHang on here, I think I got it.\nThey call me the Celtic Guardian.\nStronger than titanium, sharp as a comedian.\nHere I am. Sold out all the stadiums.\nI'm not a lower class dueling monster\nWhere did you get that ridiculous concept-i-on?\nDid the Blue-Eyes White Dragon tell you that?\nF*ck the Blue-Eyes White Dragon! ...Seriously.\n\n[Yami]\n\nMy trap and spell cards they don't make sense,\nbecause their card descriptions are so immense.\nAnd if you duel with me you it won't be tense\nbecause against my monsters you've no defense.\nMy cards are so potent I might seem conceited\nIn fact all of my opponents could swear that I cheated.\nSure, sometimes Yugi and I swap places.\nBut who cares? So long as my enemies have egg on their faces.\nOther duelists diss me. Say my cards are sissy.\nWhy? Why? What Wha-Why? Why exactly? ...Why?\nThere's nothing girly about the Dark Magician Girl.\nAnd only real men use Watapon!\nJaden, let's face it, you're second best!\nI'm sending you straight back to Yu-Gi-Oh GX!\nYour deck's unbalanced and your hair's a Kuriboh.\nHey, Ho. I'm the motherflippin'\n\n[Joey]\n\nHe's the motherflippin' \n\n[TÃƒÂ©a]\n\nHe's the motherflippin'\n\n[Tristan]\n\nWho's the motherflippin'?\n\n[Yami]\n\nI'm the motherflippin'\nI'm the motherflippin'\nI'm the motherflippin'\n\nMotherflippin'!","torrent":{"xt":"urn:btih:42fcf77ae0f67a4fc8d6b99717c425efb4327720","amp;dn":"Jaden+Vs+Yugi+Rap+Battle+-+King+Of+Rhymes+%5BMP3-320%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42fcf77ae0f67a4fc8d6b99717c425efb4327720","infoHashBuffer":{"type":"Buffer","data":[66,252,247,122,224,246,122,79,200,214,185,151,23,196,37,239,180,50,119,32]},"announce":[],"urlList":[]}}