{"title":"Alex Jones Show - 2013 Aug 01 TH [sebaygo1]","uid":8768830,"size":92511901,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:431ec88b8aca3be0a7d956a86ee5914ea6632928&amp;dn=Alex+Jones+Show+-+2013+Aug+01+TH+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sebaygo1","files":15,"time":1375400860,"description":"\t\t\t\t\t\t\t\nThe Alex Jones Show\nThursday, 01 August 2013\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the Infowars web site :: On the Thursday, August 1 edition of The Alex Jones Show, Alex analyzes the letter to Obama penned by Snowden's father's legal counsel, comparing his administration's persecution of the NSA whistleblower to the war crimes addressed during the Nuremberg trials, claiming civil disobedience is necessary to obviate unjust laws or practices. \n\nAlex also breaks down the heckling of NSA head General Keith Alexander at a security conference in Las Vegas Wednesday as he faced an upset, privacy and liberty-minded audience. \n\nOn today's show, Alex welcomes World Net Daily CEO, editor and columnist Joseph Farah to discuss Obama's ramped up surveillance state in the face of public and congressional criticism, as well as fallout from the George Zimmerman verdict and the possible contention of conservative libertarian Rand Paul for the GOP's nomination.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n.\n","torrent":{"xt":"urn:btih:431ec88b8aca3be0a7d956a86ee5914ea6632928","amp;dn":"Alex+Jones+Show+-+2013+Aug+01+TH+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"431ec88b8aca3be0a7d956a86ee5914ea6632928","infoHashBuffer":{"type":"Buffer","data":[67,30,200,139,138,202,59,224,167,217,86,168,110,229,145,78,166,99,41,40]},"announce":[],"urlList":[]}}