{"title":"How.I.Met.Your.Mother.S05E22.PROPER.READNFO.HDTV.XviD-LULZ","uid":5554295,"size":117297508,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4481833daedc5f1637bb86264f6bccd097f5c45a&amp;dn=How.I.Met.Your.Mother.S05E22.PROPER.READNFO.HDTV.XviD-LULZ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"TvTeam","files":13,"time":1273638974,"description":". \n  &lt;a href=&quot;\nhttp://www.torrentday.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.torrentday.com&lt;/a&gt;   -    Your Key To The Scene.\n\nNow TvTeam with [No-RAR] Releases.\n\n(((((((((((((= Enjoy No RAR releases =))))))))))))))))))))\n\n...................................NFO:....................................\n\n.How.I.Met.Your.Mother.S05E22.PROPER.READNFO.HDTV.XviD-LULZ (2010-05-11)\n\nIt appears as though LOL have watermarked yet another release from their supposed\npre-air source (note that the timestamp of the extracted AVI is often earlier than\nthe time of which the show airs in the east-coast[1], though this may not\nnecessarily prove anything).\n\nLOL may have taken a content rating logo[2] and the Citytv logo[3] and overlayed\nit on their source perhaps via an AVISynth filter such as Overlay[4].\n\nCitytv broadcasts in HD DTT in the east- and west-coast.[5] Our source is the 1080i\npublic broadcast from the only east-coast Citytv station (CITY-TV) via DTT. Notice\nthat the timings, appearance, and alignment of both the content rating and station\nlogos are different compared to LOL's release. For instance, LOL's Citytv logo fades\nin as a whole, whereas our legitimate Citytv logo flies in letter by letter. Also,\nCITY-TV did not broadcast the scene at the end of LOL's release with the man in\nthe elevator.\n\nSo if LOL actually capped from east-coast CITY-TV, and released the show before\nanother HD Citytv station had aired it (which they did), why would such\ndiscrepancies exist? Remember, there's only one Citytv station in the east-coast\nand evidently[6] LOL didn't do a great job of making their source seem legitimate,\neven though they shouldn't have tried to from the get-go.\n\nAssuming (the possibly unlikely case) that their pre-air source is a &quot;backhaul&quot;\nfeed[7] in which flagship stations distribute shows to their affiliates, then it\nmay be expected to be sans-logo as affiliates are to overlay their own logo.\n\nThere's even a rule in the 2008 TV-X264 ruleset stating that &quot;group watermarks\nof any kind on the video will not be tolerated,&quot;[8] so it seems perplexing as\nto how DIMENSION are preing some of their releases scot-free.\n\nMoreover, it is interesting to note that for many of their releases, regardless of\nshow or station (i.e., &quot;Citytv&quot; or &quot;WDRB&quot;), the content-rating logo usually fades\nin at 2s and fades out at 11s.\n\nLOL are welcome to disprove these allegations of group watermarking by providing\nan unedited source sample and an explanation. If they cannot in a timely manner,\nor choose to continue to pre these group-watermarked releases, we may continue\nto proper them. In the meantime, here is the actual broadcast of the show on\nCITY-TV for the interested (ours is cropped to the widest frame[8]).\n\nOn another note, the recent biases and hypocrisies that have been rotting the scene\nhave grown out of hand. It may be very likely that this release will be nuked and\nLOL's release might not be nuked, both on the basis of a reason such as &quot;no.such.\nrule_there.are.no.tv.xvid.rules&quot;[9]. If that is the case, why nuke any TV-XVID\nrelease at all?\n\n1. What was the point of the nukewar between P0W4 and 2HD regarding Flashforward\n   S01E12? Perhaps, that a group can proper another group's release for the most\n   minute of reasons, but only if the group that has propered has seniority.\n   Remember, P0W4 was unable to successfully use the same argument that was used\n   to unnuke LOL's release of Happy Town[9]. For instance, LULZ has absolutely no\n   seniority over LOL, so would we have the &quot;right&quot; to proper?\n\n2. Groups with seniority do not deserve any leeway on their own technical flaws.\n   They must be held accountable just like any other TV-XVID group. If a group\n   has consistently ruined their releases, a &quot;warning&quot; nuke must not be made, but\n   all of the ruined releases must be retroactively nuked--regardless of group\n   seniority. For instance, this series is not the only one that LOL may have\n   watermarked with the Citytv logo (see Modern Family and Community). Will their\n   previous releases be retroactively nuked? Time will tell.\n\nThe bottom line is that all groups must be treated fairly and if there is a\nproven and reasonable technical flaw with a release, it deserves to be nuked.\nAny nuker that disagrees, does not deserve to be one.\n\nIncluded:\n1. Our source sample of the show (sample.mpg).\n2. A clip of the local news (news.mpg) to prove that this source is CITY-TV.\n3. A screenshot of the timestamp (timestamp.png) of the AVI of LOL's release.\n4. Frame comparisons of both releases (comparisons/).\n\nReferences:\n1. See timestamp.png.\n2. http://en.wikipedia.org/wiki/Television_content_rating_systems#Canadian_ratings\n3. http://en.wikipedia.org/wiki/File:Citytv_HD_logo.svg\n4. http://avisynth.org/mediawiki/Overlay\n5. http://en.wikipedia.org/wiki/Citytv#Citytv_HD\n6. See frame comparisons.\n7. http://news.cnet.com/2100-1023-258229.html\n8. http://rules.nukenet.info/t.html?id=2008_TV_X264.nfo\n9. See nuke history for Happy.Town.S01E01.HDTV.XviD-LOL.\n\n- We did it for teh lulz. ;)","torrent":{"xt":"urn:btih:4481833daedc5f1637bb86264f6bccd097f5c45a","amp;dn":"How.I.Met.Your.Mother.S05E22.PROPER.READNFO.HDTV.XviD-LULZ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4481833daedc5f1637bb86264f6bccd097f5c45a","infoHashBuffer":{"type":"Buffer","data":[68,129,131,61,174,220,95,22,55,187,134,38,79,107,204,208,151,245,196,90]},"announce":[],"urlList":[]}}