{"title":"Guns N' Roses - Patience  (2nafish)","uid":5622659,"size":215173124,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:4630f16b959ab413fd3882c586afcbdadafeb97b&amp;dn=Guns+N%5C%27+Roses+-+Patience++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"2nafish","files":1,"time":1276340870,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Patience&quot; is a song by the American  hard rock band Guns N' Roses, which appears on the album G N' R Lies &amp; was released as a single in 1988. The song peaked at #4 on the Billboard Hot 100. The song is played using 3 acoustic guitars &amp; was recorded in a single session by producer Mike Clink. A music video of the song was shot &amp; appears on the band's music video DVD, Welcome to the Videos. The music &amp; lyrics were written by rhythm guitarist &amp; founding member, Izzy Stradlin.\n\nThe motivation for the track is generally accepted to be the troublesome relationship between Axl Rose &amp; now ex-wife Erin Everly, though this was never stated in the album or interviews. It has been stated by the band that Izzy wrote the song about his ex-girlfriend Angela Nicoletti McCoy. Other points of view point to the video &amp; suggest it is about failed relationships in general. In the video, the band members are situated in a hotel where they are the only constant images, as all other people are present for a moment, then fade away. More recently fans have taken another view on the song, as now Rose is the only remaining member from the original lineup. In an ironic &amp; precognitive twist, the final parts of the video show Rose sitting alone in his home watching older Guns N' Roses videos in what appears to be a sad &amp; lonely state.\n\nThe video, directed by Nigel Dick, was one of many produced by the band. It was the last video in which Steven Adler (even though he did not play on the track) appeared &amp; the last before the Use Your Illusion videos. The hotel depicted in the video was inoperative &amp; scheduled for demolition, which took place days after filming.\n\n&quot;Patience&quot; has been a very stable part of the Guns N' Roses setlist during all of their tours. Since its release, very few shows have ever been played without it. When performed live, electric guitars were often used instead of acoustic. Despite having no drums on this song, Steven Adler and Matt Sorum would both make active use of their drum kit when performing this song, and pianist Dizzy Reed would be making active use on the keyboard as well. A live version from the 1992 performance in Tokyo is available on the double live album Live Era 87-93 which the performance was also released on DVD which was released in two parts which &quot;Patience&quot; is featured during the first half of the concert.\n\nLies, aka G N' R Lies, is the second album by the band Guns N' Roses, released in 1988. According to the RIAA, it has sold over five million copies in the United States.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt; \n\n","torrent":{"xt":"urn:btih:4630f16b959ab413fd3882c586afcbdadafeb97b","amp;dn":"Guns+N%5C%27+Roses+-+Patience++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4630f16b959ab413fd3882c586afcbdadafeb97b","infoHashBuffer":{"type":"Buffer","data":[70,48,241,107,149,154,180,19,253,56,130,197,134,175,203,218,218,254,185,123]},"announce":[],"urlList":[]}}