{"title":"Our Family Wedding (Movie Trailer)","uid":5612998,"size":9928830,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:48b86a497c97b1cbd8d3995a154c4a3349c97810&amp;dn=Our+Family+Wedding+%28Movie+Trailer%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sana.k","files":-1,"time":1275954823,"description":"Our Family Wedding is a grim prospect on its face: a frantic wedding movie meets an uproarious culture clash movie, where two patriarchs - the smooth African-American and the fiery Latino - do hilarious battle and then there's some romance somewhere. It fails to deliver even on that meagre promise. Forest Whittaker and Carlos Mencia play the fathers of young lovers Marcus and Lucia (Lance Gross and America Ferrera) who return home to L.A. to announce their surprise engagement and plans to be married immediately. Things get complicated, when we learn that Lucia's family don't really like black people, and Marcus' father, a neat-freak radio DJ-cum-ladies'-man, doesn't like Mexican people. Predicaments predictably follow, in the proper order and to factory specifications.\n\nDespite a legitimately (for the most part) talented cast and a set-up almost guaranteed to be worth at least a few forced laughs, the film manages to be almost completely devoid of humour. It's a punishing, depressing display. The film knows what beats to hit, and tries with heroic, military determination to hit them only to fail, every single time. We're presented with the really uncomfortable knowledge that the film knows it should be funny, here, here and here, and is really trying, honest - see how the goat tries to have sex with the fancy man!? - but just can't quite haul it's hackneyed self anywhere close to an actual laugh. It's ugly and it tries to make you complicit in its ugliness, like when you walk in on your roommate three quarters of the way through an extra large pizza and they try and make you eat the last slice.\n\nTo do the obvious thing and fail at it is the worst thing an artist can do. To offer a thin-gruel compromise to your audience, to say &quot;here's a trite, rote ethnicity-clash wedding comedy that you know will be derivative but what else are you going to watch come on it can't be terrible&quot; and then to hand them something terrible is just... rude. To ask us to watch Carlos Mencia flail his way through a grim, graceless Mr. Hulot-inspired bit of non-comedy is mean, and makes us feel badly about ourselves and the choices that brought us here.\n\nOne bright spot: Anjelah Johnson as the tomboy sister of the bride is the only actor in the film that's able to wring a couple of laughs out of it, and the sisters' relationship is one of the only interesting things in a film that's otherwise not much more than a grim procession of joyless clichÃƒÂ©s. 2/10\n\nRelease Date: 12 March 2010 (USA)\n","torrent":{"xt":"urn:btih:48b86a497c97b1cbd8d3995a154c4a3349c97810","amp;dn":"Our+Family+Wedding+%28Movie+Trailer%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48b86a497c97b1cbd8d3995a154c4a3349c97810","infoHashBuffer":{"type":"Buffer","data":[72,184,106,73,124,151,177,203,216,211,153,90,21,76,74,51,73,201,120,16]},"announce":[],"urlList":[]}}