{"title":"Les Humphries Singers - I'm From The South (German Disco Show","uid":5609464,"size":45620878,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:4c32c8e267aaa0cb2105bf8f1d1089f8ba2a9cc4&amp;dn=Les+Humphries+Singers+-+I%5C%27m+From+The+South+%28German+Disco+Show&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Iron_Horse","files":2,"time":1275779672,"description":"Les Humphries Singers - I'm From The South (German Disco Show 1973)\n\nHere is one more of the happy music of &quot;Les Humphries Singers&quot;\n\nQuality: Exelente.\nLenght: 02:49\nVideo: MPEG2 Video 480x576 (4:3) 25.00fps [Video]\nAudio: MPEG Audio 44100Hz stereo 128Kbps [Audio]\n\nFrom Wikipedia, the free encyclopedia\nThe Les Humphries Singers was a 1970s musical group formed in Hamburg, Germany  by the English born Les Humphries (born John Lesley Humphreys, 10 August 1940, in Croydon, Surrey, England  - died 26 December 2007, in Basingstoke, Hampshire, England), who had been inspired to do his own version of the Edwin Hawkins Singers. The group consisted of a large number of singers of diverse ethnic origin, some of whom such as John Lawton also performed with other groups. Another member was JÃƒÂ¼rgen Drews; who later started a long-running solo career, starting with his 1976 hit  in Germany, &quot;Ein Bett im Kornfeld&quot;, a cover version of &quot;Let Your Love Flow&quot; by the Bellamy Brothers.\n\nAdditional members included Liz Mitchell, later front woman with Boney M., and John Lawton, who also sang for the German progressive/hard rock band Lucifer's Friend and would go on to be the frontman for Uriah Heep. The Les Humphries Singers dissolved at the end of the 1970s, after Humphries had left due to tax liabilities to his English homeland, Alton Hampshire.\n\nIn his later years, Humphries led a quiet life in London. In March 2008, the German newspaper Bild reported his death on 26 December 2007 in a London hospital\n\n\nMusical background and style\nThe Les Humphries Singers performed a mix of popular music and gospel covers and had some success in Europe with this approach. Much like contemporary disco act Boney M., their music focused on Rhythm and blues, gospel, and disco, but often with psychedelic phasing or flanger effects on solos and bridges, and, much like James Last, much larger background choruses in the studio to emulate a live atmosphere. The Les Humphries Singers at the time brought something from the flair of the hippie movement into contemporary German-produced (but English-sung) pop music, especially due to their mixed ethnic background and peculiar fashion sense.\n\n\nHits and later re-unions\nTwo of their earliest and best known hits were &quot;Mexico&quot; (1972) which was based on the 1957 Jimmy Driftwood country hit &quot;The Battle of New Orleans&quot;, and &quot;Mama Loo&quot; (1973), based on &quot;Barbara Ann&quot; by The Beach Boys. In 1976 they represented Germany at the Eurovision Song Contest with the Ralph Siegel title &quot;Sing Sang Song&quot;, reduced to only six singers (their usual line-ups consisted of 20 performers and up), and came in 15th place, which they regarded as their beginning of the end as a band.\n\nThey disbanded shortly thereafter the same year, but enjoyed a short comeback as a pure live act from 1991 until 1993 performing their old hits. In 2006, the original band members formed 'The Original Singers' without Humphries, re-recording their old hits and also releasing new material.\n\n","torrent":{"xt":"urn:btih:4c32c8e267aaa0cb2105bf8f1d1089f8ba2a9cc4","amp;dn":"Les+Humphries+Singers+-+I%5C%27m+From+The+South+%28German+Disco+Show","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c32c8e267aaa0cb2105bf8f1d1089f8ba2a9cc4","infoHashBuffer":{"type":"Buffer","data":[76,50,200,226,103,170,160,203,33,5,191,143,29,16,137,248,186,42,156,196]},"announce":[],"urlList":[]}}