{"title":"The Health Wyze Report - Episode 7","uid":5533066,"size":27099422,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:4cf02dd8b0abf295525df8f04750c35134eaecd2&amp;dn=The+Health+Wyze+Report+-+Episode+7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mandalasarah","files":1,"time":1272983298,"description":"In episode 7 of The Health Wyze Report (audio edition), we discuss the many ways the Chinese are poisoning us, and how it can no longer be realistically considered accidental or coincidental. We talk about why breast feeding is really the only humane option for infants, and the long term repercussions of buying chemical formulas found in typical retailers. Mentioned is the new recalls for drugs and hygiene products that come from China, and that many are laced with heavy metals. Generic drugs are even less safe and less tested than brand name drugs. Vaccine refusal 'consent forms' being given out by pediatricians that could take away parental rights, and tricks parents into claiming that they are unfit. The insanity of the new prostate cancer vaccine. What immunosuppressants are and what they really do, and how they are in most of the pharmaceuticals to produce addictions, long term illnesses, and deceptive medicine. The scams of the cure foundations which claim to be seeking the cures for diseases. The sad tale of how they continue to deceive Michael J. Fox, how they'll make sure he is never cured, and how he got Parkinson's disease from the aspartame inside Diet Pepsi.","torrent":{"xt":"urn:btih:4cf02dd8b0abf295525df8f04750c35134eaecd2","amp;dn":"The+Health+Wyze+Report+-+Episode+7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4cf02dd8b0abf295525df8f04750c35134eaecd2","infoHashBuffer":{"type":"Buffer","data":[76,240,45,216,176,171,242,149,82,93,248,240,71,80,195,81,52,234,236,210]},"announce":[],"urlList":[]}}