{"title":"011 - Coast to coast - George Knapp amazon- 29 Mar 10 - 01.00AM-","uid":5471964,"size":116424352,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:50a58480236d4cce47a436edc93c660cda7a8896&amp;dn=011+-+Coast+to+coast+-+George+Knapp+amazon-+29+Mar+10+-+01.00AM-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"panzerfaust69","files":1,"time":1269938329,"description":"Mysteries of the Amazon\n   \n\nDate:03-28-10\n\nHost:George Knapp\n\nGuests:David Grann, Ron Wheelock, Victoria Alexander\n\nGeorge Knapp spoke with guests who've explored the mysterious Amazon in different ways. In the first half, author David Grann discussed his journey deep into the jungle to trace the path of British explorer Percy Fawcett and his search for the mythical &quot;Lost City of Z.&quot; Fawcett, who inspired Conan Doyle's The Lost World, embarked on his daring expedition in 1925, trying to find El Dorado, a so-called &quot;lost city of gold&quot; that was hidden in the Amazonian jungle. After sending out dispatches of his journey that were followed around the world for five months, he and his group vanished, Grann recounted.\n\nWhile a number of missions over the years set out to find Fawcett, he and his party were never located. Some speculated that he'd found a mystical portal to another dimension and entered it. Working from Fawcett's diaries kept by his granddaughter, Grann went to the Amazon to follow Fawcett's route and learn what became of him. He spoke with indigenous tribespeople whose oral history included stories of Fawcett. They said Fawcett ignored their warning of traveling in the direction of &quot;fierce Indians,&quot; and Grann concluded that Fawcett and his group were killed, rather than dying of starvation or disease. Regarding the lost city, he noted that recent aerial footage shows enormous geometric shapes diagrammed into the earth, and this may have been home to a large, ancient civilization.\n\n--------------------------------------------------\n\nIn the second half, the &quot;Gringo Shaman of the Amazon,&quot; Ron Wheelock, described his inner-journey, learning the ways of the ancient teachers and using the powerful hallucinogen, ayahuasca, a mixture made from the vine Banisteriopsis caapi and other plants. His student, Victoria Alexander, joined in the discussion. Wheelock is the lone western shaman in Iquitos, a city in the Peruvian rain forest that has become known as the ayahuasca capital of the world. He conducts weekly ayahuasca ceremonies that many attend to have healing and transformative experiences. &quot;It is medicine-- we don't like to refer to it as a drug,&quot; Wheelock said. &quot;With ayahuasca, it's not altered consciousness, it's heightened consciousness,&quot; Alexander added.\n\nDuring the ayahuasca experience, people will have profound visions and communications, and Wheelock is there to guide them. Under the plants' influence, he said he is able to commune with spirits that typically appear to him in human form. In one ceremony, Wheelock said a woman was cured of ovarian cancer, after he and a spirit entered her body to conduct a healing.\nWebsite(s):\n# davidgrann.com\n# gringoshaman.com\n# ronwheelock.com\n# fromthebalcony.com\nBook(s):\n# The Lost City of Z\n# The Devil and Sherlock Holmes: Tales of Murder, Madness and Obsession\n","torrent":{"xt":"urn:btih:50a58480236d4cce47a436edc93c660cda7a8896","amp;dn":"011+-+Coast+to+coast+-+George+Knapp+amazon-+29+Mar+10+-+01.00AM-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50a58480236d4cce47a436edc93c660cda7a8896","infoHashBuffer":{"type":"Buffer","data":[80,165,132,128,35,109,76,206,71,164,54,237,201,60,102,12,218,122,136,150]},"announce":[],"urlList":[]}}