{"title":"Dont Know Much About Geography Homeschool Educat","uid":5539116,"size":842159536,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:52fa06d99cc91df8deb53952196966618ed361a7&amp;dn=Dont+Know+Much+About+Geography+Homeschool+Educat&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cezen","files":-1,"time":1273166221,"description":"I specialize in children's software for homeschool and generic educational material for all ages and purposes.  \n\n\nHere is Amazon's page on this Audio book\nhttp://www.amazon.com/Dont-Know-Much-About-Geography/dp/0380713799\n\nDescription:  10 Disc Audiobook in MP3 format.\n\nSimply load into Itunes, select &quot;view options&quot; and then disc numbers, and then the tracks will be properly ordered.. just looking at the files, they are a jumbled mess.\n\nYou might think you need to look at a map to learn &quot;everything you need to know&quot; about geography, but Kenneth C. Davis proves otherwise. In this hugely entertaining and informative program, Davis takes a different approach to learning about the world by pointing out its relevance--and importance--in every sphere of human life. Geography, Davis explains, has been sadly misunderstood, which accounts for the fact that Americans consistently score lowest among peoples of industrialized nations when it comes to &quot;knowing where we are.&quot; He sets out to show listeners how this &quot;mother lode of sciences, the hub of a circle from which all the other studies radiate&quot; informs disciplines ranging from meteorology, climatology, and oceanography to economics, ecology, and political science. Rather than looking at geography as a parade of facts about where things are located, he encourages an approach that considers human and natural history in its larger context--and the universe as a large canvas upon which the fascinating story of life is drawn. Using his familiar question-and- answer method, Davis offers interesting anecdotes to explain, for example, who invented the compass; why wars are always fought over geography; the differences between country, republic, nation, and state; why the tallest mountain in the world is getting even taller; and much more. Succinct discussions coupled with Davis's lively writing style makes this a perfect candidate for audio presentation. Indeed, listening to this program without the aid of visuals underscores the sense conveyed that geography is as much about how we think about the world as where things are in physical space--that it is about the &quot;tender connections that keep the earth alive.&quot;\n\n************************************************************************\n\nPLEASE CHECK OUT MY OTHER IMPOSSIBLE TO FIND HOMESCHOOL AND EDUCATIONAL TORRENTS AT WWW.THEPIRATEBAY.ORG/USER/CEZEN","torrent":{"xt":"urn:btih:52fa06d99cc91df8deb53952196966618ed361a7","amp;dn":"Dont+Know+Much+About+Geography+Homeschool+Educat","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52fa06d99cc91df8deb53952196966618ed361a7","infoHashBuffer":{"type":"Buffer","data":[82,250,6,217,156,201,29,248,222,181,57,82,25,105,102,97,142,211,97,167]},"announce":[],"urlList":[]}}