{"title":"Codes: The Guide to Secrecy From Ancient to Modern Times (7Summi","uid":5650133,"size":6571764,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:53f73a47d25ee1dce53d4372befa7d645947ad57&amp;dn=Codes%3A+The+Guide+to+Secrecy+From+Ancient+to+Modern+Times+%287Summi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"7_summits","files":-1,"time":1277626905,"description":"Publisher: Chapman and Hall/CRC, 2005 | ISBN: 1584884703 | 701pages | PDF | 6.2MB\n\n\nFrom the Rosetta Stone to public-key cryptography, the art and science of cryptology has been used to unlock the vivid history of ancient cultures, to turn the tide of warfare, and to thwart potential hackers from attacking computer systems. Codes: The Guide to Secrecy from Ancient to Modern Times explores the depth and breadth of the field, remaining accessible to the uninitiated while retaining enough rigor for the seasoned cryptologist.\n\nThe book begins by tracing the development of cryptology from that of an arcane practice used, for example, to conceal alchemic recipes, to the modern scientific method that is studied and employed today. The remainder of the book explores the modern aspects and applications of cryptography, covering symmetric- and public-key cryptography, cryptographic protocols, key management, message authentication, e-mail and Internet security, and advanced applications such as wireless security, smart cards, biometrics, and quantum cryptography. The author also includes non-cryptographic security issues and a chapter devoted to information theory and coding. Nearly 200 diagrams, examples, figures, and tables along with abundant references and exercises complement the discussion.\n\nWritten by leading authority and best-selling author on the subject Richard A. Mollin, Codes: The Guide to Secrecy from Ancient to Modern Times is the essential reference for anyone interested in this exciting and fascinating field, from novice to veteran practitioner. ---------------------Features--------------------- Ã‚Â· Presents self-contained, thorough, and vibrantly illustrated coverage accessible to both professionals and laypersons Ã‚Â· Provides an intuitive approach with illustrations to provide an overview of the topics for the general reader that does not require a mathematical approach Ã‚Â· Incorporates more than 200 footnotes and 300 references for access to more in-depth information and further reading Ã‚Â· Contains all necessary mathematics, requisite probability theory, and exercises organized by chapter in the appendices.","torrent":{"xt":"urn:btih:53f73a47d25ee1dce53d4372befa7d645947ad57","amp;dn":"Codes%3A+The+Guide+to+Secrecy+From+Ancient+to+Modern+Times+%287Summi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53f73a47d25ee1dce53d4372befa7d645947ad57","infoHashBuffer":{"type":"Buffer","data":[83,247,58,71,210,94,225,220,229,61,67,114,190,250,125,100,89,71,173,87]},"announce":[],"urlList":[]}}