{"title":"2010-04-07-O&amp;A-CF64k","uid":5485110,"size":115426788,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:5424d32bcbee594c4a76e305a27a91b12c3f8fd1&amp;dn=2010-04-07-O%26A-CF64k&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"shuazien","files":-1,"time":1270663988,"description":"Opie and Anthony April 7, 2010\n\nThe boys went late today and my source didn't get the end.  So, we will all have to catch Mothergoose56's upload later today to catch the end.\nSorry 'bout that folks.\n\n**EDIT** Wow, I'm a tool.  I just actually listened to all of the end, rather than scanning through to find where to edit it.  The Boys kinda went late, but we got all of the show. I just scanned to far and hit a preview of a worst of and thought it was still the show. Like I said, oops, I'm a tool. The whole show is there.\n\nThanks to Opie, Anthony, Jim Norton, Tippy Tom, Sam Roberts, Danny, &quot;Uncle&quot; Paul Hauguss, &quot;Fat&quot; Bob Kelly, Loius CK, Travis, Club Soda Kenny, Awesome &quot;Stinky&quot; Garret, E-Rock, Francine, Lyle &quot;Chip&quot; Chiperson, Steven S, Jim Jeffries, Theodoor Scheckler, Bill Burr, Jim Florentine, Ian &quot;Google it!!&quot; Halperin, Mike Tyson, Turk February, Steve C, Otto, George, Frenchie, Brother Wease, Andrew Dice Clay, Mothergoose56, kurt,jonnychadootz, Leeham, shocxxx, buzzard8, a1958wil, monobrowj, ratnut12, djskittles, Luminol18, TokenWGuy, wiretapstudios, loveyafez, CJ, Unkelerb, parabolix, asok75, SissyCuckboy, grey151, polyonymous, theolin, PsychicStoner, all the stoners, djsickgravity, intotheknife, clauge, bloodyjimbonne, Fred, George, Bill, S****E*** , Schwigger, Me, ect.\n\nand Bobo, I guess...ick!\n\n:P\n\nSpread the Virus!!\n\nDon't forget the high quality Rips that Mothergoose56 does later in the day. That's the good shit, man.","torrent":{"xt":"urn:btih:5424d32bcbee594c4a76e305a27a91b12c3f8fd1","amp;dn":"2010-04-07-O%26A-CF64k","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5424d32bcbee594c4a76e305a27a91b12c3f8fd1","infoHashBuffer":{"type":"Buffer","data":[84,36,211,43,203,238,89,76,74,118,227,5,162,122,145,177,44,63,143,209]},"announce":[],"urlList":[]}}