{"title":"SUPER MARIO GALAXY 2[NTSC][Scrubbed]","uid":5632056,"size":1393347737,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:54612fd4a838283b8fd09bc10c436247b6cd75e9&amp;dn=SUPER+MARIO+GALAXY+2%5BNTSC%5D%5BScrubbed%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dnemers","files":1,"time":1276723792,"description":"Release Title: Super Mario Galaxy 2 (Wii)\nRelease Date: 11 Jun 2010\nPlatform: Wii\nGenre:PC &amp; Video Games &gt; Nintendo Wii &gt; Games &gt; Adventure\nFolder Size: 1.30GB 4.7GB's Extracted\nNumber of Files: Lots @47.6mb's\n\nGame Description:\n\nThe most critically acclaimed Wii game ever returns, as Mario battles Bowser and his minions across an even more bizarre galaxy of worlds. The first game is already acknowledged as the greatest 3D platform game ever made and this new sequel adds to the excitement with long-time Mario ally Yoshi.\n\nNot only will the little green dinosaur give you a ride wherever you want, but you can aim his tongue with the Wii remote and gobble up bad guys and bonuses alike. Eat a fruit and Yoshi will turn into a giant balloon or gobble a hot red pepper and he'll suddenly run at super speed.\n\nYou'll need all the help you can get too with even bigger and meaner bosses and some super hard secret levels. With a healthy mix of new tricks and old this is perfect fun for all the family and one of the best games on the Wii so far.\nKey Features\n\n* Super Sequel: The most famous hero in gaming returns for his most amazing adventure yet, filled with new worlds, new enemies and new allies.\n* Yoshi's Galaxy: Yoshi makes his first appearance in a Galaxy game, swinging across gaps with his tongue and gaining different powers by eating special fruits.\n* Mr Driller: Play with new power-ups such as the drill that lets Mario dig through the earth and into new areas - or even into the interior of planetoids.\n* Bullet Time: New features include time switches that slow down time for a few seconds, while turning the whole screen black and white.\n* Hard mode: For Mario experts new hidden stages provide a stiffer challenge than anything in the first game. Are you tough enough to beat them?\n\nAbout the Developer: Nintendo EAD Software Group Tokyo\nNintendo's famous EAD (Entertainment Analysis and Development) studio is managed by Mario and Zelda creator Shigeru Miyamoto. It is split up into six different teams, with the Tokyo-based studio specialising in platform games such as Donkey Kong: Jungle Beat and Super Mario Galaxy\n","torrent":{"xt":"urn:btih:54612fd4a838283b8fd09bc10c436247b6cd75e9","amp;dn":"SUPER+MARIO+GALAXY+2%5BNTSC%5D%5BScrubbed%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54612fd4a838283b8fd09bc10c436247b6cd75e9","infoHashBuffer":{"type":"Buffer","data":[84,97,47,212,168,56,40,59,143,208,155,193,12,67,98,71,182,205,117,233]},"announce":[],"urlList":[]}}