{"title":"Balaceras Grabadas | GunFire in Live","uid":5608114,"size":71692112,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:551a9f50f8eb09bd5ce1b4a1c70ff9843f747679&amp;dn=Balaceras+Grabadas+%7C+GunFire+in+Live&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Seyferin","files":12,"time":1275693158,"description":"The Globe and Mail, el diario de circulaciÃƒÂ³n nacional mÃƒÂ¡s importante de CanadÃƒÂ¡, destacÃƒÂ³ la &quot;estrategia y determinaciÃƒÂ³n&quot; del presidente de MÃƒÂ©xico, Felipe CalderÃƒÂ³n, en la lucha contra el crimen organizado y seÃƒÂ±alÃƒÂ³ que bajo su presidencia el paÃƒÂ­s se estÃƒÂ¡ convirtiendo en &quot;un protagonista internacional clave&quot;.\n\n&quot;El presidente CalderÃƒÂ³n ha hecho lo que sus predecesores no hicieron, confrontar a los cÃƒÂ¡rteles poderosos, brutales y bien financiados, con un ataque militar y policial completo, con gran riesgo polÃƒÂ­tico y personal, y con resultados mixtos&quot;, apuntÃƒÂ³ el diario en su editorial de este sÃƒÂ¡bado.\n\n&quot;El presidente CalderÃƒÂ³n no tuvo mÃƒÂ¡s remedio que actuar contra los sindicatos criminales, ya que comunidades enteras corrÃƒÂ­an el riesgo de caer bajo la influencia de ÃƒÂ©stos, y su estrategia y determinaciÃƒÂ³n deben ser aplaudidas&quot;, subrayÃƒÂ³ el diario.\n\nEntre otros aspectos, indicÃƒÂ³ que &quot;MÃƒÂ©xico no es solamente un protagonista regional. Es un protagonista global, y en dos de las cuestiones que requieren la mayor cooperaciÃƒÂ³n internacional -regulaciÃƒÂ³n financiera y ambiental- su contribuciÃƒÂ³n puede ser muy grande&quot;.\n\nConsiderÃƒÂ³ ademÃƒÂ¡s que la relaciÃƒÂ³n entre ambos paÃƒÂ­ses puede beneficiarse por la creciente importancia mexicana en materia de comercio, cooperaciÃƒÂ³n econÃƒÂ³mica global y el cambio climÃƒÂ¡tico, &quot;si los canadienses estÃƒÂ¡n preparados para ver que MÃƒÂ©xico estÃƒÂ¡ evolucionando&quot;.\n\n&quot;MÃƒÂ©xico es un paÃƒÂ­s en crecimiento y complicado, que enfrenta cuestiones relacionadas con la inmigraciÃƒÂ³n, las drogas y la violencia, y los cambios ambientales que lo ponen en el centro de muchas tendencias internacionales emergentes&quot;, seÃƒÂ±alÃƒÂ³.\n\nNo obstante, agregÃƒÂ³, en dos generaciones &quot;se prevÃƒÂ© que MÃƒÂ©xico serÃƒÂ¡ una de las mÃƒÂ¡s grandes economÃƒÂ­as del mundo. Es hora de que CanadÃƒÂ¡ vea a MÃƒÂ©xico no solamente como una inquietud factor regional, sino tambiÃƒÂ©n como parte de una oportunidad global&quot;.\n\nAsimismo el diario canadiense publicÃƒÂ³ una entrevista con el mandatario mexicano, en la cual CalderÃƒÂ³n Hinojosa refrendÃƒÂ³ que si se hubiera ignorado la acciÃƒÂ³n de los criminales se les hubiera permitido tomar las ciudades y las comunidades, lo que no era justo para el pueblo mexicano.","torrent":{"xt":"urn:btih:551a9f50f8eb09bd5ce1b4a1c70ff9843f747679","amp;dn":"Balaceras+Grabadas+%7C+GunFire+in+Live","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"551a9f50f8eb09bd5ce1b4a1c70ff9843f747679","infoHashBuffer":{"type":"Buffer","data":[85,26,159,80,248,235,9,189,92,225,180,161,199,15,249,132,63,116,118,121]},"announce":[],"urlList":[]}}