{"title":"Coast to Coast AM - 04-28-10 - Afterlife &amp; Channeling","uid":5531825,"size":56306629,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:56540c36ccda8dbe4d4e0650c9b4c459efa3b7d6&amp;dn=Coast+to+Coast+AM+-+04-28-10+-+Afterlife+%26+Channeling&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Lyrian","files":6,"time":1272952109,"description":"Date:\n 04-28-10\n \nHost:\n George Noory\n \nGuests:\n Jon Klimo, Stephen Bassett \n \n\n\nParanormal researcher Prof. Jon Klimo discussed his research into the nature of the afterlife, as well as channeled communications from ET sources. Through mediumships, and channeled information from the deceased, the Other Side has been variously depicted as heavenly, hellish, or a kind of purgatory. &quot;You do make a place for yourself in the afterlife based upon what happens in this life...and maybe earlier lives,&quot; he commented, explaining that a person's internal ideations could create their own heaven or hell. \n\nPutting together afterlife perspectives from religion, science, philosophy, OBEs, channeling, past lives, mystic visionary states, ghosts and hauntings, &quot;you get this kind of conglomerate..or picture that really stays very similar across so many witnesses,&quot; Klimo detailed. One commonality is that in the afterlife &quot;you have moved into a reality where there is no longer an inner or outer&quot;-- everything is made out of your own consciousness, he noted. After death, people eventually meet with spirit helpers, some sooner than later, then move to different levels of existence or frequencies, he added. \n\nKlimo has studied channeling that purports to come from extraterrestrial sources and also found commonalities that run through this material. He is particularly impressed with the information that comes from the entity Ra (as channeled by Carla Rueckert McCarty), who differentiates ETs that are &quot;service to self&quot; vs. &quot;service to others&quot; in orientation. Only those that are the latter in orientation are able to evolve and advance into a position of co-creation, according to Ra. Klimo also recommended the channeled writings of such people as Norma Milanovich (We the Arcturians), Lyssa Royal, and Darryl Anka (&quot;Bashar&quot;). \n\nETs &amp; Disclosure\nIn the last hour, UFO activist Stephen Bassett talked about how lately there has been a flurry of interest in the scientific community about the possibility of ET life, and they may be playing catch-up in preparation for disclosure announcements. He also shared that the upcoming X-Conference will be available as a live stream/pay-per-view for those not able to attend the event in person. \n","torrent":{"xt":"urn:btih:56540c36ccda8dbe4d4e0650c9b4c459efa3b7d6","amp;dn":"Coast+to+Coast+AM+-+04-28-10+-+Afterlife+%26+Channeling","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56540c36ccda8dbe4d4e0650c9b4c459efa3b7d6","infoHashBuffer":{"type":"Buffer","data":[86,84,12,54,204,218,141,190,77,78,6,80,201,180,196,89,239,163,183,214]},"announce":[],"urlList":[]}}