{"title":"Bob Dylan - Blood In My Eyes  (2nafish)","uid":5640904,"size":191092740,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5910709ea33d372ec4961de41170d51f2caaed49&amp;dn=Bob+Dylan+-+Blood+In+My+Eyes++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1277102401,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nWorld Gone Wrong is singer-songwriter Bob Dylan's 29th studio album, released by Columbia Records in October 1993.\n\nIt was Dylan's second consecutive collection of only traditional folk songs, performed acoustically with guitar and harmonica. The songs tend to deal with darker and more tragic themes than the previous outing, Good as I Been to You.\n\nThe album received a warm, if not excited reception from critics. Despite earning a Grammy award for Best Traditional Folk Album, it peaked at a modest #70 in the U.S., #35 in the UK.\n\nLike its predecessor Good as I Been to You, World Gone Wrong was recorded to fulfill the terms of his January 18, 1988 contract. It would be the final album released under that contract.\n\nIn May 1993, Dylan once again held sessions at his Malibu home inside his garage studio. Recorded solo in a matter of days, a total of 14 songs were recorded without a single change in guitar strings. Marked by distortion, the recording quality was very primitive by modern standards, with very casual microphone placement and very little tuning. There were some rumors that Dylan had mastered the album from cassette tapes, as Bruce Springsteen had done with Nebraska, but those rumors have been as difficult to prove as they have been to dismiss.\n\nPossibly influenced by the controversy surrounding Good as I Been to You, Dylan wrote a complete set of liner notes to World Gone Wrong, citing all possible sources. It had been decades since Dylan had written his own liner notes, and they were always surrealistic; these notes, while still playfully written, were actually informative.\n\nThe response to World Gone Wrong was very positive, with many regarding it as superior to Good as I Been to You.\n\nRobert Christgau gave it an A- in his Consumer Guide column published in The Village Voice. &quot;Dylan's second attempt to revive the folk music revival while laying down a new record without writing any new songs is eerie and enticing,&quot; wrote Christgau. &quot;He cherishes the non sequiturs, sudden changes of heart, and received or obscure blank spots in these buried songs--all usages he's long since absorbed into his own writing because he believes they evoke a world that defies rationalization. Me, I'm not so sure it doesn't just seem that way because there's no way we can be intimate with their worlds anymore.&quot;\n\nIra Robbins wrote in Newsday that &quot;the record expresses as much about Bob Dylan's art as any collection of originals.&quot; Even music critic Bill Wyman, who dismissed Good as I Been to You, wrote that &quot;it's a testament to his unpredictability that [Good as I Been to You] is tedious and World Gone Wrong is a signal document, a mesmerizing and sanguinary walk down the blood-soaked history of folk and blues. It also has his best liner notes since the 1960s.&quot;\n\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:5910709ea33d372ec4961de41170d51f2caaed49","amp;dn":"Bob+Dylan+-+Blood+In+My+Eyes++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5910709ea33d372ec4961de41170d51f2caaed49","infoHashBuffer":{"type":"Buffer","data":[89,16,112,158,163,61,55,46,196,150,29,228,17,112,213,31,44,170,237,73]},"announce":[],"urlList":[]}}