{"title":"Driv3r [NTSC]","uid":5595609,"size":4107604186,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:59a094c8538dbdb1d24eeedbb6ebab21a59144b3&amp;dn=Driv3r+%5BNTSC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"theblasphemousbear","files":2,"time":1275027688,"description":"This is a ripped PS2 NTSC ISO of the shooting game &quot;Driv3r&quot;. (Pronounce 'Driver 3,' 'Drivthreeer' or 'that really glitchy GTA clone')\n\nDescription: ( http://en.wikipedia.org/wiki/Driv3r )\n&quot;Driv3r, more commonly known as Driver 3 (marketed as DRIV3R), is a racing, shooting, and adventure video game. It is the third installment in the popular Driver series and was developed by Reflections Interactive and published by Atari. Driv3r was released in North America for the PlayStation 2 and Xbox on June 21, 2004. In Europe, it was officially released on June 25, although due to the way Atari shipped the title across the continent, it made its way into independent UK retailers before the release date, even making a #6 position in the ELSPA chart for that week. On March 15, 2005, it was released on PC for US customers, it was also released on Game Boy Advance October 25, 2005. A scaled down version was released for the mobile phone in June 2004. At one point a Nintendo GameCube version was planned, but it was later canceled.\n\nDriv3r brings back features from Driver 2 and adds the ability to ride motorcycles and boats, use weapons, swim, climb ladders, and enter certain buildings among other things, as well as controlling more than one character.&quot;\n\nI'll level with you: the game is glitchy as hell and has a weak story and campaign mode.\nBut, honestly, Free Ride is the shit. If anything, download it for that.\n\nAnd seed, please. And visit my profile for other NTSC PS2 ISOs!","torrent":{"xt":"urn:btih:59a094c8538dbdb1d24eeedbb6ebab21a59144b3","amp;dn":"Driv3r+%5BNTSC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59a094c8538dbdb1d24eeedbb6ebab21a59144b3","infoHashBuffer":{"type":"Buffer","data":[89,160,148,200,83,141,189,177,210,78,238,219,182,235,171,33,165,145,68,179]},"announce":[],"urlList":[]}}