{"title":"Sexually Broken--Bratty big breasted Penny Barber taken down  Ma","uid":8854940,"size":1071373252,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:59c741cb5424362b6660611a354e18e8f4acc8ee&amp;dn=Sexually+Broken--Bratty+big+breasted+Penny+Barber+taken+down++Ma&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1377627582,"description":"Bratty big breasted Penny Barber taken down a peg and face fucked into next week by 2 cocks! | Penny Barber | Matt Williams\n\nAugust 26, 2013 \n\n\nMP4 only. \n\n \nPenny Barber sure likes to talk. She is as mouthy as they come, and stuffed to the brim with sass. Let's replace that sass with cock. Lots and lots of cock. It is hard to stay sassy when you are being overloaded with epic amounts of dick and small amounts of air.\n\nOur booming MILF starts off shackled against the wall to properly display her lush body. A neck rope adds to the picture and makes a convenient collar. We start off with a vibrator and some tugging at that handy collar. Penny's pussy betrays her almost immediately and her eyes glass over as we tug at her neck rope. Attitude adjustment in progress! Next we come in come in with our handy flogger. When sass mets flogger, the flogger wins every time. Her skin flushes red with each impact and she struggles to stand straight. \n\nMoving quickly, we unshackle her from the wall and bring her down to her smug little knees. A rock hard cock is introduced right to the back of her tonsils. She struggles and gasps, trying to survive. The more cock that she has lodged in her throat the less attitude she has on her face. Just to be sure she is really getting the message, we introduce 10 massive inches of mighty man meat in the form of Jack Hammer. Jack hammers her face hole until she is a drooling undone mess of limp flesh. It is a good look for her.\n\nSchool is in session and we are only just getting started. Penny is flipped over into a piledriver position. The piledriver assures she will feel the full brunt of every stroke. Doubled over with her breasts in her face and her pussy in full helpless display, Penny is about to receive the dicking down of a lifetime. What follows is an onslaught of cock. Penny is used like a fucksheath. Back and forth, one dick after another, plunging up to the hilt of her exposed pussy. Nothing like a good cervix pounding to knock the sass right out of a girl. \n\nThere is nothing Penny can do to stop us. Face down, ass up, and shackled to the floor with her pussy as a bullseye, we drill her down until her brain meat melts. Throw in some foot caning on her tender soles as dessert and leave our brat bolted to the floor until the next time we happen to feel like using her holes.  \n \nScreens  &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/08_26pbarber2/SexuallyBroken-Penny-Barber-Matt-Williams-Bratty-big-breasted-Penny-Barber-taken-down-a-peg-and-face-fucked-into-next-week-by-2-cocks.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/08_26pbarber2/SexuallyBroken-Penny-Barber-Matt-Williams-Bratty-big-breasted-Penny-Barber-taken-down-a-peg-and-face-fucked-into-next-week-by-2-cocks.php&lt;/a&gt;\n\n11 000 uploads and counting, 12k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n\n","torrent":{"xt":"urn:btih:59c741cb5424362b6660611a354e18e8f4acc8ee","amp;dn":"Sexually+Broken--Bratty+big+breasted+Penny+Barber+taken+down++Ma","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59c741cb5424362b6660611a354e18e8f4acc8ee","infoHashBuffer":{"type":"Buffer","data":[89,199,65,203,84,36,54,43,102,96,97,26,53,78,24,232,244,172,200,238]},"announce":[],"urlList":[]}}