{"title":"Las Gorgonas - Discography (2001-2007)","uid":5491274,"size":145814608,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5ad4a3453148c2489a685861a5ea75c0f243478c&amp;dn=Las+Gorgonas+-+Discography+%282001-2007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zhmuplik","files":33,"time":1271013367,"description":"Las GORGONAS se formaron en agosto de 1997 con Omar F. en la Voz y programacion de secuencias, RomÃƒÂ¡n F. en la guitarra y programaciÃƒÂ³n de secuencias, Panchito Death en el Bajo y sintetizador. Actualmente la alineaciÃƒÂ³n es Omar F. y RomÃƒÂ¡n F, Definen su sonido como DEATHROCK en el cual se incorporan elementos clÃƒÂ¡sicos del death rock y nuevos sonidos. La banda se ha presentado en los lugares mÃƒÂ¡s representativos de la escena underground del paÃƒÂ­s y a lo largo de su trayectoria han alternado con bandas como SEX GANG CHILDREN, CINEMA STRANGE, THE LAST DANCE, THE DEATH OF A PARTY, SCARLET..S REMAINS, NAUGTHY ZOMBIES, CARNICEROS DEL NORTE, AVANT GARDE, BLOOD, CORVUS CORAX, TANZWUT, RABIA SORDA, MALDOROR, AMDUSCIA, HOCICO Y MAS....ADEMAS DE CONTAR CON UNA GIRA EN EUROPA A LO LARGO DE 6 CIUDADES (ROMA, ALICANTE, VALENCIA, MADRID, PORTO Y LISBOA) Y OTRA MAS EN SUDAMERICA (BUENOS AIRES Y LIMA) GORGONAS CUENTA CON MAS DE 170 PRESENTACIONES EN MEXICO. Las Gorgonas cuentan con 3 materiales el primero en el 2001 llamado &quot;Deathrock&quot;, el segundo en el 2005 llamado &quot;Nocturno kaos&quot; y el tercero en el 2007 &quot;Teatro Macabro&quot; las cuales son producciones independientes.\n\nAlbums:\n(2001) Deathrock (demo)\n(2005) Nocturno Kaos\n(2007) Teatro Macabro\n\n","torrent":{"xt":"urn:btih:5ad4a3453148c2489a685861a5ea75c0f243478c","amp;dn":"Las+Gorgonas+-+Discography+%282001-2007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ad4a3453148c2489a685861a5ea75c0f243478c","infoHashBuffer":{"type":"Buffer","data":[90,212,163,69,49,72,194,72,154,104,88,97,165,234,117,192,242,67,71,140]},"announce":[],"urlList":[]}}