{"title":"ExploitedCollegeGirls - Lana (2013) [720p].mp4","uid":8730666,"size":1197318578,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:5b13b58858dcd2ac2990f80725657a58a2cf5eac&amp;dn=ExploitedCollegeGirls+-+Lana+%282013%29+%5B720p%5D.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"FluxXxu","files":-1,"time":1374599541,"description":"\nExploitedCollegeGirls - Lana (2013) [720p].mp4\n\n\nScreens\n &lt;a href=&quot;\nhttp://postimg.net/viewerr1.php?file=16073807490448564079.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.net/viewerr1.php?file=16073807490448564079.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://postimg.net/viewerr1.php?file=14960174761229112118.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.net/viewerr1.php?file=14960174761229112118.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://postimg.net/viewerr1.php?file=64188751990998352306.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.net/viewerr1.php?file=64188751990998352306.jpg&lt;/a&gt;\n\n\nDescription\n\n&quot;This week's ECG starlet, Lana, declares that she hopes her performance on camera will vault her to pornstar fame. I'm not entirely sure of how that's going to work out for this shy U of A girl, but at least she has goals. After some probing she reveals that it's been several weeks since she's had a good orgasm, so I'm excited to give her a few despite her shyness. How shy? She doesn't even want to show her tits on camera, so most of the shoot is her getting banged face down or in doggy.\nDuring our interview, Lana declares that she's never used a sex toy which is great, there's nothing I love more than introducing young college coeds to new and interesting ways of cumming. I have her strip and lay down so I can apply a vibrator to her nearly perfect pussy. The vibrations prove too much for her sensitive puss and pretty soon she's begging for my cock.\nAfter getting both of us excited with a nice rough BJ, I get her flat on the bed for some hard pin down fucking. She turns out to be really submissive and gets off on being held down and pounded into the bed, but you can hardly tell from her vocal reactions, she turns out to be really quiet when getting fucked. I can tell by her body language that she's into it, though. I should have take Lana to the hotel in the last update, they never would have busted me for filming a sex scene in my room.\nAfter punishing her pussy with some hard pin down fucking, I get her into doggy to get a view of that amazing pussy and ass. I can't stop playing with her tight little asshole and it's driving me insane that I can't fuck it, but it is what it is. It's getting me really close to busting a load and since Lana isn't on the pill, she's getting it in the face. I have her drop to her knees for the main event and coat her face and tits with spunk.\nI think Lana is a little too shy and reserved to rocket to porn fame, maybe she should consider transferring to ASU. The girls from THAT Arizona school could teach her a thing or two about being an uninhibited porn starlet on or off camera. &quot;\n\n\nTags\n\nHardcore, XxX, Hot, Cumshot, Blowjob, Facial, Brunette\n\n\nResolution\n\n1280x720\n  \n\nDuration\n\n00:44:11\n   \n\t\nSize\n\n1.12 GB\n      ","torrent":{"xt":"urn:btih:5b13b58858dcd2ac2990f80725657a58a2cf5eac","amp;dn":"ExploitedCollegeGirls+-+Lana+%282013%29+%5B720p%5D.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b13b58858dcd2ac2990f80725657a58a2cf5eac","infoHashBuffer":{"type":"Buffer","data":[91,19,181,136,88,220,210,172,41,144,248,7,37,101,122,88,162,207,94,172]},"announce":[],"urlList":[]}}