{"title":"Microsoft System Center Essentials 2010 x86-x64","uid":5612934,"size":5263517696,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5ca893b41b5b3463681ee06f78c3487aed9c6649&amp;dn=Microsoft+System+Center+Essentials+2010+x86-x64&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"peva3","files":1,"time":1275952847,"description":"he newest version of Microsoft System Center Essentials 2010 - a toolset to assist in supporting and managing Windows Servers and desktop systems has been launched today.\n\nThe product is a key to providing management capabilities to smaller and mid sized organistaion who have traditionally not be taken advantage of Microsoft's higher end System Center tools such as Virtual Machine Manager or System Center Operations Manager.\n\nInformation regarding when Microsoft System Center Essentials 2010 will be available are expected soon. Currently it is not listed as a download on Microsoft's volume licensing website.\n\nKey Points on Essentials 2010 from Microsoft:\n\nProvides a unified solution with a single console for managing a broad range of tasks across your physical and virtual servers, clients, hardware, software, and IT services for a unified experience.\nEnables you to proactively manage your IT environment, helping keep your system up-to-date with a solution that accelerates problem resolution and enables automation of system updates and data collection.\nIs easy to deploy and maintain helping simplify complex management tasks for increased IT efficiency.\nKey new features:\nHas raised the number of Windows Server devices you can manage from 30 to 50.\nIncludes built Virtual Machine Manager 2008 R2 technology right into the product, so that Essentials 2010 provides a single console and management solution for managing both your physical and virtual servers. This includes support for converting physical servers to virtual machines and support for live migration.\nThe console has a new look and feel making it easier than ever to quickly check the health of your IT environment and address any issues.\nInstallation and configuration are even easier with checks for prerequisites during installation and Group Policy checks for proper configuration.","torrent":{"xt":"urn:btih:5ca893b41b5b3463681ee06f78c3487aed9c6649","amp;dn":"Microsoft+System+Center+Essentials+2010+x86-x64","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ca893b41b5b3463681ee06f78c3487aed9c6649","infoHashBuffer":{"type":"Buffer","data":[92,168,147,180,27,91,52,99,104,30,224,111,120,195,72,122,237,156,102,73]},"announce":[],"urlList":[]}}