{"title":"El Violador Infernal aka The Evil Butt Raping Drug Dealer","uid":5642464,"size":733046241,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5edf7730f26af7d5d9019a2ab72fb50ab582bece&amp;dn=El+Violador+Infernal+aka+The+Evil+Butt+Raping+Drug+Dealer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"SuperMexican","files":-1,"time":1277163759,"description":"  Here is another cheesy exploitation cult classic that is not on Pirate Bay. This review by Robert Black aka The Antichrist of Rue-Morgue.com says it all...\n\n&quot;A 1988 Mexican satanic slasher flick that pays homage to those New York 42nd St sleazefests by upping that particular ingredient into the stratosphere. Translated as The Infernal Violator, this film tries valiantly to live up to it's title. A condemned criminal makes a last minute deal with Satan sparing him from the electric chair.Next time we see him he's wealthy, snorting coke and generally living the high life. Sure, the downside is he has to knife,rape,carve 666s into a few large breasted Mexican senioritas, but that's part of the bargin.He's even PC enough to do the same to a gay man. Carving him up as he's anally violating him.Shot with an incredibly lurid colour scheme, Violator stands out from the crowd by managing to exaggerate it's tasteless premise to ludicrous melodramatic proportions. It's not great art, but it's fine trash.&quot;\n\n   I'm uploading this now to share with the Piratebay community. Please seed and enjoy!","torrent":{"xt":"urn:btih:5edf7730f26af7d5d9019a2ab72fb50ab582bece","amp;dn":"El+Violador+Infernal+aka+The+Evil+Butt+Raping+Drug+Dealer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5edf7730f26af7d5d9019a2ab72fb50ab582bece","infoHashBuffer":{"type":"Buffer","data":[94,223,119,48,242,106,247,213,217,1,154,42,183,47,181,10,181,130,190,206]},"announce":[],"urlList":[]}}