{"title":"Spangas op survival TorrentNL","uid":5460102,"size":737866611,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5f20c5de05cd01eb9c8a6f4af0209a97d6d54ae5&amp;dn=Spangas+op+survival+TorrentNL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TorrentNL","files":3,"time":1269445557,"description":"De leerlingen van het 'Spangalis'-college verlaten de schoolbanken en gaan op een actieve werkweek naar de Ardennen. Docent Jochem gaat als begeleider mee evenals docent Engels Miss Madge, die niet zit te wachten op een week slapen in een tent. Jochem heeft er wel veel zin in en gaat ervoor. Eenmaal aangekomen bij het basiskamp in het bos is het de bedoeling dat de leerlingen in teams allerlei opdrachten uitvoeren, maar dit gaat niet zonder slag of stoot. De onderlinge verwikkelingen en hevige concurrentiestrijd in de groep staan een goede samenwerking vaak in de weg. Hierdoor komen de leerlingen zelfs in gevaarlijke situaties terecht. Tijdens het hoogtepunt van de werkweek; 'de dropping' is de concurrentiestrijd tussen de verschillende groepen zo hevig dat de zekerheid van een goede afloop ver te zoeken is. De groepen moeten gaan samenwerken en krachten moeten worden gebundeld om veilig terug te komen op het basiskamp. Tijdens de werkweek komen goed bewaarde geheimen van de leerlingen naar buiten en leer je de leerlingen van een hele andere kant kennen. Heimwee, liefdes, ruzies en avontuur...tijdens deze survival wordt een ware levensles geleerd.","torrent":{"xt":"urn:btih:5f20c5de05cd01eb9c8a6f4af0209a97d6d54ae5","amp;dn":"Spangas+op+survival+TorrentNL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f20c5de05cd01eb9c8a6f4af0209a97d6d54ae5","infoHashBuffer":{"type":"Buffer","data":[95,32,197,222,5,205,1,235,156,138,111,74,240,32,154,151,214,213,74,229]},"announce":[],"urlList":[]}}