{"title":"Prayer - Hans Urs von Balthasar (pdf)","uid":8709724,"size":1715609,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5f895f1b291046a3707c2b439400f4989378d7bf&amp;dn=Prayer+-+Hans+Urs+von+Balthasar+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pharmakate","files":-1,"time":1374211065,"description":"Prayer - Hans Urs von Balthasar (Ignatius, 1986). 311 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\ndescription:\n\nThis is perhaps the best and most comprehensive book on prayer ever written. From the persons of the Trinity through the Incarnation to the Church and the very structure of the human person, this book is a powerful synthesis of what prayer is and how to pray. The testament of a great theologian on something which is most personal and interior, contemplative prayer.\n\nReview\n\nIn this modern classic, von Balthasar illumines the nature and practice of contemplative prayer in explicit and vital connection with the mysteries of Christian revelation. His extraordinary flair for drawing spiritual implications from the most profound theological insights is brilliantly displayed on so many of its pages. This is a book on prayer that stimulates our yearning for God as it points us toward ever-deepening and authentic encounters with Him. --Margaret M. Turek, S.T.D., Associate Professor of Systematic Theology, St. Patrick's Seminary and University\n\n----\n\ncool fact for nedand: Eugene Peterson, in his book Take and Read, gives this book very, very high praise.","torrent":{"xt":"urn:btih:5f895f1b291046a3707c2b439400f4989378d7bf","amp;dn":"Prayer+-+Hans+Urs+von+Balthasar+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f895f1b291046a3707c2b439400f4989378d7bf","infoHashBuffer":{"type":"Buffer","data":[95,137,95,27,41,16,70,163,112,124,43,67,148,0,244,152,147,120,215,191]},"announce":[],"urlList":[]}}