{"title":"PAYDAY 2 Online Ready Repack 2","uid":8822889,"size":3696755580,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:619fa8009b5b53b90f904b282c1e4b3d6c3e9908&amp;dn=PAYDAY+2+Online+Ready+Repack+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"AN0NYMOUS142857","files":-1,"time":1376748544,"description":"This is the ultimate repack for those who want to play the game online without hassle.Includes Update 1 and 2.\n\nInstructions:\n\n1. Extract contents of PAYDAY.2.Repack\n2. Run setup.exe and install the game where you like\n3. Extract and run PAYDAY.2.Update.1 to your game folder\n4. Extract and run PAYDAY.2.Update.2 to your game folder\n5. Extract contents of PAYDAY.2.Multiplayer.Crack.v1 to your game folder\n6. Play\n\nMake sure Steam is running before you play the game.\n\n\nPAYDAY 2 is an action-packed, four-player co-op shooter that once again lets gamers don the masks of the original PAYDAY crew - Dallas, Hoxton, Wolf and Chains - as they descend on Washington DC for an epic crime spree.\n\nThe new CRIMENET network offers a huge range of dynamic contracts, and players are free to choose anything from small-time convenience store hits or kidnappings, to big league cyber-crime or emptying out major bank vaults for that epic PAYDAY. While in DC, why not participate in the local community, and run a few political errands?\n\nUp to four friends co-operate on the hits, and as the crew progresses the jobs become bigger, better and more rewarding. Along with earning more money and becoming a legendary criminal comes a new character customization and crafting system that lets crews build and customize their own guns and gear.\nKey Features\nRob Banks with Friends   Players must choose their crew carefully, because when the job goes down they will need the right mix of skills on their side.\nCRIMENET   The dynamic contract database lets gamers pick and choose from available jobs by connecting with local contacts such as Vlad the Ukrainian, shady politician &quot;The Elephant&quot;, and South American drug trafficker Hector, all with their own agenda and best interests in mind.\nPAYDAY gun play and mechanics on a new level   firing weapons and zip tying civilians never felt so good.\nDynamic Scenarios   No heist ever plays out the same way twice. Every single scenario has random geometry or even rare events.\nChoose Your Skills   As players progress they can invest in any of four special Skill Trees: the Mastermind, the Enforcer, the Ghost and the Technician. Each features a deep customization tree of associated skills and equipment to master, and they can be mixed and matched to create the ultimate heister.\nMore Masks than Ever   PAYDAY 2 features a completely new mask system, giving players the ability to craft their own unique mask together with a pattern and a color combination.\nWeapons and Modifications   A brand new arsenal for the serious heister, covering everything from sniper and assault rifles to compact PDWs and SMGs. Once you've settled for a favorite, you can modify it with optics, suppressors, fore grips, reticles, barrels, frames, stocks, all of which will affect the performance of your weapon. There are also purely aesthetic enhancements - why not go for the drug lord look with polished walnut grips for your nine?\nPlay It Your Way   Each job allows for multiple approaches, such as slow and stealthy ambushes, to running in guns blazing. Hit the target any way you want, and watch as the heist unfolds accordingly.","torrent":{"xt":"urn:btih:619fa8009b5b53b90f904b282c1e4b3d6c3e9908","amp;dn":"PAYDAY+2+Online+Ready+Repack+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"619fa8009b5b53b90f904b282c1e4b3d6c3e9908","infoHashBuffer":{"type":"Buffer","data":[97,159,168,0,155,91,83,185,15,144,75,40,44,30,75,61,108,62,153,8]},"announce":[],"urlList":[]}}