{"title":"Gandang Gabi Vice EP 1-12 May 5-July 21, 2013","uid":8729916,"size":2687831628,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:62830c6fa6d20b5fdcf77c201d907a99ed4dde8f&amp;dn=Gandang+Gabi+Vice+EP+1-12+May+5-July+21%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Alexdokko","files":13,"time":1374575272,"description":"Gandang Gabi, Vice! (lit. Good Evening, Vice!) is a Philippine comedy variety talk show hosted by stand-up comedian Vice Ganda.[1] Debuting on May 22, 2011, it airs every Sunday night on ABS-CBN. For its first season, the show was slated for thirteen episodes.[2] The show focuses on interviews with media personalities and comedic interactive segments, and also features live acts from various performers. After the announcement of the show's planned end on February 19, 2012, due to a lot of feedback requesting the continuation of the show, it was announced that the supposed end of the show on said date was only to be the finale of the first season, and that the show will continue with a second season the following week.\n\nThe show frequently opens with an opening act composing of a song either sung by Vice Ganda or another featured musician, and a dance performance onstage (commonly finalists from Vice's other show Showtime). Afterwards, the host introduces the show and the featured guests in the episode, including an unidentified guest who will star on the show later. After a commercial, guests are introduced during each of the show's segments. One segment, titled Vice Advice, features Vice and her guest/s giving advices to citizens onstage or from the show's official site in the social networking sites Facebook and Twitter. The segment ends with a composed song likewise giving a message to the latter. This segment changed its format on the show's fifth episode. In the new format, Vice will draw questions in a crystal ball containing questions that were posted by the followers on the show's Twitter and she will try to answer hilariously as many questions as she can for one minute. After that, she will present a certain issue and will ask an audience his/her opinion regarding the issue. The segment still ends with a composed song pertaining to the issue tackled.\nAfter all guests have been interviewed, Vice closes the show with a challenge, wherein audience members participate in a game or prank to win various prizes. All segments are serenaded by a band led by musical director Marvin Querido","torrent":{"xt":"urn:btih:62830c6fa6d20b5fdcf77c201d907a99ed4dde8f","amp;dn":"Gandang+Gabi+Vice+EP+1-12+May+5-July+21%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62830c6fa6d20b5fdcf77c201d907a99ed4dde8f","infoHashBuffer":{"type":"Buffer","data":[98,131,12,111,166,210,11,95,220,247,124,32,29,144,122,153,237,77,222,143]},"announce":[],"urlList":[]}}