{"title":"Micky Flanagan - What Chance Change - S01 - Audio Comedy - MP3 -","uid":5630326,"size":105943166,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:62c4d8621faabe6763f2e11ad03c9b47a01a5076&amp;dn=Micky+Flanagan+-+What+Chance+Change+-+S01+-+Audio+Comedy+-+MP3+-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"_Slimoo_","files":4,"time":1276647096,"description":"Micky Flanagan What Chance Change - Series 01 - Audio Comedy - BBC Radio 4 via DVB-T\n4 x 30 Minute Episodes - 128Kbps - Mp3 - Slimoo\n\nRadio series in which 'cockney geezer' Micky Flanagan regales listeners with the story of how he went from being a working-class boy to middle-class gent - and being caught awkwardly between the two.\n\nHis personal story tells how he went from tabloids to broadsheets; from white bread to paninis; from street parties to dinner parties; and from apples and pears to stocks and shares.\n\nMicky charts his journey through stand-up comedy and documentary features which go &quot;behind the scenes&quot; to look at the way in which the people in his life helped him make these transitions and explore the way class shapes peoples' experiences.\n\nEach week's episode focuses on a different decade of Micky's life. Just like Forrest Gump he always seems to have been well placed to observe social changes in British society. In the Seventies - a working class youth in the East End of London - he left school and worked in the fish market, as the East End began to be gentrified. In the wealthier Eighties, when travel abroad was becoming an option for those other than the very rich, Micky moved to New York.\n\nAt the dawn of Thatcherism, Micky was an entrepreneur, until Open University broadened his horizons.\n\nwww.comedy.co.uk Review: \n[quote]There were lulls in the pilot, however Flanagan did also have some good material to deliver.\n\nThere is now a full series on the way in which, once again, Flanagan will be talking about the transition from a fish market labourer from the East End, to a stand-up living in comfortable East Dulwich.[/quote]\n\n\nCast:\nMicky Flanagan\n\n\n\nMicky Flanagan - What Chance Change - S01 - E01 - 1970s\nMicky Flanagan - What Chance Change - S01 - E02 - 1980s\nMicky Flanagan - What Chance Change - S01 - E03 - 1990s\nMicky Flanagan - What Chance Change - S01 - E04 - 2000s\n\n\nAudio Format    : MP3\nDuration        : 28mn 1s\nBit rate mode   : Constant\nBit rate        : 128 Kbps\nChannel(s)      : 2 channels\nSampling rate   : 44.1 KHz\nResolution      : 16 bits\n\n\n[","torrent":{"xt":"urn:btih:62c4d8621faabe6763f2e11ad03c9b47a01a5076","amp;dn":"Micky+Flanagan+-+What+Chance+Change+-+S01+-+Audio+Comedy+-+MP3+-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62c4d8621faabe6763f2e11ad03c9b47a01a5076","infoHashBuffer":{"type":"Buffer","data":[98,196,216,98,31,170,190,103,99,242,225,26,208,60,155,71,160,26,80,118]},"announce":[],"urlList":[]}}