{"title":"Librivox M4B Audiobook - Knyght Ther Was  by Robert F. Young","uid":5521000,"size":58952296,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:62d14850fac2811932edc6de60914721e9eecc6e&amp;dn=Librivox+M4B+Audiobook+-+Knyght+Ther+Was++by+Robert+F.+Young&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"VoxRatio","files":-1,"time":1272624083,"description":"&quot;But the Knyght was a little less than perfect, and his horse did not have a metabolism, and his 'castle' was much more mobile - timewise! - than it had any business being!&quot; In 2178, once time travel had become a simple task, it had also been outlawed. Those who chose to ingnore this law were known as time-thieves, and Tom Mallory was among the best of them. When he learns the precise whereabouts of the Holy Grail in 542, he sets out to obtain it with the intention of returning it to the 22nd century to make a handsome profit and to settle on Get-Rich-Quick Street. Off to the year 542 he travels to the castle of Carbonek where the great Knight Sir Launcelot is said to have possession of the Sangraal. (Summary by Roger Melin with quote from Analog Science Fact &amp; Fiction July 1963)\n\n\nAn M4B file is an audio file which can be bookmarked. This is the audio-book file type. These files can have chapter markers which can be skipped through as you would skip through files on a play list. They can have built in cover art and chapter images. They will remember where you left off each time you stop the file and come back to it . And variable speed settings on Ipods and a growing number of other mp3 players can be utilized by this file type. The ability to bookmark allows for as little as one large file instead of many small ones without the burden of fast forwarding to find your spot every time you resume listening or the fear of otherwise losing your place. The reduced number of files also makes browsing through your files to find your book and your place in it much less effort.\n","torrent":{"xt":"urn:btih:62d14850fac2811932edc6de60914721e9eecc6e","amp;dn":"Librivox+M4B+Audiobook+-+Knyght+Ther+Was++by+Robert+F.+Young","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62d14850fac2811932edc6de60914721e9eecc6e","infoHashBuffer":{"type":"Buffer","data":[98,209,72,80,250,194,129,25,50,237,198,222,96,145,71,33,233,238,204,110]},"announce":[],"urlList":[]}}