{"title":"Pro Evolution Soccer 2009 - PES SMoKE Patch 1.8","uid":5522306,"size":1039141375,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:644bef871f01af0cf2cdac5bfb949d5ead443835&amp;dn=Pro+Evolution+Soccer+2009+-+PES+SMoKE+Patch+1.8&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Dido_SMK","files":14,"time":1272647774,"description":"Pro Evolution Soccer 2009 - PES SMoKE Patch 1.8\n\n----------------------------------------------------------------------------------\n\nSome of the features:\n\n- A lot of new clubs and national teams with correct kits.\n- Champions league teams done for the new season.\n- Bundesliga replaces Eredivisie.\n- Major six Eredivisie teams moved to Other Leagues A.\n- Relegated teams replaced by Promoted ones in all leagues 2009-2010 season.\n- 172 overall Clubs, 84 overall national teams.\n- New faces, balls, boots, stadiums, replay, scoreboard, referee and banners.\n- New Chants for 23 teams.\n- GDB correct updated kits for all teams.\n- Teams formation and starting lineups are up to date. (5 september 2009)\n- Most national teams are updated according latest national matches.\n- All summer transfers (5 september 2009)\n- Hundreds of new players.\n- Revised player stats (Based on recent and accurate results, not overrated gameplay).\n- No duplicated players or names including ML hidden players.\n- Correct names for everything.\n- Trainers are famous classic players like (Guardiola, Maradona, Van bastin, ...)\n- And much much more...\n\n----------------------------------------------------------------------------------\n\n- National Teams in Game (84): \n\nAustria, Belgium, Bulgaria, Croatia, Czech, Denmark, England, Finland, France, Germany, Greece, Hungary, Ireland, Belarus, Italy, Netherlands, Northern Ireland, Norway, Poland, Portugal, Romania, Russia, Scotland, Serbia, Slovakia, Slovenia, Spain, Sweden, Switzerland, Turkey, Ukraine, Wales, Cameroon, Cote D'Ivoire, Egypt, Ghana, Nigeria, Senegal, South Africa, Tunisia, Canada, Costa Rica, Mexico, United States, Argentina, Brazil, Chile, Colombia, Ecuador, Paraguay, Peru, Uruguay, Australia, China, Iran, Japan, Saudi Arabia, South Korea, Thailand, UAE, Angola, Guinea, Mali, Morocco, Honduras, Trinidad and Tobago, Bolivia, Venezuela, Bahrain, Iraq, Kuwait, North Korea, Oman, Qatar, Syria, Uzbekistan, Albania, Georgia, Montenegro, Togo, Algeria, Super Classic Europe, Super Classic America.\n\n\n- Clubs in Game (172): \n\nArsenal, Aston Villa, Blackburn Rovers, Bolton Wanderers, Chelsea, Everton, Fulham, Hull City, Liverpool, Manchester City, Manchester United, Birmingham City, Burnley, Newcastle, Portsmouth, Stoke City, Sunderland, Tottenham Hotspur, Wolverhampton, West Ham United, Wigan Athletic, Auxerre, Girondins de Bordeaux, Boulogne, Grenoble Foot 38, RC Lens, LE Mans Union Club 72, Losc Lille MÃƒÂ©tropole, FC Lorient Bretagne , Olympique Lyonnais, Olympique de Marseille, AS Monaco FC, AS Nancy Lorraine, Montpellier, OGC Nice, Paris Saint-Germain, Stade Rennais, Saint-Etienne, Sochaux, Toulouse, Valenciennes, Atalanta, Bologna, Cagliari Calcio, Calcio Catania, Chievo Verona, Fiorentina, Genoa, Inter Milan, Juventus, Lazio, AC Milan, Napoli, Palermo, Roma, Sampdoria, Siena, Udinese Calcio, Bari, Livorno, Parma, Tenerife, Mainz 05, Bayer Leverkusen, Bayern MÃƒÂ¼nchen, Bochum, Energie Cottbus, Freiburg, Borussia Dortmund, Eintracht Frankfurt, Hamburger, Hannover, Hertha Berlin, 1899 Hoffenheim, NÃƒÂ¼rnberg, Koln, Borussia M'Gladbach, Schalke 04, Stuttgart, Werder Bremen, Wolfsburg, Almeria, Athletic Bilbao, Barcelona, Deportivo LA CoruÃƒÂ±a, Espanyol, Getafe, Sporting Gijon, Atletico Madrid, Real Madrid, Malaga, Mallorca, Numancia, Osasuna, Racing Santander, Sevilla, Valencia, Real Valladolid, Villarreal, Real Zaragosa, Xerez, Anderlecht, Club Brugge KV, Twente, Dinamo Zagreb, Ajax, AZ Alkmaar, Feyenoord, Eindhoven, Olympiacos, Panathinaikos, A.E.K. Athens, PAOK, SL Benfica, Porto, Sporting Club Lisbon, Steaua Bucuresti, Cluj, Spartak Moscow, Zenit, Celtic, Rangers, Bate Borisov, Slavia Praha, Maccabi haifa, Hammarby IF, ZÃƒÂ¼rich, Besiktas JK, FenerbahÃƒÂ§e, Galatasaray, Shakhtar Donetsk, Dynamo Kyiv, Rubin Kazan, Unirea Urzice, Aalborg BK, Anorthosis, SC Internacional, River Plate, Boca Juniors, Cruzeiro, Palmeras, Sao Paulo, Flamengo, Penarol, Estudiantes, Independiente, FK Partizan, Crvena Zvezda, EspÃƒÂ©rance de Tunis, Wisla Krakow, Legia Warszawa, Lech Poznan, CSKA Moscow, Standard de LiÃƒÂ¨ge, Al Ahly, Etoile du Sahel, Zamalek SC, BrÃƒÂ¸ndby IF, Aberdeen, Al Ittihad Jeddah, Club Africain, Al Hilal Riyadh, Copenhagen, Debreczyn, APOEL, Wydad Casablanca, Raja Casablanca, Liga de Quito, Colo Colo, LA Galaxy, Seattle Sounders, HJK Helsinki, Rosenborg, Seoul.\n\n---------------------------------------------------------------------------------\n\nInstallation (ON A NEW COPY OF PES):\n**all steps are required**\n\n\n1. Decompress the file (extract only one part, all parts will be be extracted in the same destination)\n\n2. Copy (PES2009_EDIT01.bin) from the save folder in the patch to the SAVE folder of the game, should be (C:Documents and SettingsUSERMy DocumentsKONAMIPro Evolution Soccer 2009save), replace old file if it asks.\n\n3. Backup then Replace (pes2009.exe) and (settings.exe) with the ones from the patch.\n\n4. Copy the kitserver folder in the Pro Evolution Soccer 2009 installation folder, should be: (C:Program FilesKONAMIPro Evolution Soccer 2009), then open the kitserver folder and run (setup.exe) then click install, then close.\n\n\nP.S.: Directories are the ones by default installation, if you have changed the defaults use your directories.\n\nP.S.: If you are already using previous smoke patch, just delete the old kitserver BEFORE copying the new one, reinstalling thwe game is not required.\n\n----------------------------------------------------------------------------------\n\nchange log:\n\n\nPES SMoKE Patch 1.8 (full):\n\n- Updated transfers\n- Updated faces\n- Updated kits\n\n\nPES SMoKE Patch 1.7.6 (update only)\n\n- Updated transfers (10.march.2010)\n\n\nPES SMoKE Patch 1.7.5 (full):\n\n- finished transfers.\n- fixed the kits links.\n- updated some kits.\n- new old trafford stadium.\n- added burnley new emblem.\n- added lega calcio new league emblem. \n- added new chants for (Manchester United, Inter milan, Juventus, AC Milan, Celtic)\n- optimized chants files for faster audio loading.\n- corrected some errors in stats.\n- corrected some radar colors.\n- fixed Brondby kits shirt font.\n- some minor fixes.\n- included Eredivisie and Championship extensions.\n\n\nPES SMoKE Patch 1.7 (full):\n\n- Updated transfers (lots of new players created)\n- Redone a new option file from scratch.\n- Redone all players in clubs\n- Fixed the 2pts market value for some players in ML and BAL modes.\n- Fixed classic players appearing in ML and BAL modes even if not selected.\n- Updated Faces\n- Some tweaks and fixes\n- A lot of kits updates\n- Created new teams for CL (FC ZÃƒÂ¼rich, Rubin Kazan, Unirea Urziceni, APOEL, Debreczyn, Maccabi haifa)\n- Added special chants for 3 teams (Blackburn, Stock city, Wigan Athletic)\n- Added 2 new optional replay logos (for exhebition mode).\n- Added 6 new optional scoreboards.\n\n\nChange Log 1.6.1 (update only):\n\n- Updated transfers\n- Fixed a lot of crashes.\n- Replaced some duplicated players.\n- Fixed bundesliga menu flag in league mode.\n- D1 cup instead of FA cup in ML and BAL modes.\n- Corrected some other in-ML competetion names.\n- Fixed Banners link file (unnamed_9.bin).\n- Faster game loading.\n- Fixed some players states.\n- Fixed defected noise in one of bayern chants.\n- Added new faces.\n- Added Optional flags for national teams (replaces emblems)\n\n\nPES SMoKE Patch 1.6 (full):\n\n- Replaced classic teams with (Albania, Georgia, Montenegro, Togo, Algeria, Super Classic Europe, Super Classic America)\n- Promoted teams replaced Relegated ones.\n- Fixed Wrong replay logos.\n- Fixed boots preview.\n- Updated faces, formations, kits.\n- Added 400 various players from all over the world.\n- Trainers are famous classic players like (Guardiola, Maradona, Van bastin, ...)\n- Uniformed style for all emblems.\n- New banners (re-linked and updated).\n- Added 20 Chants (High quality and well integrated with the general atmosphere).\n- Revised and updated player stats.\n- More variable growth types for new comers players (BAL and ML)\n- Overall enhanced game experience (BAL and ML)\n- New glass scoreboard.\n- Nike Total 90 Omni EPL ball is back.\n- Corrected some teams radar colors.\n- Added Optional Championship Extension.\n- All latest transfers (20 June 2009)\n- Included WS scoreboard fix\n\n\nPES SMoKE Patch 1.5.1 (update only):\n\n- Fixed crash caused when playing against/with Athletic Bilbao, Angola.\n- Updated some faces.\n- Fixed some player names.\n- Fixed Colombia home kit.\n\n\nPES SMoKE Patch 1.5 (full):\n\n- Included the NOCD cracked exe\n- Multi language Support (English, Spanish, Germany, Portugues, French, italian)\n- Frensh league replaces championship.\n- some of championship teams moved to others.\n- New teams with kits (Sao paulo, Flamengo, Standard de liege, Zamalek, Al Ahly, CSKA Moscow, Cruzeiro, Copenhagen, Etoile Sportive, EspÃƒÂ©rance de Tunis, Club Africain, Lech Poznan, Penarol, Crvena, Partizan, Rosenborg, Liga de Quito, Colo colo, Wisla Krakow, Legia Warszawa, LA Galaxy, Seattle Sounders, Al Ittihad Jeddah, Al Hilal Riyadh, Brondby IF, PAOK FC, Estudiantes LP, CA Independiente, Raja Casablanca, Wydad Casablanca, Aberdeen FC, FC Seoul)\n- New stadiums (NAMED BINS in cv09.img)\n- New faces (All Face Slots are used).\n- Updated faces and kits.\n- New Boots\n- Lots of new players.\n- New replay logos (SMoKE Patch Replay only in exhibition mode).\n- New Scoreboard.\n- Fixed Everton and manCity Goalkeepers kits bug\n- Minor fixes (player rating, coverage on the field was all white, ...)\n\n\nPES SMoKE Patch 1.4 (full):\n\n- Created 140 missing players.\n- Created 15 new players, (pocheco, nemeth, botia, nolito, ...)\n- a lot of forgotten transfers.\n- Added 150 new faces.\n- Updated kits.\n- Corrected some national team player names, (morocco, iraq, venezuela, ...)\n- Added new ball, (Adidas Europass Eurocopa)\n- Fixed cameroon kits. (was tansparent)\n- Corrected teams player number.\n- Updated formations and starting IX (based on last 10 to 15 matches played)\n- Some minor fixes. (ZN in place of AMF, ...)\n\n\nPES SMoKE Patch 1.3 (not released):\n\n- fixed stadium bug, (caused by some kinds of graphic cards)\n- Added team (Real Zaragoza).\n\n\nPES SMoKE Patch 1.2 (full):\n\n- added more than 300 new faces.\n- fixed the balls names and preview balls.\n- fixed in game ball curser (replaced the original with a nice small circle curser).\n- updated kits.\n- fixed faces links\n- Real names for hidden players\n- created missing players\n- minor fixes\n\n\nPES SMoKE Patch 1.1 (not released):\n\n- optimized some graphics so the game can load faster for low end PCs\n- fixed BAL mode crash when playing international games.\n\n----------------------------------------------------------------------------------\n\nFor comments and assistance, contact (&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;0c787f6f6f696278697e4c756d646363226f6361&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;)\nNews at main website: pes-smoke-patch. blo gspot . com","torrent":{"xt":"urn:btih:644bef871f01af0cf2cdac5bfb949d5ead443835","amp;dn":"Pro+Evolution+Soccer+2009+-+PES+SMoKE+Patch+1.8","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"644bef871f01af0cf2cdac5bfb949d5ead443835","infoHashBuffer":{"type":"Buffer","data":[100,75,239,135,31,1,175,12,242,205,172,91,251,148,157,94,173,68,56,53]},"announce":[],"urlList":[]}}