{"title":"Josh Turner - Why Don't We Just Dance (2nafish)","uid":5470493,"size":127094788,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:649f3f61ff217269572951ea558ffffe17cd0241&amp;dn=Josh+Turner+-+Why+Don%5C%27t+We+Just+Dance+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1269823129,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Why Don't We Just Dance&quot; is the title of a song written by Jim Beavers, Jonathan Singleton, and Darrell Brown, and recorded by American country artist Josh Turner. It was released in August 2009 as the lead-off single to his fourth studio album, Haywire, which was released on February 9, 2010. The song became Turner's third Number One hit in February 2010, his first since &quot;Would You Go With Me&quot; in October 2006, and his longest stay at the top with four weeks. Additionally, it became his first single to reach Number One on the Canadian Radio &amp; Records Country Singles chart.\n\nThe music video, which was directed by Deaton-Flanigen Productions, premiered on GAC's Monday Music Mania on October 5, 2009 and on CMT on October 8, 2009. Turner is shown inside a house, observing a couple (played by real-life couple Ciaran McCarthy and Ashley Anderson) dancing in the living room. Throughout the video, the couple changes clothes and dancing styles, showcasing different decades beginning with the 1950s through present day. According to Country Weekly magazine, Turner was &quot;elated to discover that he wouldn't have to do any acting&quot; in the video.\n\nThe video was ranked #39 on GAC's Top 50 Videos of the Year.\n\n&quot;Why Don't We Just Dance&quot; is a moderate up-tempo, featuring a production with piano, steel guitar fills, and fiddle. The song's narrator suggests to his lover that they dance in the living room to forget each other's troubles.\n\nTurner said the song, which was written by Jim Beavers, Jonathan Singleton, and Darrell Brown, caught his attention the first listen. &quot;It's an up-tempo, traditional country song that has a very catchy melody with a lyric that poses the question 'why don't we just dance?' and forget about all of the bad stuff going on the world and just concentrate on each other.&quot;\n\n&quot;Why Don't We Just Dance&quot; debuted at #57 on the U.S. Billboard Hot Country Songs chart for the week of September 5, 2009. On the week ending November 28, 2009, it also debuted at #99 on the U.S. Billboard Hot 100. In January 2010, it became his first Top 10 single since &quot;Firecracker&quot; reached #2 in 2007. On the chart week of February 20, 2010, it became his third Number One song and his first since &quot;Would You Go with Me&quot; in October 2006. It also debuted at #97 on the Canadian Hot 100 chart for the week of February 20, 2010. It became his first Number One hit on the Canadian Radio &amp; Records  Country Singles chart for the week of March 19, 2010.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:649f3f61ff217269572951ea558ffffe17cd0241","amp;dn":"Josh+Turner+-+Why+Don%5C%27t+We+Just+Dance+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"649f3f61ff217269572951ea558ffffe17cd0241","infoHashBuffer":{"type":"Buffer","data":[100,159,63,97,255,33,114,105,87,41,81,234,85,143,255,254,23,205,2,65]},"announce":[],"urlList":[]}}