{"title":"Alice Cooper - Public Animal No.9 (Beat Club) (2nafish)","uid":5637288,"size":203722756,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:65b35869bf33c3b0e30dfa078c41df2172a4a84d&amp;dn=Alice+Cooper+-+Public+Animal+No.9+%28Beat+Club%29+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1276940226,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nAlice Cooper - Public Animal No.9 (Live-Beat Club) (2nafish)\n\n\nSchool's Out is an album released by Alice Cooper in 1972. The album's title track has remained a staple song in Alice Cooper's live setlist and receives regular airplay on many &quot;Classic Rock&quot; radio stations.\n\nThe original album cover (designed by Craig Braun had the sleeve opening in the manner of an old school desk. The vinyl record inside was wrapped in a pair of girl's panties. This original issue was recalled because the panties were not flame-retardant. The album was remastered in 2009 for Audio Fidelity by Steve &quot;Daddy Tonemeister&quot; Hoffman in HDCD.\n\nAlice Cooper (born Vincent Damon Furnier; February 4, 1948) is an American rock singer, songwriter and broadcaster whose career spans more than five decades. With a stage show that features guillotines, electric chairs, fake blood, boa constrictors and baby dolls, Cooper has drawn equally from horror movies, vaudeville, and garage rock to pioneer a grandly theatrical and violent brand of heavy metal that was designed to shock.\n\nAlice Cooper was originally a band consisting of Furnier on vocals and harmonica, lead guitarist Glen Buxton, Michael Bruce on rhythm guitar, Dennis Dunaway on bass guitar, and drummer Neal Smith. The original Alice Cooper band broke into the international music mainstream with the 1971 hit &quot;I'm Eighteen&quot; from the album Love it to Death, which was followed by the even bigger single &quot;School's Out&quot; in 1972. The band reached their commercial peak with the 1973 album Billion Dollar Babies.\n\nFurnier's solo career as Alice Cooper, adopting the band's name as his own name, began with the 1975 concept album Welcome to My Nightmare. In 2008 he released Along Came a Spider, his 18th solo album. Expanding from his original Detroit rock roots, over the years Cooper has experimented with many different musical styles, including conceptual rock, art rock, glam metal, hard rock, new wave, pop rock, soft rock, experimental rock, heavy metal, and industrial rock. In recent times he has returned more to his garage rock roots.\n\nAlice Cooper is known for his social and witty persona offstage, The Rolling Stone Album Guide going so far as to refer to him as the world's most &quot;beloved heavy metal entertainer&quot;. He helped to shape the sound and look of heavy metal, and has been credited as being the person who &quot;first introduced horror imagery to rock'n'roll, and whose stagecraft and showmanship have permanently transformed the genre&quot;. Away from music, Cooper is a film actor, a golfing celebrity, a restaurateur and, since 2004, a popular radio DJ with his classic rock show Nights with Alice Cooper.\n\nOn VH1's &quot;100 Greatest artists of Hard Rock&quot;, Cooper was ranked #20\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:65b35869bf33c3b0e30dfa078c41df2172a4a84d","amp;dn":"Alice+Cooper+-+Public+Animal+No.9+%28Beat+Club%29+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65b35869bf33c3b0e30dfa078c41df2172a4a84d","infoHashBuffer":{"type":"Buffer","data":[101,179,88,105,191,51,195,176,227,13,250,7,140,65,223,33,114,164,168,77]},"announce":[],"urlList":[]}}