{"title":"The Messenger (2009) (Retail) (NTSC) (DD5.1) Eng + Cust.NL","uid":5519709,"size":4645511750,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:661858e0adb7ebf44274405d1eb063fb177aee0f&amp;dn=The+Messenger+%282009%29+%28Retail%29+%28NTSC%29+%28DD5.1%29+Eng+%2B+Cust.NL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"NLUPPER","files":-1,"time":1272499211,"description":"\nThe Messenger (2009)(Retail)(NTSC)(DD5.1) Eng + Cust.NL\n\n\n\nPLOT\n\nWhile on a recent deployment to Iraq, US Army Staff Sergeant Will Montgomery is injured when an improvised explosive device goes off within close proximity to him. He is back in the States recovering from the more serious of those injuries, including one to his eye and leg. He has resumed a sexual relationship with his long time girlfriend Kelly, despite the fact that she is now engaged to another man who Will knows. With the few months Will has left in his enlistment, the army assigns him to the Casualty Notification Team in his area. Not having a background in counseling, psychology or grief management, he is unsure if he is well suited to this job. He is partnered with a career soldier, Captain Tony Stone, who teaches Will the precise protocol involved in the job. Tony tells Will, who quickly learns by on the job experience, that this job has its own dangers. As Will learns to adapt to the range of emotions of the next of kin, he is unprepared for the reaction of Olivia Pitterson, whose husband was killed in Iraq. His initial encounter with Olivia leads to him wanting to get to know her better, which may not be in either her or his best interest. Despite being a recovering alcoholic, the more experienced Tony tries to guide Will as best he can under their collective circumstances.  \n\n\n\n\nVerenigde Staten\nDrama / Oorlog\n107 minuten\n\ngeregisseerd door Oren Moverman\nmet Ben Foster, Woody Harrelson en Samantha Morton\n\n\n\n\nWill Montgomery (Foster) heeft nog maar drie maanden te gaan, om zijn dienst,\nals de Amerikaanse arts van de legerziekenhuizen in Irak, af te ronden. Het meisje,\nKelly (Malone), dat Will heeft achtergelaten in Amerika, heeft besloten verder te gaan\nmet haar leven. Hierdoor wordt Will geobsedeerd en wil hij, als militair, een nieuwe start\nin zijn leven maken. Hij ontmoet militair Anthony 'Tony' Stone (Harrelson). Tony leert Will alles\nover zijn beroep en nieuwe werktaak op het 'Casualty Notification' bureau. Will, die ternauwernood\nontsnapte aan de dood, zal nu het nieuws moeten brengen over degene die het niet hebben gered.\nTussen hun opdrachten door, krijgen deze twee militairen een unieke band die hen in hun strijd helpt,\nom zo terug te keren naar hun normale leven, wetende dat niet alles normaal meer kan worden.\n\nINFO\n\nRelease Name: The.Messenger.LIMITED.DVDR-MPTDVD\nSource: R1 NTSC DVD9\nVideo: Movie: Untouched, Credits: 6-pass CCE\nAudio: English Dolby Digital 5.1\nMenu: Yes\nExtras: Stripped\nSubs: English, Dutch by Stardance\nBewerking: Sendleech\n\nMM:   &lt;a href=&quot; http://www.moviemeter.nl/film/54839&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.moviemeter.nl/film/54839&lt;/a&gt;\n\nIMDB:   &lt;a href=&quot; http://www.imdb.com/title/tt0790712/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0790712/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:661858e0adb7ebf44274405d1eb063fb177aee0f","amp;dn":"The+Messenger+%282009%29+%28Retail%29+%28NTSC%29+%28DD5.1%29+Eng+%2B+Cust.NL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"661858e0adb7ebf44274405d1eb063fb177aee0f","infoHashBuffer":{"type":"Buffer","data":[102,24,88,224,173,183,235,244,66,116,64,93,30,176,99,251,23,122,238,15]},"announce":[],"urlList":[]}}