{"title":"The Arnelo Affair (1947) John Hodiak Eng","uid":5550165,"size":767525694,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:664c1721ed5145f5441f659ccb6064c3f795371a&amp;dn=The+Arnelo+Affair+%281947%29+John+Hodiak+Eng&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"johnefp","files":3,"time":1273513065,"description":"On the whole, the films of producer-writer-director Arch Oboler seldom came up to the lofty standards of his radio work, but each of his movie projects had a few meritorious moments. One of the better Oboler  film efforts was The Arnelo Affair, produced by MGM in 1946. Frances Gifford delivers what may be her best performance as Anne Parkson, the loving but neglected wife of busy Chicago attorney Ted Parkson (George Murphy). Upon meeting one of Ted's clients, shady nightclub owner Tony Arnelo (John Hodiak), Anne finds herself inexorably drawn to the charismatic Arnelo. He in turn is equally fascinated by Anne, but his fascination deepens into love. Upon realizing that Arnelo is essentially a cold-blooded thug, Anne tries to break off their relationship. But Arnelo has murdered his cast-off mistress Claire Lorrison (Joan Woodbury), and has arranged the evidence so as to implicate Anne in the killing. To Arnelo's way of thinking, if he can't have Ann, no one can-certainly not her scrupulously honest husband, who has gone on record insisting that he'd prosecute any criminal to the fullest extent of the law, even if that criminal was a friend or relative. Told in Arch Oboler's traditional stream-of-consciousness manner, the story comes to a violent but logical conclusion when Arnelo exhumes his own long-suppressed sense of decency. Despite competition from the three stars, and from such reliable supporting players as Eve Arden and Dean Stockwell, The Arnelo Affair is stolen by Warner Anderson as a soft-spoken, philosophical Chicago detective. \n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0039160/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0039160/&lt;/a&gt;\n\n\n\n[Movie]\nValid : Yes [AVI]\nDuration : 01:27:16\nMovie complete : Yes\n\n[Video]\nResolution : 720x544 4:3\nCodec : DivX (4 / 5 / 6)\nFPS : 23,98\nBitRate : 1045 Kbps\nQuality Factor : 0,11 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 128 Kbps\n\n\n\nPlease seed at least as much as you D/L.\n=======================================\nThanks \n\nJohn\n\n\n\n","torrent":{"xt":"urn:btih:664c1721ed5145f5441f659ccb6064c3f795371a","amp;dn":"The+Arnelo+Affair+%281947%29+John+Hodiak+Eng","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"664c1721ed5145f5441f659ccb6064c3f795371a","infoHashBuffer":{"type":"Buffer","data":[102,76,23,33,237,81,69,245,68,31,101,156,203,96,100,195,247,149,55,26]},"announce":[],"urlList":[]}}