{"title":"Swingers Series 2012 New Sensations","uid":8860976,"size":2156841147,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:6711d996b18803f155145ee9e459941665717567&amp;dn=Swingers+Series+2012+New+Sensations&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"grighta","files":5,"time":1377772788,"description":"New Sensations' Swingers series was nominated for Couples-Themed Line of the Year at the 2013 XBIZ Awards\n\nNot much of a series, with two movies, but we can only hope there's more, perhaps by different writer/directors.\n\nFriends With Benefits - http://www.adultfilmdatabase.com/video.cfm?videoid=100041\n\nWritten by Raven Touchstone, Friends With Benefits explores the relationship between recently single coworkers, Alex (Pistol) and Jessica (Lee), who pose as a couple in order to attend a swingers' party. Surrounded by a group of people with no sexual limitations, Alex and Jessica's own inhibitions begin to dissolve giving way to a sexual freedom they never thought possible. But, when the two begin developing feelings for one another beyond platonic friendship, they are confronted with the ultimate dilemma - can they handle the lifestyle now that their emotions are suddenly involved?\n\nShared Wives - http://www.adultfilmdatabase.com/video.cfm?videoid=98007\n\nShared Wives, is the story of two married women whose sex lives have hit a lull. Hoping to add a little spice to their bedroom, they convince their reluctant husbands to swap wives for a night. But, when a Pandora's box of steamy desires and forbidden secrets are unleashed, what they initially thought was a brilliant idea, ends up threatening to destroy the very foundation of their marriages. Will a night of sexual exploration bring the couples closer together or will it ultimately tear them apart? \n\nThe film is the creation of the critically acclaimed, award winning team, Screenwriter, Raven Touchstone and Director, Paul Thomas. \n\nAs of late, the lifestyle has grown in popularity among heterosexual couples, making this film both relevant and thought provoking. &quot;Modern day relationships are slowly evolving away from traditional practices. People are beginning to push the limits of their own desires and sexually progressive relationships are becoming more commonplace,&quot; says Scott Taylor, President of New Sensations.","torrent":{"xt":"urn:btih:6711d996b18803f155145ee9e459941665717567","amp;dn":"Swingers+Series+2012+New+Sensations","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6711d996b18803f155145ee9e459941665717567","infoHashBuffer":{"type":"Buffer","data":[103,17,217,150,177,136,3,241,85,20,94,233,228,89,148,22,101,113,117,103]},"announce":[],"urlList":[]}}