{"title":"Brian Johnson &amp; Geordie II (Live In  Newcastle, U.K 28.09.2001)","uid":5632390,"size":1071354106,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:6bd5f7eeb84cebd0f9a827b41bfb430087ec5d7f&amp;dn=Brian+Johnson+%26+Geordie+II+%28Live+In++Newcastle%2C+U.K+28.09.2001%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Iron_Horse","files":2,"time":1276734397,"description":"Brian Johnson &amp; Geordie II (Live In  Newcastle, U.K 28.09.2001)\n\nDate: 28.09.2001\nPlace: Newcastle Opera House, U.K.\nQality: VG Audince Recording.\nLenght: 01:42:26\nVideo: MPEG1 Video 352x288 (4:3) 25.00fps 1150Kbps [Video]\nAudio: MPEG Audio 44100Hz stereo 224Kbps [Audio]\n\nGeordie   From Wikipedia, the free encyclopedia\nGeordie (jaw-dee) were a rock  band from Newcastle upon Tyne, England, most notably active in the 1970s.\n\nHistory\nThe original (from February, 1972) line-up included: Vic Malcolm (born Albert Victor Malcolm, 3 December 1946, Newcastle upon Tyne) (lead guitar, vocals), Tom Hill (bass guitar), Brian Gibson (drums) (born 6 March 1951, Newcastle upon Tyne) and Brian Johnson (vocals). Geordierockbandcom\n\nTheir first single, &quot;Don't Do That&quot; broke into the UK Top 40 in December 1972. In March 1973, Geordie released their debut album, Hope You Like It on EMI's Regal Zonophone label. Trying to compete with such British glam rock outfits as Slade and Sweet (Geordie supported the former on a UK tour, as well as the latter at a concert at the Rainbow Club, London in March 1973), they had several UK Top 10 hit, &quot;All Because Of You&quot; (April 1973) and several UK Top 20 hit, &quot;Can You Do It&quot; (July 1973) and several appearances on BBC Television including Top of the Pops in November 1972. But their second album, Don't Be Fooled By The Name (1974), including a cover of The Animals' &quot;House Of The Rising Sun&quot; failed to yield a hit. After their 1976 album Save The World, frontman Johnson left for a solo project. The band's final album, No Good Woman, in 1978 consisted of three unreleased tracks with Johnson and new material recorded by Malcolm with future Dire Straits keyboardist Alan Clark, vocalist Dave Ditchburn, bassist Frank Gibbon, and drummer George Defty. Johnson had meanwhile begun to perform as Geordie in a new line-up in which he was the only original member. The band signed a recording contract in 1980, but finally folded that spring when Johnson became a member of AC/DC to replace the late Bon Scott.\n\nPost break-up\nAfter AC/DC's lead singer Bon Scott died in February 1980, AC/DC chose Brian Johnson (whose vocal talent had previously been praised by Scott) to take over lead vocal duties. Johnson first appeared with AC/DC on their album, Back In Black.\n\nIn 1982, the original Geordie, but without Johnson, re-grouped as a quintet and went on to record an album titled No Sweat in 1983 with new singer 'Doctor' Rob Turnbull and additional guitarist David Stephenson. The album released on heavy metal independent record label, Neat, but had no major success. Malcolm left, and they later changed their name to Powerhouse, to release an eponymous album in 1986, before disbanding indefinitely.\n\nAt the end of 2001, during an AC/DC hiatus, Johnson had a one off reunion, for a short British tour, with Geordie's 1977-1980 line-up, performing largely hard rock cover versions.\n\nSet List:\nIntro (Local Comedian Brendon Healey)\nLady (Put The Light On Me) (Brownsville Station)\nWe Gotta Get Out Of This Place (Animals)\nSince You Been Gone (Rainbow)\nGeordies Lost His Liggie (Geordie) (Inc. What Do You Get When You Drink Brown Ale &amp; The Runaway Train Went Over The Hill)\nThis Flight Tonight ( Nazereth)\nBlaydon Races (Traditional)\nBring It On Home To Me (Animals)\nHold The Line (Toto)\nRockin' With The Boys (Geordie)\nBlack Dog / Rock &amp; Roll (Led zeppelin)\nSecond Intro (Stars Of Auf Wiedersein Pet)\nDoctor Doctor (Bad Case Of Loving You) (Robert Palmer)\nWarming Up The Band (Head Hands &amp; Feet)\nDon't Let Me Be Misunderstoood (Animals)\nFeels Like The First Time (Foreigner)\nDanny Boy (Instrumental) (Traditional)\nWrong Side Of The Law (Unrecorded Geordie Track)\nCan You Do It / All Because Of You (Geordie)\n(Brian Falls off stage!)\n2-4-6-8 MOTORWAY (Tom Robinson)\nBe Good To Yourself (Frankie Miller)\nWhole Lotta Rosie (AC/DC)\n------Encore------(Unexpected)\nWe Gotta Get Out Of This Place (Animals)\n\nSee my other Torrents: &lt;a href=&quot; http://thepiratebay.se/user/Iron_Horse/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/user/Iron_Horse/&lt;/a&gt;","torrent":{"xt":"urn:btih:6bd5f7eeb84cebd0f9a827b41bfb430087ec5d7f","amp;dn":"Brian+Johnson+%26+Geordie+II+%28Live+In++Newcastle%2C+U.K+28.09.2001%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6bd5f7eeb84cebd0f9a827b41bfb430087ec5d7f","infoHashBuffer":{"type":"Buffer","data":[107,213,247,238,184,76,235,208,249,168,39,180,27,251,67,0,135,236,93,127]},"announce":[],"urlList":[]}}