{"title":"The.Ass.Party.4.Disc2.XXX.DVDRiP.x264-PORNOLATiON","uid":8720204,"size":1293319025,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:6bfc121b64bca82efbf656a4825e9f47fdd02310&amp;dn=The.Ass.Party.4.Disc2.XXX.DVDRiP.x264-PORNOLATiON&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":-1,"time":1374366175,"description":"Director Joey Silvera and his cast of gorgeous girls don't need a special reason to celebrate not when threes so much ass to go around! Joeys latest double-disc buttfest, is fully stuffed with five epic scenes of intense, exciting butt play that goes on til the crack of dawn! Blonde booty queens Ashley Fires and Sheena Shaw ream each other with nasty anal toys and lewdly ride a face-mounted dildo until muscular stud Christian kicks the party into high gear with his big dick. Sheena and Ashley worship his throbbing pole, indulging in inventive face sitting and rectal games until Christian feeds them his creamy load. Pale, sexy redhead Claire Robbins enjoys a wild round of interracial revelry with Prince Yahshua's massive black cock, thanks to the guiding hands and strap-on dildo of severe blonde mistress Rain DeGrey. Both ladies get ruthlessly butt-fucked and savor the fragrant flavor of ass. Beautiful brunette Casey Calvert, wearing a short plaid skirt and sheer stockings, gets her perfect, all-natural body ravished by Christians hard shaft, vibrating wands, toys, and even an anal speculum. A gooey oral cum shot is the icing on the cake. Frisky cuties AJ Applegate and Lea Lexis eat ass ferociously. Blonde Jessica Nyx gets a mouthful and an assful of big black cock. Topped with 40 minutes of revealing interviews and behind-the-scenes footage, threes no butt bash like this. Are you an ass lover? Consider yourself invited!\n\n Ashley Fires,Claire Robbins,Lea Lexis,Sheena Shaw,A.J. Applegate,Jessica Nyx,Casey Calvert,Raine Degrey\n\n\n//bayimg.com/laNnKaAEn","torrent":{"xt":"urn:btih:6bfc121b64bca82efbf656a4825e9f47fdd02310","amp;dn":"The.Ass.Party.4.Disc2.XXX.DVDRiP.x264-PORNOLATiON","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6bfc121b64bca82efbf656a4825e9f47fdd02310","infoHashBuffer":{"type":"Buffer","data":[107,252,18,27,100,188,168,46,251,246,86,164,130,94,159,71,253,208,35,16]},"announce":[],"urlList":[]}}