{"title":"200 Years - 200 Years [2011][EAC,log,cue. FLAC]","uid":8729442,"size":224488118,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6dd187a9abcc476f794c64eee247b1c99fe360bc&amp;dn=200+Years+-+200+Years+%5B2011%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dickspic","files":12,"time":1374565040,"description":"Artist:200 Years\nRelease:200 Years\nReleased: 2011\nLabel: Drag City\nCatalog#: DC467\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle:indie folk\n\n\n1\t Wild White\t3:28\t\n2\t West Hartford\t3:58\t\n3\t Dead Medicine\t3:15\t\n4\t City Streets\t4:22\t\n5\t Through The Trees\t4:52\t\n6\t Partin Wayz\t3:53\t\n7\t Thread\t5:27\t\n8\t Solar System\t4:01\t\n9\t Bees\t3:52\t\n10\t More Than Alive\t3:43\n\nConsisting almost entirely of voices and guitars, there is an ageless quality to 200 Years. The album is bookended by its two most immediately mesmeric songs, &quot;Wild White&quot; and &quot;More Than Alive&quot;, both of which are sturdy, melodic gems that could seemingly translate into any idiom. Here they are given the simplest possible treatment, riding along only on the interplay of Ambrogio's voice and Chasny's expertly filigreed guitar lines, the production so intimate that it feels like eavesdropping on a private conversation.\n\nElsewhere, as on &quot;Partin Wayz&quot; or &quot;Thread&quot;, the duo adds discreet electric guitar effects or a quietly droning harmonium to the mix, always with the lightest of touch. None of these effects will shock those familiar with Chasny's previous work, and in its drowsier patches 200 Years can seem to be merely a Six Organs of Admittance tape with female vocals placed overhead. Which is hardly a bad formula in itself, but it might disappoint those hoping for more in the way of improvisational fireworks. On &quot;Bees&quot; Ambrogio does deliver what sounds like a front porch version of her Magik Marker lyrical cascade, with her words casually spilling out just as quickly as she can enunciate them.\n\nThe most impressive aspect of 200 Years, especially considering it as the debut of a new collaboration, is its overall aura of cool confidence. Chasny and Ambrogio are clearly two talented musicians with a wide variety of tools at their disposal, yet to their credit they don't feel the need to try and show every trick at once. Instead they show an innate sense of trust in one another and in this resonant collection of songs, secure in the knowledge that this should be plenty.","torrent":{"xt":"urn:btih:6dd187a9abcc476f794c64eee247b1c99fe360bc","amp;dn":"200+Years+-+200+Years+%5B2011%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6dd187a9abcc476f794c64eee247b1c99fe360bc","infoHashBuffer":{"type":"Buffer","data":[109,209,135,169,171,204,71,111,121,76,100,238,226,71,177,201,159,227,96,188]},"announce":[],"urlList":[]}}