{"title":"Foreign Correspondent PAL SUBS SWE,FIN,DAN,FIN,DUTCH","uid":5494778,"size":4126770306,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:6ddbaf8ca81dcd22ff554e7e7e30288fb6aeeb43&amp;dn=Foreign+Correspondent+PAL+SUBS+SWE%2CFIN%2CDAN%2CFIN%2CDUTCH&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":85,"time":1271200125,"description":"Alfred Hitchcock was always pushing the envelope, and 1940's &quot;Foreign Correspondent&quot; is no different. With America still in the midst of trading with both sides of the European war, Hitchcock made a spy thriller that quite clearly cast the Germans as the bad guys (minus the word Nazi, which only appears once at the beginning of the film) while being shamelessly patriotic (the last scene is both inspiring and laughable).\n\nBut Hitchcock could afford to go out on a limb. He started making FC a week after the release of &quot;Rebecca,&quot; a movie that garnered large amounts of critical acclaim and won Best Picture. But with all the praise heaped on Hitchcock's first American movie, his second has often gone unnoticed, although it is certainly up to par with - if not better than - &quot;Rebecca&quot;.\n\nForeign Correspondent tells the story of Johnny Jones, an American newspaper writer chosen to go to England to report on the war as Huntley Haverstock for the New York Globe. While in England, he attempts to interview a Dutch statesman, Van Mier, but instead witnesses the man's assassination. The resulting pursuit throws Jones/Haverstock into a Nazi spy ring that intends to use a secret clause to create German victory in the impending war. Along the way, Jones/Haverstock meets an English reporter who assists him and the daughter of a renowned pacifist.\n\nThe acting is excellent all around, with special kudos given to Robert Sanders as the English reporter, Scott ffoliot, and to Edmund Gwenn in a minor but important roll as Rowly, the friendly hit man. Laraine Day and Joel McCray have that special chemistry that adds to the romance part of the movie, while McCray and Sanders' straight-faced humor is enjoyable.\n\nHitchcock's directing is magnificent, like usual. As always, there are certain scenes that are signature Hitchcock: The assassination chase through the sea of umbrellas, and later in the Dutch countryside. The tower murder scene. And the plane crash scene has inspired cinematic plane crashes for decades. \n\nAll in all, Foreign Correspondent shows Hitchcock at his best, in the midst of a string of movies that saw him reach the top of the British filmmaking world and rapidly ascend to the same position in America. And it once again proves that Hitchcock was indeed the father of the spy-thriller genre. \n\n\n","torrent":{"xt":"urn:btih:6ddbaf8ca81dcd22ff554e7e7e30288fb6aeeb43","amp;dn":"Foreign+Correspondent+PAL+SUBS+SWE%2CFIN%2CDAN%2CFIN%2CDUTCH","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ddbaf8ca81dcd22ff554e7e7e30288fb6aeeb43","infoHashBuffer":{"type":"Buffer","data":[109,219,175,140,168,29,205,34,255,85,78,126,126,48,40,143,182,174,235,67]},"announce":[],"urlList":[]}}