{"title":"Heart - Even It Up  (2nafish)","uid":5546042,"size":176551940,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:6e4f3c67aaefde66f2761a865262ffd31238b207&amp;dn=Heart+-+Even+It+Up++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1273387135,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Even It Up&quot; is a song recorded by the rock band Heart. It was released in 1980 as the first single from the band's fifth studio album Bebe le Strange. The song is an uptempo rock and roll number which lyrically is sung by a woman who is demanding that her lover &quot;even it up&quot; by reciprocating the effort that she has put forth in their relationship.\n\n&quot;Even It Up&quot; peaked at number thirty-three on the U.S. Billboard Hot 100, and featured the Tower of Power horn section in it.\n\nBebe le Strange is the fifth studio album by the hard rock band Heart, released in 1980. It was the first album without Roger Fisher on lead guitar, who left the band months prior. The album was a commercial success, peaking at number five on the U.S Billboard 200 and staying in the charts for 22 weeks. The record contained the hit singles &quot;Even it Up&quot; (backed by the Tower of Power horns section) and the title track. Some of the backing vocals were provided by Don Wilhelm, who had been in a group called The Army with Steve Fossen and Roger Fisher.\n\nThe album was re-released in an expanded edition in 2004. It contained two additional songs: A live version of Break and the studio outtake Jackleg Man.\n\nHeart is a rock band whose founding members came from Seattle, Washington, USA  in the early 1970s. Going through several lineup changes, the only constant members of the group are sisters Ann and Nancy Wilson. The group rose to fame in the 1970s with their music being influenced by hard rock as well as folk music. After diminishing in popularity by the mid-1980s, the band created a major comeback in 1985, experiencing further success with their power ballads throughout the rest of the decade. By the mid-1990s, Heart left their 1980s' sound and went back to their hard rock roots which they continue to play today. To date, Heart has sold over 35 million albums worldwide.\n\nAfter a six-year hiatus, Heart will return with a new studio recording in 2010, entitled Red Velvet Car.\n\nHeart was ranked #57 on VH1's &quot;100 Greatest Artists of Hard Rock&quot;.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:6e4f3c67aaefde66f2761a865262ffd31238b207","amp;dn":"Heart+-+Even+It+Up++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e4f3c67aaefde66f2761a865262ffd31238b207","infoHashBuffer":{"type":"Buffer","data":[110,79,60,103,170,239,222,102,242,118,26,134,82,98,255,211,18,56,178,7]},"announce":[],"urlList":[]}}