{"title":"Vinux-3.0-DVD.iso","uid":5643180,"size":1947598848,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:704825828046f3cf23f2c6f83a0053c1371e2638&amp;dn=Vinux-3.0-DVD.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cestpasgagne2","files":1,"time":1277197597,"description":"Vinux : Linux for the Visually Impaired\nVinux is a remastered version of the popular Ubuntu 10.04 Lucid Lynx distribution optimised for the needs of blind and partially sighted users. By default it provides three screen-readers, two full-screen magnifiers, global font-size and colour changing facilities as well as support for USB Braille displays. When you boot the live CD you will be greeted by the Orca screen-reader/magnifier which enables you to navigate the graphical Gnome desktop using keybindings, as well as providing full screen-magnification if required.  For those who prefer to work in a simple text based console there is the Speakup screen-reader and as an emergency backup we have installed YASR, a hybrid screen-reader which can be run in either console mode or in a virtual terminal on the Gnome desktop. A second full-screen magnifier is provided by the Compiz Window Manager, which uses 3D technology to allow you to magnify and navigate the whole screen  using the mouse, or move a resizable virtual magnifying glass around the screen. The Gnome  Desktop Manager itself provides you with global keybindings to change the font size and/or the colour scheme on the fly. Finally, Brltty provides Grade 1/2 Braille output via the Orca screen-reader. By default all of the screen-readers use the same Espeak Speech Synthesizer via Speech-Dispatcher which provides a seamless experience for the user when switching from one screen-reader to another!\nThe DVD Edition is a slightly modified version of the original Alpha release with a few extra GTK based applications included and without the Firefox Accessibility Plugins, which caused a few stability issues.\n\nmd5sum : 16d51293752a6d27eff5bc32dcc8be7d  Vinux-3.0-DVD.iso","torrent":{"xt":"urn:btih:704825828046f3cf23f2c6f83a0053c1371e2638","amp;dn":"Vinux-3.0-DVD.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"704825828046f3cf23f2c6f83a0053c1371e2638","infoHashBuffer":{"type":"Buffer","data":[112,72,37,130,128,70,243,207,35,242,198,248,58,0,83,193,55,30,38,56]},"announce":[],"urlList":[]}}