{"title":"A Whisper in the Noise - Dry Land [2007][EAC,log,cue. FLAC]","uid":8753331,"size":334132693,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:704ad55faa0070567db3cde2fe78b50e0e0d12ee&amp;dn=A+Whisper+in+the+Noise+-+Dry+Land+%5B2007%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dickspic","files":14,"time":1375087195,"description":"Artist: A Whisper in the Noise\nRelease: Dry Land\nReleased: 2007\nLabel: Exile On Mainstream\nCatalog#: EOM 030\nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: USA\nStyle: Indie rock\n\n01) As We Were\n02) Awaken to Winter\n03) A New Dawn\n04) This Time, it's\n05) In Will\n06) Sons\n07) Armament\n08) You, the Orphan\n09) Beauty's Grace\n10) Go Now\n11) True Love Will Find You in the End\n\nThe sound of A Whisper in the Noise falls somewhere between Godspeed You Black Emperor, Peter Gabriel, and Joy Division... a mix of 80's moody keyboard pop and modern orchestrated brilliance. The ensemble consists of six members performing on violin, cello, french horn, electric bass, drums, piano, and vocals.\n\nDry Land is something very special. A Whisper In The Noise's third full-length album is a striking and artistic piece of work, full of dark stories drawn on a wide canvas, and sculpted by instruments rarely heard outside of classical compositions. The songs themselves are haunting, funereal, almost oppressive; stripped of vocals, this would make fine incidental music for some Southern Gothic movie biopic, full of mouldering clapboard houses and swamp-bound secrets.\n\nPowerful songwriting means that the material is authentically weighty while almost entirely avoiding the traditional hallmarks of heavy music -- there are no distorted walls of guitar, no thundering drums, no screaming vocals, but the music still presses into the air around you like a blanket of smoke. Think of Trent Reznor's more thoughtful and subtle tunes -- the instrumentation may be different, but there's a distinct similarity in the emotional content. Dry Land is a journey into the centre of selfhood -- and human psychology being what it is, that's no sun-soaked picnic day-trip.\n\nInstead, an array of classical instruments deliver a tonal pallet that evokes introspective melancholia with an edge of fragile beauty; when Steve Albini produces a record, you can never be sure quite what you're going to get, but here he has helped birth a thing of great beauty. Guitars are plucked or gently strummed; piano notes ring out in low registers, or play slow riffs and arpeggios that mark of the passing of the seconds like drops of rain or dead flower petals falling to the floor in dusty rooms; brass and string tones paint layers of depth and emotion, subtle textures like the audio equivalent of sepia-tint photography, exchanging bright hues of colour for ever-more-subtle gradations of light and shade. Over all of this, West Thordson's plaintive broken vocals stitch tales of loss and confusion into the weave. It's stunning, evocative, and very moving.\n\nI hope I've made it clear that this isn't a cheery album, but it is a work of sheer brilliance, nonetheless. If you're after bright and sparkly pop music, or even the straight-up energy of rock and metal, stay on the train -- Dry Land is not your stop, and you will find nothing to slake your thirst here. But if you like to wander the wilderness, confronting the beautiful bleakness of the human condition, listen closely for A Whisper In The Noise. The landscape will speak to you if you let it -- and you should.","torrent":{"xt":"urn:btih:704ad55faa0070567db3cde2fe78b50e0e0d12ee","amp;dn":"A+Whisper+in+the+Noise+-+Dry+Land+%5B2007%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"704ad55faa0070567db3cde2fe78b50e0e0d12ee","infoHashBuffer":{"type":"Buffer","data":[112,74,213,95,170,0,112,86,125,179,205,226,254,120,181,14,14,13,18,238]},"announce":[],"urlList":[]}}