{"title":"mythbuntu-10.04-desktop-i386.iso","uid":5633109,"size":654131200,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:707c7050ff9b9deae551d49b03cbcc87cf049d6a&amp;dn=mythbuntu-10.04-desktop-i386.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Owen65","files":1,"time":1276769958,"description":"About Mythbuntu\n\nMythbuntu is a community supported add-on for Ubuntu focused upon setting up a standalone MythTV based PVR system. It can be used to prepare a standalone system or for integration with an existing MythTV network. Unlike similar projects, Mythbuntu keeps close ties with Ubuntu and all development is given back to Ubuntu. This architecture allows simple conversions from a standard desktop to a Mythbuntu machine and vice versa. The development cycle of Mythbuntu closely follows that of Ubuntu, releasing every six months along side Ubuntu releases.\n\n\n \n\n \nDesktop\n\nMythbuntu uses the XFCE desktop. All unnecessary standard Ubuntu applications such as OpenOffice, Evolution, and a full Gnome desktop are not installed in a default Mythbuntu install. If at any time a user wants to, they can install ubuntu-desktop, kubuntu-desktop, or xubuntu-desktop and add a full desktop onto their installation. This can easily be done via the Mythbuntu Control Centre.\n\n\n \n\n \nMythbuntu-Control-Centre\n\nThe Mythbuntu Control Centre is a custom GUI used to configure the system. From here you can select what kind of system (Backend, Frontend, Both) you want. You can also install different desktops such as ubuntu-desktop and kubuntu-desktop. Install Plugins, configure MySQL, set passwords, install proprietary drivers, proprietary codecs, setup remote controls, and a range of other features all from one convenient program.\n\n\n \n\n \nLive Frontend\n\nA Mythbuntu CD can also be used as a live frontend. This is great if you want to turn a laptop or desktop into a quick frontend or quickly test hardware compatibility. The live frontend provides a GUI to mount network shares, configure a remote, hostname, location of your master backend and a place to save settings. All settings can be saved directly back to a flash drive for easy portability.\n\n\n\n\n","torrent":{"xt":"urn:btih:707c7050ff9b9deae551d49b03cbcc87cf049d6a","amp;dn":"mythbuntu-10.04-desktop-i386.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"707c7050ff9b9deae551d49b03cbcc87cf049d6a","infoHashBuffer":{"type":"Buffer","data":[112,124,112,80,255,155,157,234,229,81,212,155,3,203,204,135,207,4,157,106]},"announce":[],"urlList":[]}}