{"title":"Exploited College Girls - EVIE","uid":5527705,"size":571841516,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:714a68a57e6caa9b27820991905926fb749351dc&amp;dn=Exploited+College+Girls+-+EVIE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"beta2008x","files":1,"time":1272829304,"description":" &lt;a href=&quot;http://www.dumppix.com/viewer.php?file=8trcp_evie_full_wmv_thumbs.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.dumppix.com/viewer.php?file=8trcp_evie_full_wmv_thumbs.jpg&lt;/a&gt;\n\n\nConsidering that Evie claims to be more into girls than guys there's an awful lot of cumming going on on her end. Our punky 18 year old ASU student had discovered her love for pussy very early (you won't believe how young she was when she first had sex with a girl...) and she generally likes to have sex with girls more than men. Except when she don't. Today, luckily, is one of those days... Evie definitely has not done this type of thing before. She's adorably awkward when I take photos of her, but she's willing to please and we somehow get through it. I put a bit of the BTS of her posing for photos in the beginning because I just wanted you to see how 'fresh' the girl is. Very nice. We find out some interesting stuff about Evie. She's a bit more mature than the usual 18 year old I usually get to fuck here, but Evie also has a sarcastic way. Like a protective emotional wall. This tells me something's up but I can't put my finger on it. I think she's just not ready to fully admit she's into guys as much as girls, maybe even more so. I'm saying that because...well, just watch her closely as I lick her pussy, and then use the Rabbit vibrator on her. Hell, even when I get her naked and just play with her pussy, she gets really wet, as she helpfully points out. Hint: real lesbians don't cum that much when a guy does these things to her. And when I fuck her tight (tight!) pussy, she's about to have yet another orgasm. Did I just turn our bi-sexual teen into a full-on cock lover? That's for you to decide. In the end I think I know why she claims she's not as much into men: the cum. Evie hates it when I shoot about a week's worth of stored jizz over her face, which she quickly scrubs off in the bathroom as soon as I'm done taking pics of her sperm covered face. Too bad (for her) the load is fucking enormous. Even I was surprised how much juice was in me. I tell ya, her face was fucking covered in cum! ","torrent":{"xt":"urn:btih:714a68a57e6caa9b27820991905926fb749351dc","amp;dn":"Exploited+College+Girls+-+EVIE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"714a68a57e6caa9b27820991905926fb749351dc","infoHashBuffer":{"type":"Buffer","data":[113,74,104,165,126,108,170,155,39,130,9,145,144,89,38,251,116,147,81,220]},"announce":[],"urlList":[]}}