{"title":"100% Photoshop (2010) - (Malestrom)","uid":5610701,"size":212483566,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:71a4a04a277d92c7dae1ee163a9af4c11ae21655&amp;dn=100%25+Photoshop+%282010%29+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"malestrom_HH","files":2,"time":1275852003,"description":"\n\n100% Photoshop: Create Stunning Illustrations Without Using Any Photographs\n\nPublisher: Focal Press | ISBN: 0240814258 | edition 2010 | PDF | 256 pages\nJust when you think you've learned all that you could ever know about working in Photoshop, digital artist and photomontage king Steve Caplin comes along with yet another masterful method for creating incredible works of art in Photoshop. This time, he'll show you how to create complete images, from start to finish, entirely within the software program. No source material, photographs, or existing files from other software packages are needed, saving you valuable time and resources. The techniques you'll learn in this ground-breaking new book will help you combine your artistic vision and skills with an understanding of how to manipulate the built-in Photoshop filters to produce impressive, eye-catching artwork.\nEach chapter opens with a complete double page illustration, created entirely in Photoshop. Then, carefully laid out step-by-step instructions show you how each element in the illustration is created, and how they are all combined in the end to make a convincing final image. Using Steve's proven methods for success, you'll be able to produce images that reflect a more finely crafted, hand drawn approach, whether you're an artist for your own enjoyment or a working professional looking for a leg up on the competition.","torrent":{"xt":"urn:btih:71a4a04a277d92c7dae1ee163a9af4c11ae21655","amp;dn":"100%25+Photoshop+%282010%29+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71a4a04a277d92c7dae1ee163a9af4c11ae21655","infoHashBuffer":{"type":"Buffer","data":[113,164,160,74,39,125,146,199,218,225,238,22,58,154,244,193,26,226,22,85]},"announce":[],"urlList":[]}}