{"title":"010 - Coast to Coast - Ian Punnett with Tom Jokinen 28 Mar 10.m4","uid":5471958,"size":113361854,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:73ac85386dc186a73df83006a541fef32c147c8c&amp;dn=010+-+Coast+to+Coast+-+Ian+Punnett+with+Tom+Jokinen+28+Mar+10.m4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"panzerfaust69","files":1,"time":1269938234,"description":"Adventures of an Undertaker\n\nDate:03-27-10\n\nHost:Ian Punnett\n\nGuests:Tom Jokinen\n\nIan Punnett was joined by journalist Tom Jokinen (book link), who revealed what he learned about the funeral industry and our changing death rituals working as an undertaker-in-training.\n\nAccording to Jokinen, cremation is fast replacing traditional earth burials as the preferred method for the disposition of remains, and not only because of cost issues. On Vancouver Island, for instance, more than 90% of families opt to have their departed loved ones cremated, Jokinen explained, noting cultural norms and lack of space as the reasons. Cemetery space is at a premium in Europe as well. There burial plots are leased for a specific period, typically 15 years, after which time the family must pay again or the body is disinterred and the land reused, he continued.\n\nJokinen described the first time he cremated a body. &quot;It's not just like popping a cake in the oven,&quot; he said. The cremation furnace, or retort, must be constantly monitored to ensure the organic matter burns cleanly and produces as little smoke as possible. Pacemakers and defibrillators must be removed from bodies beforehand to avoid damaging the retort, he added. The cremation process produces a small amount of sterile minerals, known as cremains, as well as a green plastic-like substance, which Jokinen playfully referred to as the soul.\n\nFamilies typically put cremains in an urn or take them to someplace special, such as a sports stadium, for scattering, he said. Still others have their deceased's ashes put into jewelry, exploded in fireworks, and even packed into shot gun shells. Jokinen mentioned other technologies poised to replace cremation, including a process that uses an alkaline solution to dissolve bodies called resummation, and a technique in Sweden where corpses are disposed of by freeze drying.\nBook(s):\n# Curtains: Adventures of an Undertaker-in-Training\n\n","torrent":{"xt":"urn:btih:73ac85386dc186a73df83006a541fef32c147c8c","amp;dn":"010+-+Coast+to+Coast+-+Ian+Punnett+with+Tom+Jokinen+28+Mar+10.m4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73ac85386dc186a73df83006a541fef32c147c8c","infoHashBuffer":{"type":"Buffer","data":[115,172,133,56,109,193,134,167,61,248,48,6,165,65,254,243,44,20,124,140]},"announce":[],"urlList":[]}}