{"title":"Tribal.Wives.S01E01 Kuna / Panama","uid":5636027,"size":485750784,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:73d75c26bd34260e7a78fb3557b2fd9518c16c0b&amp;dn=Tribal.Wives.S01E01+Kuna+%2F+Panama&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1276894771,"description":"Six part series in which six women each live for a month with six different tribes all over the world. Like many women today juggling the pressures of western life from careers to home and family, they all think something is missing. By spending time with tribes where women's roles are very different, they hope they can find some answers, and in doing so, change their own lives.\n\nThe Kuna Indians are a deeply spiritual people who live on a stunning scattering of coral islands off the coast of Panama. A monogamous tribe with tight-knit families, they are a deeply spiritual people who believe that their homes and families are protected by ever-present spirits. Living with them for a month is Sass Willis, a 34 year old from Oxford who packs every moment of her day. Twenty one years ago, Sass had to choose between her parents and when she decided to live with her father, she never saw her mother again. Amongst the Kune, however, Sass makes an extraordinary discovery - the mother she feels she has never had.","torrent":{"xt":"urn:btih:73d75c26bd34260e7a78fb3557b2fd9518c16c0b","amp;dn":"Tribal.Wives.S01E01+Kuna+%2F+Panama","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73d75c26bd34260e7a78fb3557b2fd9518c16c0b","infoHashBuffer":{"type":"Buffer","data":[115,215,92,38,189,52,38,14,122,120,251,53,87,178,253,149,24,193,108,11]},"announce":[],"urlList":[]}}