{"title":"Erogirls","uid":5527282,"size":14358382,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:73e006217a00b9ce919d23691d436c30fccf86c0&amp;dn=Erogirls&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"furtaperas","files":1,"time":1272815077,"description":"Ero.ru.Player1.1.9 (2010) es un software  gratuito que convierte tu escritorio en un club de striptease privado cerrado. Chicas bailando en tu escritorio, mientras continÃƒÂºa trabajando en el equipo. Se ve en la pantalla simplemente impresionante! Y no es la pornografÃƒÂ­a - las chicas no se desviste hasta el final! AsÃƒÂ­, el swing y listo para la pregunta sorprendiÃƒÂ³ a sus amigos: &quot;Ã‚Â¿DÃƒÂ³nde lo encontraste?&quot;\nUna vez instalado el programa, obtener actualizaciones gratis de por vida de las niÃƒÂ±as nuevas. Sin ninguna restricciÃƒÂ³n - usted conseguirÃƒÂ¡ el acceso striptease - mostrar todos los de nuestras chicas en ropa interior sexual. Si quiero a una chica desnuda para ti por completo, necesita tener acceso a la versiÃƒÂ³n completa de la serie. Instrucciones para obtener el acceso estÃƒÂ¡ disponible en cada chica. Todos los participantes - en realidad los caracteres existentes!\nPara acceder a la descarga striptease chicas xxx-y todas las fotos erÃƒÂ³ticas de su programa, usted necesita ir al sitio del fabricante del programa o de sus distribuidores.\n","torrent":{"xt":"urn:btih:73e006217a00b9ce919d23691d436c30fccf86c0","amp;dn":"Erogirls","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73e006217a00b9ce919d23691d436c30fccf86c0","infoHashBuffer":{"type":"Buffer","data":[115,224,6,33,122,0,185,206,145,157,35,105,29,67,108,48,252,207,134,192]},"announce":[],"urlList":[]}}