{"title":"Avatar.DVDRip.Lite.XviD.Mp3.Spanish.By.Gamolama","uid":5524093,"size":1131192190,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:744321cb49396f40cdddd01578a9e72ad13b0b94&amp;dn=Avatar.DVDRip.Lite.XviD.Mp3.Spanish.By.Gamolama&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gamolama","files":1,"time":1272674623,"description":"\nDirector: James Cameron\nActores: Sigourney Weaver, Sam Worthington, Zoe Saldana\nAÃƒÂ±o de la producciÃƒÂ³n: 2009\nAÃƒÂ±o 2154. Jake Sully (Sam Worthington) es un ex-marine confinado en una silla de ruedas que, a pesar de su cuerpo tullido, todavÃƒÂ­a es un guerrero de corazÃƒÂ³n. Jake ha sido reclutado para viajar a Pandora, donde las corporaciones estÃƒÂ¡n extrayendo un mineral extraÃƒÂ±o que es la clave para resolver los problemas de la crisis energÃƒÂ©tica de la Tierra. Al ser tÃƒÂ³xica la atmÃƒÂ³sfera de Pandora, ellos han creado el programa Avatar, en el cual los humanos conductores tienen sus conciencias unidas a un avatar, un cuerpo biolÃƒÂ³gico controlado de forma remota que puede sobrevivir en el aire letal. Estos cuerpos estÃƒÂ¡n creados genÃƒÂ©ticamente de ADN humano, mezclado con ADN de los nativos de Pandora, los Na vi. Ya en su forma avatar, Jake puede caminar otra vez. Ha recibido la misiÃƒÂ³n de infiltrarse entre los Na vi, los cuales se han convertido en el mayor obstÃƒÂ¡culo para la extracciÃƒÂ³n del mineral. Pero una bella Na vi, Neytiri (Zoe Saldana), salva la vida de Jake, y todo cambia. Jake es admitido en su clan y aprende a ser uno de ellos, lo cual le hace someterse a muchas pruebas y aventuras. Mientras, los humanos siguen con su plan, confiando en que la informaciÃƒÂ³n de Jack les sea ÃƒÂºtil.\n\n\t\t\n\n\nNOTA: DVDRIP LITE = CALIDAD MUY BUENA EN 1 SOLO GIGA\nPARA LOS QUE TIENEN PROBLEMAS, CON LOS GRANDES TAMANOS DE LOS ARCHIVOS ","torrent":{"xt":"urn:btih:744321cb49396f40cdddd01578a9e72ad13b0b94","amp;dn":"Avatar.DVDRip.Lite.XviD.Mp3.Spanish.By.Gamolama","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"744321cb49396f40cdddd01578a9e72ad13b0b94","infoHashBuffer":{"type":"Buffer","data":[116,67,33,203,73,57,111,64,205,221,208,21,120,169,231,42,209,59,11,148]},"announce":[],"urlList":[]}}