{"title":"Bangles - Hero Takes A Fall  (2nafish)","uid":5613535,"size":103735300,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:757d46c220cbea7006ce58e8486579931fef0082&amp;dn=Bangles+-+Hero+Takes+A+Fall++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1275981225,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\nAll Over the Place was The Bangles' first full length album for Columbia Records. Released in 1984, the sound is lively and shows more Bangles collaboration and less keyboard overdubs that were used later on their more commercially successful albums. Although the album was not a commercial success, it gave them the chance to perform as an opening act for Cyndi Lauper and Huey Lewis and the News and brought the group to the attention of Prince, who would write Manic Monday, their first hit.\n\nTwo singles were released from this album, &quot;Hero Takes a Fall&quot;, which peaked outside the U.K. Top 40, and &quot;Going Down to Liverpool,&quot; written by Kimberley Rew of Katrina and the Waves, which won the Bangles the BPI Award, the British equivalent of the Grammy. The video for &quot;Going Down To Liverpool&quot; features Leonard Nimoy, who plays the part of the band's chauffeur.\n\nThe 2008 reissue CD on the Wounded Birds label (WOU 9220) adds a bonus track: &quot;Hero Takes a Fall&quot; (Single Remix).\n\nThe Bangles are an American all-female band that originated in the early 1980s, scoring several hit singles during the decade.\n\nThe Bangles' full-length debut album on Columbia, All Over the Place (1984), captured their power-pop roots, featuring the singles &quot;Hero Takes a Fall&quot; and the Kimberley Rew-penned Beatlesque &quot;Going Down To Liverpool&quot; (originally recorded by Rew's band Katrina and the Waves). The record received good reviews, and the video for &quot;Liverpool&quot; featured Leonard Nimoy, which helped to generate further publicity. The received a much wider awareness serving as the opening act of Cyndi Lauper on her Fun tour.\n\nAll this went some way to attracting the attention of Prince, who later wrote &quot;Manic Monday&quot; for the group. &quot;Manic Monday&quot; went on to become a #2 hit in the US, the UK and Germany, outsold at the time only by another Prince composition, his own &quot;Kiss&quot;. The band's second album Different Light (1986) was more polished than its predecessor and, with the help of the worldwide #1 hit &quot;Walk Like an Egyptian&quot;, saw the band firmly in the mainstream.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:757d46c220cbea7006ce58e8486579931fef0082","amp;dn":"Bangles+-+Hero+Takes+A+Fall++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"757d46c220cbea7006ce58e8486579931fef0082","infoHashBuffer":{"type":"Buffer","data":[117,125,70,194,32,203,234,112,6,206,88,232,72,101,121,147,31,239,0,130]},"announce":[],"urlList":[]}}