{"title":"SuperDoctors.One.Small.Step.720p.HDTV.x264-NOsegmenT","uid":5553720,"size":1563993056,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:75a19f874b0f8cbce6306717dbb6cebb8e85d4e2&amp;dn=SuperDoctors.One.Small.Step.720p.HDTV.x264-NOsegmenT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ovidiusmd","files":2,"time":1273618423,"description":"Final in the series examining new medical frontiers looks at the opposite of the high-cost/high-    \n technology world people expect to coincide with cutting-edge medical care.                          \n                                                                                                     \n The programme examines the work of orthopaedic surgeon Steve Mannion, who has devoted his life to   \n working in far-flung and under-resourced corners of the world. Most of his work is done in places   \n where there is no technology and no money, so everything has to be done through sheer human         \n ingenuity - which Steve has in spades.                                                              \n                                                                                                     \n The programme follows him to Malawi, one of the poorest countries on earth. There he has several    \n clinics for children and adults with club feet but, as the only surgeon for seven million people    \n in the northern area of the country, never has the time to perform all the necessary surgery on     \n his own.                                                                                            \n                                                                                                     \n Instead he came up with a new, non-surgical solution - that he could train staff in Malawi to       \n perform as well - to keep up with the great demand. Steve started using a little known and          \n scarcely used physiotherapy treatment called the Ponseti treatment on the children in Malawi, and   \n found it to be very successful - even better than the surgical treatment used in Britain.           \n                                                                                                     \n The programme follows the Ponseti treatment - both in Africa and Britain - and tells the story of   \n Steve's struggle to overcome deep-set traditions and practices to eventually cross a new medical    \n frontier.                                                                                           ","torrent":{"xt":"urn:btih:75a19f874b0f8cbce6306717dbb6cebb8e85d4e2","amp;dn":"SuperDoctors.One.Small.Step.720p.HDTV.x264-NOsegmenT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75a19f874b0f8cbce6306717dbb6cebb8e85d4e2","infoHashBuffer":{"type":"Buffer","data":[117,161,159,135,75,15,140,188,230,48,103,23,219,182,206,187,142,133,212,226]},"announce":[],"urlList":[]}}