{"title":"CIDE TORRENT","uid":5535523,"size":3214524910,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:790a45efce1142caf715019932fabdc50cb89de2&amp;dn=CIDE+TORRENT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"glob0z","files":552,"time":1273060337,"description":"this is a collection of most releases from realicide youth records from 2002-2008. check out their channel on the tube of you . usually on tour. \n \n\nand please seed.\n\n\n\nCIDE#50 Realicide &quot;CIDE TORRENT&quot; \n\nWe're living in an age, more and more it seems, in which all information is available if we're able to recognize and accept it. This is a data DVDR that contains around 99% of anything ever publicly available by Realicide, beginning with the project's conception in 2002 through the curation of this release in September 2008, totaling over 37 hours of audio, hundreds of flyers and posters and photos, notes, all organized into 67 folders... For anyone who has not already owned Realicide material, or for anyone looking for any earlier or more obscure previous releases, this disc contains almost everything that the public has ever had access to: tapes, vinyl records, CDR's, zines, &quot;net releases&quot;, compilation tracks. And as the title suggests, it was painstakingly compiled in order to adhere to the recent surge of Torrent file-sharing online. You can make torrents of it, inject it into your Soulseek files, burn CD's, anything... As bonus material, included are many previous releases by Realicide-related artists such as Evolve, Mavis Concave, Ultra//Vires, aaronquinn, SX, Hentai Lacerator, Jim Swill, No Candy... The DVD case it's packaged in also contains 3 xerox posters and a sticker. Postage-paid US price is $15 because of the massive amount of information on the disc and the labor that went into compiling it, but since the idea behind this release is file-sharing, it is suggested that you get a few friends to throw in a couple dollars each, buy 1 copy, and share it. Any profit from this release will contribute to the next phase of Realicide Youth Records, which will offer new and increasingly focused material by Realicide members and artists of a similar ethic and motivation, including as much collaborative activity as possible with anyone who feels they can truthfully relate to our chosen path and purpose. Please email with any questions, or for distro rates. Edition: 150, October 2008.\n\nFor more information such as past interviews, reviews, tour dates, contact and links for band members, current activities, new releases, go to www.realicide.com\n\nWe're online, but our bands exist outside Myspace and outside digital media as well, believe it or not. Myspace is not our project's archival website and when you write to me, or approach me at shows, talking to me as if our ideas and limitations are confined to the muggerfucking features of Myspace... listen careful now: FUCK YOU. You would turn a simple communicative tool like a website into another vice, another demonstration of abuse, just like anything else like drugs or jokes or sleep or anything?! Why limit yourself to a way of communicating completely controlled by the newest replacement for TV commercials?! Myspace and digital media of that sort is a very powerful tool, but don't think for a second that you're in control of it as a medium! Don't think it is without a ridiculous degree of compromise! Why not find other ways of sharing your life and ideas, and keep Myspace profiles in their place? All I'm asking is for people to try and not take the easiest way possible EVERY time; to have a reasonable set of priorities than can actually nurture their own autonomy, creative health, and the relationships that hopefully spring from it. So here is a collection of Realicide data, take it for what it is.  ~ Robert Inhuman  09/28/08  &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;43312c212631372a2d2b362e222d032b2c372e222a2f6d202c2e&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;","torrent":{"xt":"urn:btih:790a45efce1142caf715019932fabdc50cb89de2","amp;dn":"CIDE+TORRENT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"790a45efce1142caf715019932fabdc50cb89de2","infoHashBuffer":{"type":"Buffer","data":[121,10,69,239,206,17,66,202,247,21,1,153,50,250,189,197,12,184,157,226]},"announce":[],"urlList":[]}}