{"title":"The Magistrate (2 DVD s) (Miniserie) (NL SUBS) 2Lions-Team","uid":5519614,"size":9292090373,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:79efb4a252fae91d71796208a11ef186939a340c&amp;dn=The+Magistrate+%282+DVD+s%29+%28Miniserie%29+%28NL+SUBS%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pioen","files":-1,"time":1272484881,"description":"The Magistrate (2 DVD s) (Miniserie)\n\nIl magistrato \n    \n  \n \n  Rechter Paolo Pizzi heeft zich zijn hele leven gewijd aan de strijd tegen de misdaad.\nHij spant zich in om de meedogenloze 'Ndrangheta, de Calabrische maffia, te ontmantelen en heeft daarom weinig tijd voor zijn Australische vrouw Jean Shaw en hun zoon Robbie.\nNaarmate de tijd verstrijkt, wordt de strijd tegen de georganiseerde misdaad een steeds grotere obsessie voor Paolo en komt hij steeds meer a leen te staan.\nZijn vrouw bouwt verder aan haar succesvolle carriÃƒÂ¨re als actrice in AustraliÃƒÂ«, tot Robbie, die inmiddels 22 is, op een dag verdwijnt.\nZe neemt het vliegtuig naar ItaliÃƒÂ« om Paolo over te halen samen met haar hun vermiste zoon te zoeken.\nMaar Paolo heeft de woede van gevaarlijke en machtige mannen over zich afgeroepen en voordat hij iets tegen hen kan ondernemen, proberen ze hem te grazen te nemen.\n\nEnglish\n\nJudge Paolo Pizzi has dedicated his life to the fight against crime. He is committed to the relentless' Ndrangheta, the Calabrian mafia, dismantling and therefore has little time for his Australian wife Jean Shaw and their son Robbie. As time passes, the fight against organized crime a growing obsession with Paolo and he increasingly a loan to assist. His wife is building her successful career as an actress in Australia, to Robbie, now 22, on one day disappears. They took the plane to Italy Paolo to get along with her their missing son to find. But Paolo has the wrath of dangerous and powerful men are called up and before anything against them can proceed, trying him to graze in take.\n\n\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail\nBeeldformaat  : 4:3\n  \n \nAudio  : Dolby Digital 2.0 Engels\n \n\nOndertitels : Nederlands (instelbaar)\n \nGenre : Drama\n \nWeblink : http://www.bol.com/nl/p/dvd/magistrate/1002004006474152/index.html?Referrer=ADVNLGOT0020101002004006474152 \nWeblink :\n\n*****************************************\n\nBrought to you by \n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\nTo the fakers Get a Live\n\n\n\n","torrent":{"xt":"urn:btih:79efb4a252fae91d71796208a11ef186939a340c","amp;dn":"The+Magistrate+%282+DVD+s%29+%28Miniserie%29+%28NL+SUBS%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79efb4a252fae91d71796208a11ef186939a340c","infoHashBuffer":{"type":"Buffer","data":[121,239,180,162,82,250,233,29,113,121,98,8,161,30,241,134,147,154,52,12]},"announce":[],"urlList":[]}}