{"title":"Im.Your.Bitch.Lyen.XXX.DVDRip.x264-SWE6RUS","uid":8863229,"size":1597288178,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:7a65320850c6c86e519a928668202b3423b89a02&amp;dn=Im.Your.Bitch.Lyen.XXX.DVDRip.x264-SWE6RUS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"xxxlavalxxx","files":-1,"time":1377826421,"description":"Category All Sex, Anal, Foreign, Gonzo, Toy Play\n\n Director Christoph Clark\n Starring Lyen, David Perry, Choky Ice, Thomas Stone, Sabby, Coco De Mal\n\n : Lyen , Coco De Mar, David Perry, Choky Ice, Sabby , Thomas Stone Evil Angel's master of classic Euro-style hard-core, French director Christoph Clark, has discovered a new feminine muse with whom to explore his most perverse impulses. Twenty-year-old Lyen is a slender, glamorous and all-natural young Hungarian beauty with an 'anything goes' approach to sex ... the perfect star for Christoph's new, four-scene collection of twisted anal gonzo scenarios. 'I'm Your Bitch: Lyen' presents the uninhibited slut in a variety of situations. From solo masturbation with nasty anal toys... to a sweet session of backdoor lesbianism and raunchy rim jobs with short-haired Serbian cutie-pie Coco De Mar ... to torrid, balls-out ass fucking with infamous stud David Perry ... to an epic gang bang with three guys at once that features plenty of hole-stretching double-penetration (and a triple-sperm facial!) for the talented babe - Lyen is eager to satisfy all cummers, using every filthy technique at her sexual disposal. Any fan of Christoph's unique and distinctive approach to anal porn will soon fall in lust with this exquisite bitch and her outrageous willingness to try everything and everybody on for size! 'I'm Your Bitch: Lyen' proves beyond doubt that when it comes to fucking, this exceptionally talented trollop is a true people pleaser. Go ahead, take Lyen: She's all yours!\n\n &lt;a href=&quot;\nhttp://bayimg.com/AApjOaaED&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/AApjOaaED&lt;/a&gt;","torrent":{"xt":"urn:btih:7a65320850c6c86e519a928668202b3423b89a02","amp;dn":"Im.Your.Bitch.Lyen.XXX.DVDRip.x264-SWE6RUS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a65320850c6c86e519a928668202b3423b89a02","infoHashBuffer":{"type":"Buffer","data":[122,101,50,8,80,198,200,110,81,154,146,134,104,32,43,52,35,184,154,2]},"announce":[],"urlList":[]}}