{"title":"Rawbots 0.1.4 Linux","uid":8862576,"size":272944685,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:7ceffc68f7c0f14d57805f3a476347d9a97ee403&amp;dn=Rawbots+0.1.4+Linux&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Belicja","files":-1,"time":1377813859,"description":"Rawbots 0.1.4 &quot;Blueshift&quot; for Linux\n\n(I don't have Linux, so I don't know how to install games in it but there's readme file in the .zip)\n\nSupport the developers by buying the game! http://www.rawbots.net/\n\n&quot;What is Rawbots?\n \t\nA universe where you can play with amazing robots that are designed, built and even programmed by you.\n\nEverything is a robot, doors, roads, walls, bridges, safes, traps, turrets, surveillance systems, etc. Build forts, towers and architect impressive structures to protect your planets and resources. You may play solo or with friends to infiltrate, conquer planets and gather resources.\n\nTraditional keyboards and mouse can be used along with midi devices, gamepads, iOS and Android devices. Create your own input setups and master your designs, whether it is controlling a huge robot or entire armies of relentless minions.\nThe Rawbots universe has a unique set of matter, energy and physics laws. These laws are engineered to serve up fun emergent gameplay that is different every time you play. Everything you would expect from a sandbox game and more. We are taking this to the next level with gameplay that truly emerges beyond imagination and defined contextually by the type of robots you build. On one planet you might experience a first person shooting experience, go into a space battle in 3rd person, and down into an RTS offensive on another planet.&quot;","torrent":{"xt":"urn:btih:7ceffc68f7c0f14d57805f3a476347d9a97ee403","amp;dn":"Rawbots+0.1.4+Linux","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ceffc68f7c0f14d57805f3a476347d9a97ee403","infoHashBuffer":{"type":"Buffer","data":[124,239,252,104,247,192,241,77,87,128,95,58,71,99,71,217,169,126,228,3]},"announce":[],"urlList":[]}}