{"title":"BBC Wonders of the Solar System S01E05 - Aliens_Tam.mp4","uid":5481079,"size":226680588,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7d8f7853958b38f950f554d0010ede84b015bcac&amp;dn=BBC+Wonders+of+the+Solar+System+S01E05+-+Aliens_Tam.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"AlbaGuBrath","files":1,"time":1270428740,"description":"Episode 5 of the BBC series Wonders of the Solar System - Aliens\n\nProfessor Brian Cox visits some of the most stunning locations on earth to describe how the laws of nature have carved natural wonders across the solar system. \n\nBrian descends to the bottom of the Pacific in a submarine to witness the extraordinary life forms that survive in the cold, black waters. All life on Earth needs water so the search for aliens in the solar system has followed the search for water.\n\nSoaring above the dramatic Scablands of the United States, Brian discovers how the same landscape has been found on Mars. And it was all carved out in a geological heartbeat by a monumental flood.\n\nArmed with a gas mask, Brian enters a cave in Mexico where bacteria breathe toxic gas and leak concentrated acid. Yet relatives of these creatures could be surviving in newly-discovered caves on Mars. \n\nBut Brian's sixth wonder isn't a planet at all. Jupiter's moon Europa is a dazzling ball of ice etched with strange cracks. The patterns in the ice reveal that, far below, there is an ocean with more potentially life-giving water than all the oceans on Earth. \n\nOf all the wonders of the solar system forged by the laws of nature, there is one that stands out. In the final episode of this series, Brian reveals the greatest wonder of them all.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1611787/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1611787/&lt;/a&gt;\n\nEnjoy!!\n\nTam&amp;Carla","torrent":{"xt":"urn:btih:7d8f7853958b38f950f554d0010ede84b015bcac","amp;dn":"BBC+Wonders+of+the+Solar+System+S01E05+-+Aliens_Tam.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d8f7853958b38f950f554d0010ede84b015bcac","infoHashBuffer":{"type":"Buffer","data":[125,143,120,83,149,139,56,249,80,245,84,208,1,14,222,132,176,21,188,172]},"announce":[],"urlList":[]}}