{"title":"Bitdefender Total Security + Antivirus 2013 Lifetime Activation","uid":8699027,"size":738073319,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7f6d7ffeba49362613bd6d9de8dc82bc71fb6f90&amp;dn=Bitdefender+Total+Security+%2B+Antivirus+2013+Lifetime+Activation+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"sunstrife","files":6,"time":1374019435,"description":"BitDefender Total/ Internet  Security 2013\n\nBitDefender\nTotal Security provides comprehensive proactive protection against all Internet security threats, along with system maintenance and backup, withoutslowing down your PCs. It combines state of the art protection against viruses, spyware, hackers, spam and other Internet security threats.\nBitDefender Total Securityfeatures Antivirus, Firewall, Antispyware, Privacy Control, Parental Control, TuneUp (registry cleaner, PC cleaner, file shredder, disk defragmenter), BackUp Managerfor corporate and home users. Bitdefender Total Security 2013 offers ultimate silent security for the net-centric lifestyle, fighting every category of e-threats withbest-of-breed technologies. Bitdefender capitalizes on live and virtualized behavior-based detection, in addition to cloud-based services, to stop emerging e-threatsthat other products miss. The Autopilot provides a hassle-free experience by making optimal security-related decisions without input from you. This means no pop-ups,no alerts, nothing to configure.\n\nKey-Features :\n\nBlocks viruses, spyware &amp; spam\nHalts ID theft attempts\nFilters the links you receive from your Facebook and Twitter friends\nKeeps kids safe with cutting-edge parental controls\nOnline backup\nTunes up your PC for optimal speed &amp; performance\n\nWhat's new in this version :\n\nVersion 2013:Bitdefender SafePay - for iron-clad security when shopping and banking\nWindows 8 CompatibleDevice\nAnti-Theft - Remotely locate, lock or wipe any internet connected device\nUSB Immunizer - protection for flash drives against e-threats\nSecurity Widget\nNote :\nRead the Installation note and watch the video tutorial included in the rar file carefully\nYour Antivirus might gonna report the Activator (FIX) as virus !!! Its a false positive, as activator will make changes in the core of the application, it will be reported as a virus. Please use activator only if you understand the risk... So turn off your Antivirus before use it\nYou can update BitDefender 2013 after Activating using this LifeTime Activator but in my personal opinion.. its better if you didnt turn on your automatics update.. because BitDefender is really smart and will make your software back to a trial mode.. and there isnt any activator available to outdo this at the moment\n\n\n\nPermanent Activator and video Tutorial how to activate it is on th file\n\nScreenshot\n &lt;a href=&quot;\nhttp://bayimg.com/MaNKeaAem&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/MaNKeaAem&lt;/a&gt;","torrent":{"xt":"urn:btih:7f6d7ffeba49362613bd6d9de8dc82bc71fb6f90","amp;dn":"Bitdefender+Total+Security+%2B+Antivirus+2013+Lifetime+Activation+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f6d7ffeba49362613bd6d9de8dc82bc71fb6f90","infoHashBuffer":{"type":"Buffer","data":[127,109,127,254,186,73,54,38,19,189,109,157,232,220,130,188,113,251,111,144]},"announce":[],"urlList":[]}}