{"title":"SCC First Working Crack! ONLY Deniable OPS","uid":5521607,"size":5333098,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7fcb4f0921e63ea0a3c9cdf29825dc91f5827568&amp;dn=SCC+First+Working+Crack%21+ONLY+Deniable+OPS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"The.Genius.of.the.Hole","files":2,"time":1272633639,"description":"Hi TPB fellows, I've found some stuff into the cs(put a dot)rin(put a dot)ru forums I'd like to share!!!\n\nStep 1: Extract the contents of the &quot;SCC Starting Crack.rar&quot; INSIDE the SC:C's directory (C:Program Files (x86)UbisoftSplinter Cell Conviction).\n\nStep 2: Go to C:WindowsSystem32driversetc and you'll find the &quot;hosts&quot; file. Rename this file to &quot;hosts2&quot; or something along those lines. Copy the &quot;hosts&quot; file that you downloaded (located in the RAR file).\n\nStep 3: Open the Start Menu and either click Run.. or type &quot;cmd&quot; into the Vista/7 search bar, and right-click cmd.exe in the results, and left-click &quot;Run as administrator..&quot; once the cmd shell is open, type in &quot;ipconfig /flushdns&quot; and it will confirm that it has done so. Close out of the cmd shell.\n\nStep 4: In the SC:C directory, copy the &quot;ubiorbitapi_r2.dll&quot; file. Then, navigate to the Ubisoft game launcher directory (C:Program Files (x86)Ubisoft by default, or whatever your location is - may not be changeable, actually) and go into the &quot;Ubisoft Game Launcher&quot; folder. In there, you should see another &quot;ubiorbitapi_r2.dll&quot; file. Backup this file or whatever. Then paste the one you copied in the RAR.\n\nStep 5: Go to the SC:C directory, and run the server.exe file. Then, in the SC:C directory, go into the &quot;src&quot; folder, then the &quot;system&quot; folder and launch the game using the conviction_game.exe.\n\nStep 6: Log into the game using a Ubisoft account that actually exists. Yes, you can register one: it doesn't require a key or anything. Simply register the account. Not that it matters for now, but make sure that when the game is launching that you click the gear in the top-right corner of the window and DISABLE online game-saving.\n\nThis should work for all of you. If you have any problems, let me know.\n\nNote/Edit: The game DOES NOT WORK for campaign or any other mode, as of now. The only mode that works is Deniable Ops, which is the Coop Mode, basically.\n\nIf the problems still persist, reinstall the game.","torrent":{"xt":"urn:btih:7fcb4f0921e63ea0a3c9cdf29825dc91f5827568","amp;dn":"SCC+First+Working+Crack%21+ONLY+Deniable+OPS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7fcb4f0921e63ea0a3c9cdf29825dc91f5827568","infoHashBuffer":{"type":"Buffer","data":[127,203,79,9,33,230,62,160,163,201,205,242,152,37,220,145,245,130,117,104]},"announce":[],"urlList":[]}}