{"title":"xsoftware dvdx platinum v 2.10","uid":5609508,"size":10131989,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:817a78d38c7c925cc947b00b8fb05ca7ff0a5c98&amp;dn=xsoftware+dvdx+platinum+v+2.10&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BLACKTROY","files":1,"time":1275783026,"description":"VERY RARE SOFTWARE\n\nVERY DIFFICULT TO GET ON THE INTERNET. TRY TO FIND IT. REMEMBER YOU GOT IT HERE FROM PIRATEBAY\n\n\n\nDVD X Platinum is the perfect DVD movie backup tool for every DVD movie burning situation, guaranteed to satisfy DVD movie lovers at any level. You will be able to burn DVD movies with DVD X Platinum's Simple mode, you get one-click automated backups with blazing speed. Power-users and movie buffs alike rave about DVDXPlatinum's Advanced mode where you can easily create highly customized backups by compressing or deleting content of your choice. That's right, you can slice, dice and squeeze or leave DVD movie content how you like. Then save these burn session preferences via small TDF files that can be shared with your friends. Platinum is the most advanced DVD burning technology of its kind. This product is guaranteed to satisfy or your money back.\n\n\n\nWHAT YOU CAN DO with DVD X Platinum Software:\n\nBurns DVD movies to any blank DVD Disc (DVD +/- R/RW)\n\nBackup copy plays on any ordinary home DVD player \n\nConstantly updated to support latest DVD burners and blank DVD discs\n\nProduct updates available online\n\nLive Telephone Technical Support\n\nAutomatically reformats +/- RW discs\n\nCopies DVD movie content from original DVD disc or from hard drive\n\nCopies Special Features (Movie Trailers, Commentary, etc.)\n\nCopies Full Multi-Channel Audio (Dolby Digital 5.1, DTS)\n\nCopies Every Language Available on Original DVD Movie\n\nCopies Episodic DVD Movies; TV Series, etc.\n\nNTSC/PAL Support\n\nRequires DVD burner\n","torrent":{"xt":"urn:btih:817a78d38c7c925cc947b00b8fb05ca7ff0a5c98","amp;dn":"xsoftware+dvdx+platinum+v+2.10","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"817a78d38c7c925cc947b00b8fb05ca7ff0a5c98","infoHashBuffer":{"type":"Buffer","data":[129,122,120,211,140,124,146,92,201,71,176,11,143,176,92,167,255,10,92,152]},"announce":[],"urlList":[]}}