{"title":"Obsession - Carnival Of Lies 2006 - Great Album","uid":5602466,"size":86732509,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:822f0a1dcd28a58e23bf0456c5be7e4017a59748&amp;dn=Obsession+-+Carnival+Of+Lies+2006+-+Great+Album&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":13,"time":1275392719,"description":"After twenty-plus years in the music industry, you would think OBSESSION would have turned the corner for home, wreaking havoc and pitching a flamethrower in the middle of your eyes. Back in 1983, they released their first demo with nine tracks- and I am sure Mike Vescera thought success was imminent with OBSESSION. Vescera  took great measures as he etched his legacy in music, starting with OBSESSION  and scaling the cliffs with other successful bands such as Loudness  and Yngwie Malmsteen.\n\nVescera reformed OBSESSION in 2002, made a comeback in 2003, and is back in 2006 with the same lineup that appeared on Vescera's solo release, &quot;The Altar&quot;. &quot;Carnival of Lies&quot; is the band's fourth full-length CD, and this could be the magical one that breaks the camel's ass. The CD features swift-moving guitar licks, with crunching solos by John Bruno and Scott Boland, and guest appearances by Joe Stump and Robert Marcello. The bonus track 'Judas' really shreds, (being the only tune that each guest guitarist contributes). 'Carnival of Lies' has to be one of the best classic metal releases of 2006. Its pure metal riffs are reminiscent of Judas Priest, and the vocal power reminds me of Mark Slaughter mixed with Rob Halford.\n\nThis entire CD will bring you back in time, with the shades of Dokken and Priest, with the guitar weaponry of four killer mortar men in Bruno, Boland, Stump and Marcello. 'The Offering' is a chanting evil tune that brings the devil out from hiding, and the background vocals make it sound like the fallen angel is about to appear and the fight is on as the guitars duel it out- and what a battle it is! 'I Don't Belong' reminds me of the KISS song I'm a Legend Tonight', and the vocals remind me of one of my favorite singers- Rick Sanford, formerly of Legs Diamond. I was waiting for the ballad to come to light, and it finally did with 'Guilty As Charged'. The blazing guitars are screaming for attention, but the spotlight truly shines on Vescera vocals.\n\n'Marshall Law' is a song that just won't die for OBSESSION. This is a great CD for any hard rock or metal fan worldwide.\nBand Lineup:\n\n    * Mike Vescera - Vocals (Killing Machine, The Reign of Terror, Palace of Black, Safe Haven, Roland Grapow, ex-MVP, ex-Loudness, ex-Yngwie J. Malmsteen, ex-Dr. Sin)\n    * Chris McCarvill - Bass (X Factor X, Safe Haven)\n    * Jay Mezias - drums\n    * Scott Boland - Guitar\n    * John Bruno - Guitar\n\n \n\tTrack Listing:\n\n   1. Smoking Gun\n   2. Carnival Of Lies\n   3. In For The Kill\n   4. Playing Dead\n   5. Imagining\n   6. The Offering\n   7. Pure Evil\n   8. I Don't Belong\n   9. Written In Blood\n  10. Guilty As Charged\n  11. Marshall Law\n  12. Judas\n","torrent":{"xt":"urn:btih:822f0a1dcd28a58e23bf0456c5be7e4017a59748","amp;dn":"Obsession+-+Carnival+Of+Lies+2006+-+Great+Album","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"822f0a1dcd28a58e23bf0456c5be7e4017a59748","infoHashBuffer":{"type":"Buffer","data":[130,47,10,29,205,40,165,142,35,191,4,86,197,190,126,64,23,165,151,72]},"announce":[],"urlList":[]}}