{"title":"Bollywood Actress pic mega collection","uid":5493688,"size":8697449,"categoryP":"other","categoryS":"pictures","magnet":"?xt=urn:btih:82f468bce2180c713b8eab9278da73ff695e65d3&amp;dn=Bollywood+Actress+pic+mega+collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bard777","files":32,"time":1271148472,"description":"Aegis v2.7.3\n\n[UPDATE : I have been trying for several hours but piratebay wont let me upload the torrent file. Maybe because of the huge collection the torrent file is 500 kb itself. So I uploaded a sample torrent here with only the pics of Riya Sen. Download the actual torrent file (with over 5400 images) from here \n\nbit (dawt) ly (slash) 9JAC0f\ndelete the space in between and replace (dawt) by . and (slash) by /  ]\n\nContent : Huge collection of Pics of Bollywood / Indian actresses (with a special category of animated gif). Bonus section contains Sania Mirza, Emma Watson, Claudia Ciesla.\n\nQuality : HQ. All of the Low Resolution pics (Lower than 500 X x, though with valid exceptions) have been separated into a folder labelled LQ. If you don't want small pics, then skip that folder.\n\nPreview gallery : http://imagefap.com/gallery.php?gid=2220132&amp;view=1\n\nThis collection is built over a year. I've manually worked hard to clear out duplicates/duplicates with smaller resolution and categorize all pics properly (Some folders, most notably that of Kareena and Katrina haven't been owing to the larger collection). But there will, obviously, be mistakes and discrepancies (especially with my ongoing insomnia). I kinda have OCD, I want to make it purr-fect and any mistakes in categorization (wrong pic in wrong folder) or any duplicates (*exactly* same pic at same or different resolution) brought to notice will be ratified in next version and gratefully acknowledged.\n\nBeing a software geek I love naming stuff in a geek way. So Aegis is the code name of this project. When new pics are added and duplicates eliminated, a new version will be released.\n\nIntellectual property rights : If I could, I'd probably say fuck that, but since I can't, I acknowledge that none of the pics are owned by me. I just collected em off net. All pics are the rights of the photographer (and the assets of the photographed belong to those who were photographed). Enough ranting!\n\n\nSPECIAL NOTE :- This is not a pr0n collection. There is some nudidy as is expected in glam world, but if your brain can't make the distinction between artistic nudity and pr0n then fuck off! This collection also features underage people (without nudity, I abhor kiddie pr0n). So if you're hoping to satiate that perverted desire of yours, rather look for my other project Obscerenity (Celebrity fakes / nudes). You have been told! If you still whack off to kids' pics, I can't do anything but you'd know you're a paedophile. Your conscience will eat away at your heart till you die. Thanks for listening to more of my rants.\n\n\n&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;Another fine upload by bard777","torrent":{"xt":"urn:btih:82f468bce2180c713b8eab9278da73ff695e65d3","amp;dn":"Bollywood+Actress+pic+mega+collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82f468bce2180c713b8eab9278da73ff695e65d3","infoHashBuffer":{"type":"Buffer","data":[130,244,104,188,226,24,12,113,59,142,171,146,120,218,115,255,105,94,101,211]},"announce":[],"urlList":[]}}