{"title":"Pernice Brothers - Goodbye, Killer [2010][EAC,log,cue. FLAC]","uid":8726665,"size":229968625,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:84aeedcba6fe28786db800dae4efe4ab5957f070&amp;dn=Pernice+Brothers+-+Goodbye%2C+Killer+%5B2010%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dickspic","files":13,"time":1374521603,"description":"Artist:Pernice Brothers\nRelease:Goodbye, Killer\nReleased: 2010\nLabel: One Little Indian\nCatalog#: TPLP 1073CD\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle:americana\n\n01 bechamel\n02 jacqueline susann\n03 we love the stage\n04 the loving kind\n05 something for you\n06 goodbye, killer\n07 the great depression\n08 newport news\n09 fucking and flowers\n10 the end of faith\n\nFour years separated the Pernice Brothers' Goodbye, Killer and their previous album, Live a Little, the longest gap between LPs since Joe Pernice formed the band in 1998, and anyone who was expecting some sort of epochal creation to emerge after this layoff is in for a surprise -- Goodbye, Killer runs just a shade over 32 minutes, and most of its ten songs zip along with a pace that suggests this set was not intended to generate the emotional gravity that usually comes as second nature to Pernice. (For the record, Pernice wasn't just goofing off during that four-year gap -- he published a novel and released a solo album of songs referenced in the book.) Goodbye, Killer also finds Joe Pernice working without his usual guitarist Peyton Pinkerton, whose tasteful but expressive leads were the cornerstone of the group's sound, so it's no great surprise that Pernice reaches for different musical approaches on several of these tracks. The first two numbers, &quot;Bechamel&quot; and &quot;Jacqueline Susann,&quot; recall '70s glam rock in their straightforward, guitar-based punch, and the swagger of Pernice's vocals (a big step away from the dour whisper that's his trademark as a singer), &quot;Newport News&quot; resembles the easy but resonant twang of vintage country rock, and &quot;We Love the Stage&quot; is a bitterly witty tale of life on the road that sounds almost jaunty in its piano-based arrangement and lines like &quot;it doesn't matter if the crowd is thin/we sing to six the way we sing to ten.&quot; The rest of the album travels a more familiar stylistic path, but with Pernice's brother Bob Pernice back in the fold, the guitars sound crisper and more aggressive, and if pop and vintage soft rock are still obvious stylistic touchstones, Goodbye, Killer has a bite that separates it from the Pernice Brothers' previous releases. This music sometimes feels spontaneous and casual, but the craft of Joe Pernice's songwriting remains as literate and melodically absorbing as anyone working in indie pop today, and Goodbye, Killer confirms he and his collaborators haven't lost their touch, and have even gained a bit or edgy nerve along the way.","torrent":{"xt":"urn:btih:84aeedcba6fe28786db800dae4efe4ab5957f070","amp;dn":"Pernice+Brothers+-+Goodbye%2C+Killer+%5B2010%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84aeedcba6fe28786db800dae4efe4ab5957f070","infoHashBuffer":{"type":"Buffer","data":[132,174,237,203,166,254,40,120,109,184,0,218,228,239,228,171,89,87,240,112]},"announce":[],"urlList":[]}}