{"title":"midnight express","uid":8858526,"size":4408833530,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:866037efd3e71146d8382dafff7ddd23be828fc7&amp;dn=midnight+express&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":2,"time":1377719852,"description":"Op 6 oktober 1970 wordt de Amerikaanse Billy Hayes gearresteerd nadat hij drugs uit Turkije wilde smokkelen. Hij krijgt een gevangenisstraf van vier jaar en twee maanden. Hayes wordt naar de Turkse SaÄŸmalcÄ±lar-gevangenis gestuurd, waar hij zijn straf zal gaan uitzitten. Na zijn aankomst raakt hij al snel bevriend met twee andere Amerikaanse gevangenen, en bedenken ze een ontsnappingsplan. Dit werd echter al snel ontdekt door een informant die voor de gevangenis werkt.\n\nNa deze mislukte ontsnapping kreeg Hayes 30 jaar extra gevangenisstraf van de Turkse rechtbank. Zijn psychische en fysieke gezondheid ging steeds sneller achteruit. Dit kwam mede door de mishandeling door de gevangenisbewaarders en het hoofd van de gevangenis. Omdat zijn gezondheid dermate achteruit ging werd hij overgeplaatst naar een psychiatrische afdeling binnen de gevangenis. Op die afdeling ging zijn gezondheid nog verder achteruit, en probeerde hij het hoofd van de gevangenis om te kopen. Deze poging mislukte ook, en Hayes werd meegenomen naar een kamertje. Uiteindelijk vermoordde Hayes het hoofd van de gevangenis, nadat deze Hayes wilde verkrachten. Na de moord trok Hayes het uniform van de hoofd aan, en liep hij zonder enige problemen uit de gevangenis. Hij kwam op 25 oktober 1975 veilig aan op Amerikaanse grond.\n\n\nOn October 6, 1970 while boarding an international flight out of Istanbul Airport, American Billy Hayes is caught attempting to smuggle 2 kilos of hashish out of the country, the drugs strapped to his body. He is told that he will be released if he cooperates with the authorities in identifying the person who actually sold him the hash. Billy's troubles really begin when after that assistance, he makes a run for it and is recaptured. He is initially sentenced to just over four years for possession, with no time for the more harsh crime of smuggling. The prison environment is inhospitable in every sense, with a sadistic prison guard named Hamidou ruling the prison, he who relishes the mental and physical torture he inflicts on the prisoners for whatever reason. Told to trust no one, Billy does befriend a few of the other inmates, namely fellow American Jimmy Booth (in for stealing two candlesticks from a mosque), a Swede named Erich, and one of the senior prisoners having already","torrent":{"xt":"urn:btih:866037efd3e71146d8382dafff7ddd23be828fc7","amp;dn":"midnight+express","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"866037efd3e71146d8382dafff7ddd23be828fc7","infoHashBuffer":{"type":"Buffer","data":[134,96,55,239,211,231,17,70,216,56,45,175,255,125,221,35,190,130,143,199]},"announce":[],"urlList":[]}}