{"title":"GÃƒÂ¶sta Berlings Saga - 1924 - Mauritz Stiller DVDFull","uid":5480880,"size":7702829056,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:87b44fcd94e4c7f469cd7438cd39553219d01bbc&amp;dn=G%C3%83%C2%B6sta+Berlings+Saga+-+1924+-+Mauritz+Stiller+DVDFull&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jkdornelles","files":-1,"time":1270417018,"description":"kindly released on kg by gustavjohnsson &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0014109/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0014109/&lt;/a&gt;\n\n-------------------------------------------------------------------------------\n\nPlot Synopsis by Hal Erickson\n\nKnown under a variety of titles, The Atonement of Gosta Berling is an excellent representation of the Swedish silent cinema. Long, complex, and elaborately produced, the film nonetheless never loses sight of the human elements which motivate the story. Lars Hanson stars as Berling, a defrocked priest whose rebellious attitude hides a greater sense of idealism than most of his &quot;pious&quot; contemporaries. Among the women in Berling's life is a supposedly married countess, played with instinctive brilliance by a young, awkward, chubby Greta Garbo. Overflowing with betrayals, revenge, and regeneration, Atonement of Gosta Berling has enough plots for ten films. American audiences generally saw a severely truncated version, running approximately half the film's original length. What was left was enough for MGM to invite director Mauritz Stiller and star Greta Garbo to Hollywood, though in typically callous big-studio fashion, Garbo was retained while Stiller was permitted to wither on the vine.\n\nThe film was originally released as two parts in Sweden, GÃƒÂ¶sta Berlings saga del I on 10 March 1924, and GÃƒÂ¶sta Berlings saga del II seven days later. The two part version was also used in Finland and Norway, but for the rest of the world a shorter, one part export version was made.\n\nIn 1927 the film was recut, shortening it with almost half the running time. This is the version that was archived for the future. In 1933 a sound version was released theatrically in Stockholm, with the intertext cut out, along with additional cutting and altered chronology for some of the scenes.\n\nTwenty years later most of the missing material was discovered, and a restored version with new intertext was again released in theatres. This version has since had new parts added now and then throughout the years as they have been found. As of today, about 450 meter of film from the original cut is still missing. In 2005 the film was given a celebrated new score by pianist and silent film music composer Matti Bye.\n\n\nExtras include:\n-Garbo PUB Commercials\n-Petter the Tramp\n-Documentary with Garbo onboard ship to America\n-Photo gallery\n-Images from the shooting\n\n\nLanguage:Swedish\nSubtitles included: French, English, German, Spanish, Portuguese\n\nDVD Source: R2, DVD9\nDVD Format: PAL\nProgram: DVDShrink\n\nMenus: Untouched\nVideo: Untouched\nAudio: Untouched\nDVD extras: Untouched\n\nGeneral:\n\nFile Size: 7345,60 MiB\nDuration: 02:17:58\n\nVideo:\nFormat: MPEG Video\nBitrate: 4 402 Kbps\nStandard: PAL\nFrame Rate: 25.000 fps\nScan Type: Progressive\nBits/(Pixel*Frame): 0.425\nResolution: 720x576\n\nAudio 1:\nFormat: AC-3\nBitrate: 448 Kbps\nChannels: 6 channels\nSampling Rate: 48.0 KHz\n\n*********************************** FREAKYFLICKS************************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE","torrent":{"xt":"urn:btih:87b44fcd94e4c7f469cd7438cd39553219d01bbc","amp;dn":"G%C3%83%C2%B6sta+Berlings+Saga+-+1924+-+Mauritz+Stiller+DVDFull","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87b44fcd94e4c7f469cd7438cd39553219d01bbc","infoHashBuffer":{"type":"Buffer","data":[135,180,79,205,148,228,199,244,105,205,116,56,205,57,85,50,25,208,27,188]},"announce":[],"urlList":[]}}