{"title":"Earl Hooker Sweet Black Angel(blues)(mp3@320)[rogercc]","uid":5616424,"size":67604432,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:87c16cee07fe74946cad53933e67497ed33c812c&amp;dn=Earl+Hooker+Sweet+Black+Angel%28blues%29%28mp3%40320%29%5Brogercc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rogercc","files":11,"time":1276043496,"description":"EARL HOOKER SWEET BLACK ANGEL\nReleased: 1970\nLabel: MCA\nFormat: Mp3@320\nTime: 28:08 \n\n\n\nIf there was a more immaculate slide guitarist residing in Chicago during the 1950s and '60s than Earl Hooker, his name has yet to surface. Boasting a fretboard touch so smooth and clean that every note rang as clear and precise as a bell, Hooker was an endlessly inventive axeman who would likely have been a star had his modest vocal abilities matched his instrumental prowess and had he not been dogged by tuberculosis (it killed him at age 41).\nBorn in the Mississippi Delta, Hooker arrived in Chicago as a child. There he was influenced by another slide wizard, veteran Robert Nighthawk. But Hooker never remained still for long. He ran away from home at age 13, journeying to Mississippi. After another stint in Chicago, he rambled back to the Delta again, playing with Ike Turner and Sonny Boy Williamson. Hooker made his first recordings in 1952 and 1953 for Rockin', King, and Sun. At the latter, he recorded some terrific sides with pianist Pinetop Perkins (Sam Phillips inexplicably sat on Hooker's blazing rendition of &quot;The Hucklebuck&quot;).\nBack in Chicago again, Hooker's dazzling dexterity was intermittently showcased on singles for Argo, C.J., and Bea &amp; Baby during the mid-to-late '50s before he joined forces with producer Mel London (owner of the Chief and Age logos) in 1959. For the next four years, he recorded both as sideman and leader for the producer, backing Junior Wells, Lillian Offitt, Ricky Allen, and A.C. Reed and cutting his own sizzling instrumentals (&quot;Blue Guitar&quot;, &quot;Blues in D-Natural&quot;). He also contributed pungent slide work to Muddy Waters' Chess waxing &quot;You Shook Me&quot;. Opportunities to record grew sparse after Age folded; Hooker made some tantalizing sides for Sauk City, Wisconsin's Cuca Records from 1964 to 1968 (several featuring steel guitar virtuoso Freddie Roulette).\nHooker's amazing prowess (he even managed to make the dreaded wah-wah pedal a viable blues tool) finally drew increased attention during the late '60s. He cut LPs for Arhoolie, ABC-BluesWay, and Blue Thumb that didn't equal what he'd done at Age, but they did serve to introduce Hooker to an audience outside Chicago and wherever his frequent travels deposited him. But tuberculosis halted his wandering ways permanently in 1970. ~ Bill Dahl, All Music Guide\n\n1. Funky Blues [2:26]\n2. I Feel Good [2:02]\n3. Drivin' Wheel [3:18]\n4. Shuffle [2:49]\n5. Country and Western [3:04]\n6. Sweet Home Chicago [2:51]\n7. Sweet Black Angel [2:31]\n8. Boogie, Don't Blot! [2:25]\n9. Crosscut Saw [2:24]\n10. Catfish Blues [2:36]\n11. The Mood [1:37]\n\n","torrent":{"xt":"urn:btih:87c16cee07fe74946cad53933e67497ed33c812c","amp;dn":"Earl+Hooker+Sweet+Black+Angel%28blues%29%28mp3%40320%29%5Brogercc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87c16cee07fe74946cad53933e67497ed33c812c","infoHashBuffer":{"type":"Buffer","data":[135,193,108,238,7,254,116,148,108,173,83,147,62,103,73,126,211,60,129,44]},"announce":[],"urlList":[]}}