{"title":"Watchmen 1080p","uid":5619272,"size":14053020972,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:8ca3616259427e2a6a3dcf63a13b00d727401f1e&amp;dn=Watchmen+1080p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jjjacco7","files":2,"time":1276197270,"description":"Plot Summary for Watchmen (2009) \n\n \nIn a gritty and alternate 1985 the glory days of costumed vigilantes have been brought to a close by a government crackdown, but after one of the masked veterans is brutally murdered an investigation into the killer is initiated. The reunited heroes set out to prevent their own destruction, but in doing so discover a deeper and far more diabolical plot. Written by evan murphy\n\n&quot;Watchmen&quot; is set in an alternate 1985 America in which costumed superheroes are part of the fabric of everyday society, and the &quot;Doomsday Clock&quot; - which charts the USA's tension with the Soviet Union - is permanently set at five minutes to midnight. When one of his former colleagues is murdered, the washed up but no less determined masked vigilante Rorschach sets out to uncover a plot to kill and discredit all past and present superheroes. As he reconnects with his former crime-fighting legion - a ragtag group of retired superheroes, only one of whom has true powers - Rorschach glimpses a wide-ranging and disturbing conspiracy with links to their shared past and catastrophic consequences for the future. Their mission is to watch over humanity... but who is watching the Watchmen?","torrent":{"xt":"urn:btih:8ca3616259427e2a6a3dcf63a13b00d727401f1e","amp;dn":"Watchmen+1080p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ca3616259427e2a6a3dcf63a13b00d727401f1e","infoHashBuffer":{"type":"Buffer","data":[140,163,97,98,89,66,126,42,106,61,207,99,161,59,0,215,39,64,31,30]},"announce":[],"urlList":[]}}