{"title":"True Legend [2010] DvdRip HardCoded XviD","uid":5525440,"size":734981817,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8f441ccf6b847c4738f3a7ca3e69e7a42b402f84&amp;dn=True+Legend+%5B2010%5D+DvdRip+HardCoded+XviD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"xults","files":15,"time":1272756232,"description":"\n\nTrue Legend [2010] DvdRip XviD [AR 1.82]\n\nHardcoded English subtitles during Mandarin dialogue!\n\nOne of the final performances by actor David Carradine, who died in a bizarre accident in Bangkok during post-production.\n\nPlot...\nTrue Legend is the extraordinary journey of a man - a martial arts hero - whose greatest dream is to create a unique school of martial arts for the world to follow.\nAll his life, Su Can has been pursuing the summit in martial arts. There are two things he holds dearest to his heart - the dream of creating a unique kind of martial arts that will pass on to generations; and his beloved wife. Su has a happy family and his wife is the joy of his life. But owing to a turn of fate and Su's own stubbornness, he loses his wife and his family is destroyed.\nAfter losing his wife, Su cannot live with himself and collapses totally. He is drunk all the time and becomes a crazy beggar in everyone's eyes. Everyday, his young son ties him with a piece of rope and leads him through the streets, greeted by people's curious and disdainful gazes.\nBut all this time during his spiritual exile, his dream for the highest peak in martial arts is still alive. In his madness, Su continues his practice, to perfect his skills and fists.\nThe flim begins with a prologue stating the inevitable fall of the Qing Dynasty and how the people remain defiant. The practice of Wushu flourishes in the Middle Kingdom and a new warrior will arise.\n\nReview...\nYuen Woo Ping! Are you familiar with that name yet or not? Many films struggle to reach my top ten list, but The Matrix and Crouching Tiger, Hidden Dragon are two that definitely deserve to be contenders for those ranks. Su Qi-Er I thought might be even better than both of those movies possibly as far as cinema being a carefully practiced art form goes. It blended some classic and modern approaches.\n\nEven if it had wire-fu wushu computer animated action sequences at times, that isn't something I am particularly prejudiced against. What really matters is good story telling and writing and acting, and well...many things, etc. The lead actor and actress I thought were really great at times and I definitely have to contribute that to the director's credit, especially since he has a lot more experience than them. Holy sweetness! Gordon Liu, Michelle Yeoh, and David Carradine!? Great to get to see them all act, they were all superb even though they weren't the main stars. Seriously, how does Carradine keep coming out with all these posthumous films? Did he make a robot clone? Costumes, music, action choreography, makeup, lighting, sound, casting, animetors, etc.: all of these people came together and did amazingly fantastic jobs to make the picture as a whole really a superb film. There were some very nice nature images that were quite artfully done almost like a master painter's ink brushstroke. The story was captivating. I didn't think I felt like it ever really began to drag on too long at any one time the way many other films seem to do. Everything about it is really great. I highly suggest this film to everyone! (except oh yeah, there's a few sort of bloody violent parts, so maybe if that's not your bag then don't go for it , but then if it is your craving to have a little well-written action movie then...) Sweet!!!\n\nVIDEO   \n\nSize.... 700MB                                  \n                                                 \nDuration.... 01:54:37                            \n                                   \nCodec.... XviD                     \n                                   \nFrame Width.... 640                                   \n                                  \nFrame Height.... 352               \n                                  \nData Rate.... 725kbps             \n                                   \nFrame Rate.... 25 F/S               \n\nAUDIO\n\nBit Rate.... 128kbps.... MP3\n\n2 Channel Stereo\n\nAudio Sample Rate.... 48 KHz\n\nBits Per Sample 16 Bit/Sample\n\nIMDB........   &lt;a href=&quot; http://www.imdb.com/title/tt1425257/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt1425257/&lt;/a&gt;\n\nWIKI........   &lt;a href=&quot; http://en.wikipedia.org/wiki/True_Legend&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://en.wikipedia.org/wiki/True_Legend&lt;/a&gt;\n\nDirector:   Woo-ping Yuen\nWriter: v   Chi-long To (screenplay)\n\nVincent Zhao         ... So Chan / So Hat-Yi / Beggar So\nZhou Xun             ... Ying\nMichelle Yeoh        ... Dr. Yu\nJay Chou             ... God Of Washu/Drunken God\nAndy On              ... Yuan Lie\nDavid Carradine      ... Anton\nGuo Xiaodong         ... Colonel Ma\nFeng Xiaogang        ... Pick pocket\nCung Lee             ... Militia Leader\nGordon Liu           ... Old Sage\nLeung Ka Yan         ... Su Wankun\nJacky Heung          ... Imperial Prince\nYan Ni               ... Bar Owner\nWill Liu             ... Iron Lad\nJiang Luxia          ... Iron Maiden\nLi Zo                ... Little Feng (age 5)\nSuen Hanwen          ... Little Feng (age 8)\nConan Stevens        ... Malotoff\nSylvester Tarkey     ... Elder Scot Brother\nMatt Weise           ... Younger Scot Brother\nDominique Vandenberg ... Bald One-Eye","torrent":{"xt":"urn:btih:8f441ccf6b847c4738f3a7ca3e69e7a42b402f84","amp;dn":"True+Legend+%5B2010%5D+DvdRip+HardCoded+XviD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f441ccf6b847c4738f3a7ca3e69e7a42b402f84","infoHashBuffer":{"type":"Buffer","data":[143,68,28,207,107,132,124,71,56,243,167,202,62,105,231,164,43,64,47,132]},"announce":[],"urlList":[]}}