{"title":"Helium Music Manager 7.1 Build 8475(Murlok)","uid":5618235,"size":13777518,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:93321581577386404e8308e19df93104117ca271&amp;dn=Helium+Music+Manager+7.1+Build+8475%28Murlok%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Murlok","files":-1,"time":1276152747,"description":"With Helium Music Manager, you can take control of your music collection. Stop spending time looking for files on your computer or hunting through CDs, vinyl records and tapes - instead, simply enjoy and explore your music! Rip, locate, play, edit tags and burn your favourite music. Download and display lyrics, album reviews, artist biographies and more. This music management software is very easy to work with, and you can start exploring your music collection right away. Helium Music Manager contains all the functions you need to enjoy and organize MP3s, CDs and vinyls - integrated into one application. Helium Music Manager is not just another way of playing your music - it's a full-fledged music manager with many different ways of exploring and playing your music.\n\nKey features:\n- Edit artist, album and track information by manually typing, by reading information from the filenames or by downloading information from Internet sources.\n- Automatically rename files and create folder structures based on the track information\n- Create and print reports\n- Add, update and download album pictures\n- Burn Audio CD's\n- Create and manage playlists and smart playlists\n- Analyze the quality of MP3 files and repair files with problems\n\n#\n\nImport\n    Import\n\n    Supports mp3, mp4, flac, ogg, wma and more as well as audio CDs, vinyl and tapes.\n\n    For user with large collections we offer support for Microsoft SQL Server and MySQL for improved performance.\n\n#\n\nnew_manage.gif\n    Manage\n\n    Download album pictures, analyze quality and repair broken mp3 files.\n\n    Automatically rename files and create custom folder structures, convert files to different formats.\n\n#\n\nPlay\n    Play\n\n    Play music, scrobble to Last.fm, stream through Shoutcast. Show your friends what you are playing on Windows Live Messenger.\n\n    Display visual effects and enjoy automatic playback with built-in features.\n\n#\n\nnew_tag.png\n    Tag\n\n    Add or correct missing or incorrect meta-data using the many tools available for tagging your files.\n\n    Remove, switch, add or copy tag contents between files and fields using batch operations.\n\n#\n\nExplore\n    Explore\n\n    Many different ways of browsing your music. Album and artist pictures as well as detailed listings.\n\n    Easily filter your content, search for your favourites and create playlists.\n\n#\n\nOn-the-go\n    On-the-go\n\n    Synchronize to your iPod, Creative Zen or other portable music device, cell phone or netbook.\n\n    Burn Audio or Data CDs, export playlists and create reports for printing.\n\nEnjoy","torrent":{"xt":"urn:btih:93321581577386404e8308e19df93104117ca271","amp;dn":"Helium+Music+Manager+7.1+Build+8475%28Murlok%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93321581577386404e8308e19df93104117ca271","infoHashBuffer":{"type":"Buffer","data":[147,50,21,129,87,115,134,64,78,131,8,225,157,249,49,4,17,124,162,113]},"announce":[],"urlList":[]}}