{"title":"POTHS - Jesus of Nazareth with Passion of The Christ","uid":5477978,"size":4761279058,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9333036cf39b228eac26fe2fe231f141be584c5c&amp;dn=POTHS+-+Jesus+of+Nazareth+with+Passion+of+The+Christ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"awaken888","files":16,"time":1270244032,"description":"POTHS - Pouring Out The Holy Spirit - Upload POTHS everywhere - POTHS - Pointing Out The Hellish Scumbags,\t\n\nThis torrent is on a high speed SEED BOX. perf029c.xirvik.net is the server for the SEED BOX\n\nOver the Last 6 years I have uploaded a zillion copies of Jesus of Nazareth, probably 5,000,000 times minimum and maybe many times more than that. It is the most Popular Biblical Torrent I have ever had. It is very accurate in Biblical accuracy. For those of you searching for some answers and truth about what is happening in these days of lies and deceit, you may find some peace and comfort in Christ, as truth is revealed in these videos.\n\nIn the 1970's when Jesus of Nazareth was released as a mini-series for Television there was very little extreme injuries or bloody battles allowed to be view by the public. The kindness of Jesus could be shown on the screen but the BEATING the Jesus took could not be accurately shown on television or even the movies for that matter in the early 70's. Mel Gibson's Passion of the Christ depicts a much more realistic version of what really happened when they took our Lord and Savior, Jesus Christ.\n\n[b]BORN OF A VIRGIN, HE WAS KILLED FOR OUR TRANSGRESSIONS, HIS BLOOD WAS SHED AS A SACRIFICE TO ATONE FOR MY SINS. HE WAS BURIED AND ROSE THREE DAYS LATTER. PRAISE THE LORD FOR HE HAS RISEN. I AM FORGIVEN FOR MY SINS AND CAN NOW LIVE THE LORD IN ETERNITY.[/b]\n\nPOTHS - Pouring Out The Holy Spirit - Upload POTHS everywhere - POTHS - Product of The Holy Spirit\n\n[b]Seed Long and Prosper from the Blessings of Yahweh. I Have ask Yahweh to Bless all those who Seed Long.[/b]\n\n\nBelieve nothing you find here, Search The scriptures daily for the truth.","torrent":{"xt":"urn:btih:9333036cf39b228eac26fe2fe231f141be584c5c","amp;dn":"POTHS+-+Jesus+of+Nazareth+with+Passion+of+The+Christ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9333036cf39b228eac26fe2fe231f141be584c5c","infoHashBuffer":{"type":"Buffer","data":[147,51,3,108,243,155,34,142,172,38,254,47,226,49,241,65,190,88,76,92]},"announce":[],"urlList":[]}}