{"title":"Legendarische kluchten - Drie Is Teveel - ZARCK 2Lions-Team","uid":5647763,"size":4526271479,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:93f47709952537ea3b3fb67d1a50d6aa0858a5a1&amp;dn=Legendarische+kluchten+-+Drie+Is+Teveel+-+ZARCK+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"crazyadriaan","files":23,"time":1277422164,"description":"Drie is teveel\n\nDrie is teveel brengt ons terug naar de dertiger jaren. De familie Gravesande is in nerveuze afwachting van de komst van de steenrijke familie Oldenbach. Deze heeft een huwbare zoon in de aanbieding en een verbintenis met de dochter des huizes zou dan ook geen slechte zaak zijn. Alles wordt uit de kast gehaald om de Oldenbachjes grandioos te ontvangen, maar dan slaat het noodlot toe. Het hoofd van de huishouding, hun steun en toeverlaat in deze spannende tijden, dondert van de trap en dreigt de zorgvuldig voorbereide ontvangst in duigen te laten vallen. Volledig ten einde raad doen ze een beroep op de toevallig aanwezige monteur van de verwarmingsketel, Driekus, om hun huisknecht te vervangen. Hadden ze beter niet kunnen doen, want vanaf dat moment loopt alles letterlijk en figuurlijk in de soep...\n\nDit is een oude klucht dus verwacht geen enorme kwaliteit of 3D effecten maar wel een paar uur hilarisch lachen.\nBij voldoende belangstelling blijf ik de komende weken 1 of 2 van deze dvd's per dag plaatsen dus ik hoop dat wij Nederlanders ook blijven seeden na de download, het zou jammer zijn als dit een dode torrent wordt.\n\n \n\nBrought to you by \n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n                    &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers, get a life !!!","torrent":{"xt":"urn:btih:93f47709952537ea3b3fb67d1a50d6aa0858a5a1","amp;dn":"Legendarische+kluchten+-+Drie+Is+Teveel+-+ZARCK+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93f47709952537ea3b3fb67d1a50d6aa0858a5a1","infoHashBuffer":{"type":"Buffer","data":[147,244,119,9,149,37,55,234,59,63,182,125,26,80,214,170,8,88,165,161]},"announce":[],"urlList":[]}}