{"title":"Paycheck (2003) PAL (ENG FR)( ENG FR ARA NL SUBS) 2Lions-Team","uid":5616235,"size":4681846520,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:94cedd097a7da991a0da276977fe852dec67793f&amp;dn=Paycheck+%282003%29+PAL+%28ENG+FR%29%28+ENG+FR+ARA+NL+SUBS%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Pioen","files":-1,"time":1276077908,"description":"Paycheck (2003) PAL       \n\n\nVerenigde Staten\nScience-Fiction / Thriller\n119 minuten\n\ngeregisseerd door John Woo\nmet Ben Affleck, Uma Thurman en Aaron Eckhart\n\nEen ingenieur werkt al drie jaar lang aan een geheim project. Op een dag wordt hij wakker en ontdekt dat zijn werkgever de delen van zijn geheugen die over het project gaan, heeft gewist. Wanneer hij zijn 'paycheck' wil ophalen blijkt dat hij heeft ingestemd met betaling in zonderlinge voorwerpen in plaats van geld. Hij probeert radeloos de stukjes uit zijn geheugen terug te vinden terwijl blijkt dat ook de overheid achter hem aan zit. Gebaseerd op een verhaal van Philip K. Dick\n\n\nEnglish\n\nMichael Jennings is a reverse engineer and what he does is technical jobs for certain companies and as soon as he is done, his memory of the work he has done is wiped out. Now the longest he has been contracted is 2 months. But now billionaire, James Rethrick offers him a job that would last 2 years, maybe 3, and he promises that he will probably earn 8 figures. Michael agrees. Before beginning he turns in all of his personal effects. And when the job is done, his memory is erased and he learns he made over 90 million dollars over the three years. When he goes to claim it and his personal effects, he discovers that prior to the erasure of his memory he waived his rights to the money he earned and that the items that were given to him were not the ones he gave when he began. Later he is arrested by the FBI who say that he committed some act of treason and murder. It's while he is in custody that he escapes using some the items that he was given. He later meets with a friend who gives him some information that helps him understand what is going on. And at the same time Rethrick for some reason wants him so he is being pursued by Rethrick's people.\n\n\nCategorie : Beeld \nFormaat : DVD5 Pal\nBron : Retail\nAudio : English French 5.1 \nSubs : English, Dutch, French, Arabic\nMenu : Yes \nGenre : Science Fiction\nThriller \n\n\n \nWeblink : &lt;a href=&quot; http://www.moviemeter.nl/film/12675&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.moviemeter.nl/film/12675&lt;/a&gt;\nWeblink : &lt;a href=&quot; http://www.imdb.com/title/tt0338337&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0338337&lt;/a&gt;\n\n*****************************************\n\nBrought to you by \nPioen\n\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\n\n\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\t \n\n \n \n \n","torrent":{"xt":"urn:btih:94cedd097a7da991a0da276977fe852dec67793f","amp;dn":"Paycheck+%282003%29+PAL+%28ENG+FR%29%28+ENG+FR+ARA+NL+SUBS%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94cedd097a7da991a0da276977fe852dec67793f","infoHashBuffer":{"type":"Buffer","data":[148,206,221,9,122,125,169,145,160,218,39,105,119,254,133,45,236,103,121,63]},"announce":[],"urlList":[]}}