{"title":"Librivox M4B - Golden Snare by James Oliver Curwood","uid":5521351,"size":181722638,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:94faee4d03b59ca49ae1d2bbdc27a29a26b34ed1&amp;dn=Librivox+M4B+-+Golden+Snare+by+James+Oliver+Curwood&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"VoxRatio","files":-1,"time":1272585722,"description":"With but two years of service in the RNMP Philip Raine finds himself somewhat unwillingly on the trail of Bram Johnson, wanted for murder and a wild, untamed and savage man who commands a pack of wolves as his brethren.\n\nBut most peculiar of all is the snare which Bram had had in his possession and had somehow lost. It was a golden snare intricately woven out of the finest, most delicate flaxen hair of a woman. But what could possibly be the relationship between this half-human murderer and a woman who could have borne a crown of such beauty and elegance? The mystery of Bram Johnson and his wolves and the golden snare becomes one which Raine feels compelled to unravel even as he pursues the wild man and his pack among his own territory of the Canadian barren lands.\n(Summary by Roger Melin)\n\n\nAn M4B file is an audio file which can be bookmarked. This is the audio-book file type. These files can have chapter markers which can be skipped through as you would skip through files on a play list. They can have built in cover art and chapter images. They will remember where you left off each time you stop the file and come back to it . And variable speed settings on Ipods and a growing number of other mp3 players can be utilized by this file type. The ability to bookmark allows for as little as one large file instead of many small ones without the burden of fast forwarding to find your spot every time you resume listening or the fear of otherwise losing your place. The reduced number of files also makes browsing through your files to find your book and your place in it much less effort.\n","torrent":{"xt":"urn:btih:94faee4d03b59ca49ae1d2bbdc27a29a26b34ed1","amp;dn":"Librivox+M4B+-+Golden+Snare+by+James+Oliver+Curwood","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94faee4d03b59ca49ae1d2bbdc27a29a26b34ed1","infoHashBuffer":{"type":"Buffer","data":[148,250,238,77,3,181,156,164,154,225,210,187,220,39,162,154,38,179,78,209]},"announce":[],"urlList":[]}}