{"title":"Stander.2003.DVDRIP.XVID [Thomas Jane]","uid":5599326,"size":735903463,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:95fd2c3a85543d7343ce2d1ace5cde0841c6c9bf&amp;dn=Stander.2003.DVDRIP.XVID+%5BThomas+Jane%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"thelad53","files":53,"time":1275213981,"description":"Description:\nStander (2003)\n\nwww.imdb.com/title/tt0326208/\n\nRated: R for violence, language, some sexuality and nudity\nRuntime: 1 hr 56 mins\nGenre: Action/Adventure\nTheatrical Release:Aug 6, 2004 Limited\n\nStarring: Thomas Jane, Dexter Fletcher, Deborah Kara Unger, Marius Weyers, Ashleigh Taylor\n\nDirector: Bronwen Hughes\n\nDirector: Bronwen Hughes\nScreenwriter: Ken Friedman, Bronwen Hughes\nProducer: Julia Verdin, Marty Katz\nStudio: Newmarket Films\n\nSynopsis:   STANDER is the gripping true story of the life of Andre Stander, the youngest Captain in the Johannesburg Police Force and South Africa s most notorious bank robber. Portrayed by Tom Jane (The Punisher, 61*) in a mercurial, star-turn performance, Andre Stander is a young, white policeman enjoying the comforts of middle-class married life in late-1970s South Africa, a country riven by Apartheid. Deeply affected by the indiscriminate killing he witnesses and takes part in during Riot Patrol, Stander wordlessly makes a decision to defy the very system he has spent a lifetime enforcing. Stander s form of civil disobedience, however, takes an unusual form: a series of audacious, high-flying bank robberies, with the young police officer oftentimes returning to the scene of the crime as the lead investigating officer. Finally apprehended by his colleagues, Stander is jailed and subsequently befriends outlaws Allan Heyl and Lee McCall. Following a daring prison break, the  Stander Gang  commits dozens of bank robberies across the country, heists that grow increasingly bolder over time. In the eyes of the public, the Stander Gang s nose-thumbing disrespect for authority makes them into near-legendary folk heroes, modern-day equivalents of Bonnie &amp; Clyde. To the South African government, however, the former police officer is a cause of embarrassment, and the Stander Gang are the most wanted men in the country. Equal parts heist movie, love story, and historically accurate indictment of a corrupt political institution (on the tenth anniversary of Apartheid s end), STANDER is the most riveting, uncanny biopic in recent memory. Filmed entirely on location in South Africa, STANDER is directed by Bronwen Hughes (Forces of Nature, Harriet The Spy), and co-stars Dexter Fletcher (Lock, Stock and Two Smoking Barrels), David Patrick O Hara (Braveheart, The Devil s Own), and Deborah Kara Unger (Crash, The Hurricane, The Game) as Andre Stander s wife. --   Newmarket Films","torrent":{"xt":"urn:btih:95fd2c3a85543d7343ce2d1ace5cde0841c6c9bf","amp;dn":"Stander.2003.DVDRIP.XVID+%5BThomas+Jane%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95fd2c3a85543d7343ce2d1ace5cde0841c6c9bf","infoHashBuffer":{"type":"Buffer","data":[149,253,44,58,133,84,61,115,67,206,45,26,206,92,222,8,65,198,201,191]},"announce":[],"urlList":[]}}