{"title":"One of a Kind The Story of Stuey The Kid Ungar","uid":5476660,"size":271223857,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:983e772eba09c6216f3414e2304181eb4be75200&amp;dn=One+of+a+Kind+The+Story+of+Stuey+The+Kid+Ungar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"snuk11","files":-1,"time":1270188349,"description":"Begun as an as-told-to by Dalla with Stuey Ungar, this biography tells in painful detail the story of the poker and gin superstar. Ungar is certainly a fascinating subject. He was prodigiously dysfunctional, a manic sports bettor and cocaine addict who won an estimated $30 million during his life, but who, after his death in 1998, needed a collection from his friends to pay for his funeral. Unfortunately, the complexities of Ungar's personality aren't satisfactorily unraveled by the authors. They offer stories from the likes of poker legend Doyle Brunson and Mike Sexton, television's reigning poker guru, of Ungar's fabulous skills as a card player and spectacular need for &quot;action,&quot; but few insights into the source of Ungar's self-destructive demons: he died prematurely at age 45 from the ravages of drug abuse. Without any analysis, the repetitious account of years of poker ups and downs, sports gambling losses, manic acts of generosity and descents into drug abuse, as tragic as it is, becomes tedious. Still, without distorting or downplaying Ungar's depredations, this is a heartfelt, respectful and accepting biography. ","torrent":{"xt":"urn:btih:983e772eba09c6216f3414e2304181eb4be75200","amp;dn":"One+of+a+Kind+The+Story+of+Stuey+The+Kid+Ungar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"983e772eba09c6216f3414e2304181eb4be75200","infoHashBuffer":{"type":"Buffer","data":[152,62,119,46,186,9,198,33,111,52,20,226,48,65,129,235,75,231,82,0]},"announce":[],"urlList":[]}}