{"title":"[Volume 1-12][Hentai]Nozoki Ana[All Chapters]","uid":8701075,"size":836132358,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:98b8517e924cc989de757089fbbb7bea09637e5d&amp;dn=%5BVolume+1-12%5D%5BHentai%5DNozoki+Ana%5BAll+Chapters%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"adareloa","files":-1,"time":1374069246,"description":"General Description:\n\nNozoki Ana (ãƒŽã‚¾ã‚­ã‚¢ãƒŠ?, lit: A Peep Hole) is a Japanese manga written and illustrated by Honna Wakou about two college students, Tatsuhiko Kido and Ikuno Emiru, who are neighbors in the same apartment complex and are connected together by a small &quot;peephole&quot; between their rooms. Nozoki Ana was serialized in Shogakukan's Moba Man mobile phone manga magazine/website and released in thirteen volume compilations between October 2009 and February 2013.\n\nPlot:\n\nNozoki Ana is about an art student named Tatsuhiko Kido. After moving to Tokyo into a new apartment to attend art school he notices a hole in the wall, at first he sees nothing through the hole but one day he sees a girl masturbating so he goes to her apartment to tell her that there is a hole between the wall, he meets her and tries to chat but she walks back to her room so Kido follows her, he trips and he end up being on top of her, so she takes a picture and says to Kido that she will erase the picture if he agrees to expose each other. This begins a life of &quot;peeping&quot; on each other. The story follows Kido through several relationships and his everyday life while he copes with being peeped on by and encouraged to peep on his neighbor; Ikuno Emiru.","torrent":{"xt":"urn:btih:98b8517e924cc989de757089fbbb7bea09637e5d","amp;dn":"%5BVolume+1-12%5D%5BHentai%5DNozoki+Ana%5BAll+Chapters%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98b8517e924cc989de757089fbbb7bea09637e5d","infoHashBuffer":{"type":"Buffer","data":[152,184,81,126,146,76,201,137,222,117,112,137,251,187,123,234,9,99,126,93]},"announce":[],"urlList":[]}}