{"title":"Coast to Coast AM - 02-03-08 - Ancient Astronaut Theory","uid":5641890,"size":54911769,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:9a0f1feb1ffb3d1af9bceca245d74df8cd7437d8&amp;dn=Coast+to+Coast+AM+-+02-03-08+-+Ancient+Astronaut+Theory&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lyrian","files":5,"time":1277143531,"description":"Ancient Astronaut Theory\n\nThe publisher of Legendary Times, Giorgio Tsoukalos spoke about evidence for the Ancient Astronaut theory. Working with such notables as Erich Von Daniken, he has conducted scientific investigations at a number of ancient sites. There are a number of ancient descriptions of beings who wore clothes like metal and helmets with breathing apparatus, suggesting a kind of space-suit, he detailed.\n\nThe Nazca Lines in the Peruvian desert feature huge drawings of figures that can only be recognized from the air, as well as lines that go on for miles, which could be construed as landing strips. One figure, known as the Astronaut, looks like an &quot;ET&quot; and has one finger pointed to the sky, said Tsoukalos, who added that ancient tradition in the area speaks of gods descending from the skies, and teaching mankind various disciplines.\n\nHe described portions of scripture, such as Ezekiel's description of an incredible aerial vehicle, that relate to the ancient astronaut hypothesis. Tsoukalos also suggested that the Israelites, when wandering in the desert for 40 years, were given a device from ETs for food-- the &quot;Manna Machine,&quot; which might've also been the Ark of the Covenant.","torrent":{"xt":"urn:btih:9a0f1feb1ffb3d1af9bceca245d74df8cd7437d8","amp;dn":"Coast+to+Coast+AM+-+02-03-08+-+Ancient+Astronaut+Theory","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a0f1feb1ffb3d1af9bceca245d74df8cd7437d8","infoHashBuffer":{"type":"Buffer","data":[154,15,31,235,31,251,61,26,249,188,236,162,69,215,77,248,205,116,55,216]},"announce":[],"urlList":[]}}