{"title":"Fluid.XXX.DVDRip","uid":8862057,"size":2122315156,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:9b0d44b56283a80fd6a8c2384b7eeaf2a50c2c71&amp;dn=Fluid.XXX.DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":-1,"time":1377800981,"description":"Categories: Fetish\n Director: Dana Vespoli\n Starring: Allie Haze , Sheena Shaw , Aiden Starr , Justine Joli , Dana Vespoli , Steven St Croix , Manuel Ferrara , Johnny Castle\n\n\n Spit, Sex, Water Bondage And Breath Play... How Far Will They Go To Please Their Partners?\n\n Kinky sensualist Dana Vespoli, an exotically gorgeous sex performer, has become noted in recent years for her fearless explorations as a XXX director. The newest female member of the elite Evil Angel roster, Dana's imaginative features and hard-core, dangerous gonzo scenes stretch the limits of the adult-movie mainstream. 'Fluid,' her latest all-sex feature, is an extended four-scene riff on the title in all its connotations - ranging from sensuous showers and swimming pool tease to bodily fluids like saliva and cum to twisted rituals of liquid-immersive power exchange. Joining her are several of the porn industry's leading-edge dominants and submissives, all committed to their erotic needs. Spit, sex, water bondage and breath play... how far will they go to please their partners?\n\n Gorgeous, athletic slut Sheena Shaw luxuriates under a gushing waterfall, then totally gives herself to big-cocked stud Manuel Ferrara in a nasty POV scene in which Sheena's asshole gets deeply probed by Manuel's bare foot! Busty blonde domme Aiden Starr uses rope bondage, water boarding, extreme bathtub torment and her slave boy, Chad Diamond, to exert complete control over pale, fleshy redhead Justine Joli. Beautiful brunette model Allie Haze enjoys a saliva-soaked session of abuse from older stud Steven St. Croix. Finally, Dana treats herself to some underwater cocksucking and a poolside ass reaming courtesy of Johnny Castle; the scene climaxes in a hot fountain of semen. Viewers who like flowing and unpredictable sex should keep a towel handy - Dana Vespoli's 'Fluid' is one very wet adventure.\n\n &lt;a href=&quot;\nhttp://bayimg.com/capFmAAED&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/capFmAAED&lt;/a&gt;","torrent":{"xt":"urn:btih:9b0d44b56283a80fd6a8c2384b7eeaf2a50c2c71","amp;dn":"Fluid.XXX.DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b0d44b56283a80fd6a8c2384b7eeaf2a50c2c71","infoHashBuffer":{"type":"Buffer","data":[155,13,68,181,98,131,168,15,214,168,194,56,75,126,234,242,165,12,44,113]},"announce":[],"urlList":[]}}