{"title":"Pack Aplicaciones &amp; Homebrew  Vol-3 by Tejerosoft","uid":5527471,"size":4023013462,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:9b1b761c8b2ff1051135f4a69f10911b66b8978a&amp;dn=Pack+Aplicaciones+%26+Homebrew++Vol-3+by+Tejerosoft&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TEJEROSOFT","files":41,"time":1272821421,"description":" 1Ã‚Âº Este pack ha sido recopilado con programas y archivos que estÃƒÂ¡n al alcance de todas las personas en pÃƒÂ¡ginas web del sector Homebrew &amp; Scene en consola Wii.[/li]\n\n 2Ã‚Âº Los creadores del mismo no nos hacemos responsables del &quot;mal uso&quot; y con que fines se usen dichos archivos. [/li]\n\n 3Ã‚Âº AsÃƒÂ­ mismo cabe mencionar que estamos en contra de la pirateria y que este pack es como tema de investigaciÃƒÂ³n y siempre sin ÃƒÂ¡nimo de lucro por nuestra parte[/li]\n\n 4Ã‚Âº Las aplicaciones vienen sin ninguna garantÃƒÂ­a, explÃƒÂ­cita ni implÃƒÂ­cita. Ni el autor del programa como los que hemos realizado la recopilaciÃƒÂ³n nos hacemos responsables por cualquier daÃƒÂ±o en tu videoconsola wii debido a un uso no apropiado de este software.[/li]\n\n\n\n\n\nEstas preparado para entrar en el mundo de la Scene en tu Wii? si es asÃƒÂ­ este es tu pack ya que con el vas a poder sacar todo el jugo de la consola Wii de Nintendo\nVas a poder jugar a tus propias copias de seguridad desde un disco duro, emular consolas tan adictivas como SuperNintendo, Megadrive, visualizar peliculas, escuchar mp3, personalizar tu Wii y un largo etc...\n\nEl pack estÃƒÂ¡ dividido en 5 secciones:\n\n1Ã‚Âº Aplicaciones Wii: Donde vais a poder encontrar aquellos programas necesarios para crear y/o modificar aspectos de nuestra consola y juegos, asÃƒÂ­ como programas multimedia para la misma.\n2Ã‚Âº Homebrew &amp; cIOS: Donde encontrareis la manera mas sencilla de cargar software homebrew en vuestra consola junto con los cIos necesarios\n3Ã‚Âº Cargadores: Donde nos encontramos con los programas completos para la carga de nuestra copia de seguridad. Se incluyen caratulas en algunos de ellos\n4Ã‚Âº Emuladores Donde veremos lo que puede hacer nuestra wii en cuanto a emulaciÃƒÂ³n de otras consolas se refiere asÃƒÂ­ como un emulador wii para nuestro Pc\n5Ã‚Âº Aplicaciones Pc Donde localizaremos aquellos programas necesarios para grabaciÃƒÂ³n o traslado al disco duro del homebrew &amp; scene\n\nUna vez descargado, lo descomprimes y lo grabas en un dvd o le das al ejecutable.","torrent":{"xt":"urn:btih:9b1b761c8b2ff1051135f4a69f10911b66b8978a","amp;dn":"Pack+Aplicaciones+%26+Homebrew++Vol-3+by+Tejerosoft","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b1b761c8b2ff1051135f4a69f10911b66b8978a","infoHashBuffer":{"type":"Buffer","data":[155,27,118,28,139,47,241,5,17,53,244,166,159,16,145,27,102,184,151,138]},"announce":[],"urlList":[]}}