{"title":"Coast to Coast AM - 06-04-10 - Deja vu &amp; Magic Moments","uid":5609775,"size":54664790,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:9c56cca6467ec6f5db55916311674212b43afb10&amp;dn=Coast+to+Coast+AM+-+06-04-10+-+Deja+vu+%26+Magic+Moments&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lyrian","files":5,"time":1275805785,"description":"Date:\n\t\n\n06-04-10\n\nHost:\n\t\n\nGeorge Noory\n\nGuests:\n\t\n\nMarie D. Jones, Open Lines\n\nIn the first half of the show, George welcomed researcher and author Marie D. Jones for a discussion about dÃƒÂ©jÃƒÂ  vu phenomenon. Jones described dÃƒÂ©jÃƒÂ  vu as &quot;a memory of a present moment experience,&quot; and shared different theories which attempt to explain how it happens.\n\nOn the scientific front, Jones pointed to research suggesting that dÃƒÂ©jÃƒÂ  vu is triggered when one eye perceives something fractionally faster than the other eye, creating a memory sensation of the scene in the opposite eye. This fails to account for dÃƒÂ©jÃƒÂ  vu experiences in people who are blind in one eye, she noted. Other research has linked dÃƒÂ©jÃƒÂ  vu with temporal lobe epilepsy and to random glitches in our memory processes, she added.\n\nJones provided a more 'paranormal' explanation of dÃƒÂ©jÃƒÂ  vu as well, proposing the experience occurs when we are doing the exact same thing as a duplicate self in an alternate reality. As soon as we make a different choice, our connection to the parallel universe (and sensation of dÃƒÂ©jÃƒÂ  vu) cuts off, she said. Jones also spoke about aberrations of memory, an external source for consciousness, the power of curses, and how reality operates in 'the grid.'\n\n\nMagic Moments\n\nDuring Open Lines, George offered a special 'Magic Moments' hotline. Joe in Overland Park, Kansas, recalled the time he was on a 13 hand winning streak in a poker game and about to raise another player's bet. According to Joe, at that precise moment, a mysterious voice with no identifiable source advised him to &quot;be careful.&quot; Joe said the hair stood up on the back of his neck, but he heeded the warning and instead called the player, who ended up having the winning hand.\n\nJoseph from Cypress, Texas, asserted that the Big Bang Theory does not work and presented a short argument against it. Joseph has written a more detailed case against the widely held cosmological theory, which can be found at canadafreepress.com. John in Bloomington, Indiana, remembered having a premonition about the 1986 Space Shuttle Challenger disaster. On the day of the fatal launch, John claims he told his employees to watch because &quot;something is going to happen.&quot;\nRCH News Update\n\nRichard C. Hoagland appeared briefly in the first half hour to comment on several news stories, including the successful launch of SpaceX's Falcon 9 rocket (link), potential signs of life on Saturn's moon Titan (link), a new Jupiter impact captured on video (link), and the BP oil spill. Hoagland suggested the massive spill could be eradicated using oil-eating microbes in a process called bioremediation, and encouraged listeners to e-mail the White House recommending this approach.\nWebsite(s):\n# mariedjones.com\n# paraexplorers.com\n# arpast.org\nBook(s):\n# The DÃƒÂ©jÃƒÂ  vu Enigma\n# The Resonance Key\n# 11:11 the Time Prompt Phenomenon\n","torrent":{"xt":"urn:btih:9c56cca6467ec6f5db55916311674212b43afb10","amp;dn":"Coast+to+Coast+AM+-+06-04-10+-+Deja+vu+%26+Magic+Moments","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c56cca6467ec6f5db55916311674212b43afb10","infoHashBuffer":{"type":"Buffer","data":[156,86,204,166,70,126,198,245,219,85,145,99,17,103,66,18,180,58,251,16]},"announce":[],"urlList":[]}}