{"title":"Date Night(2010).Xvid","uid":5624114,"size":735977366,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9d7cf9f4247d867c3ae739b4b3edb6bd8943d3e8&amp;dn=Date+Night%282010%29.Xvid&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"icetorrents","files":1,"time":1276400754,"description":"Date Night is a 2010 screwball comedy film directed by Shawn Levy and starring Steve Carell and Tina Fey. It was released in the US on April 9, 2010.[5] It was marketed as Crazy Night in Europe but later the title was changed back to the original Date Night.\n\nPhil and Claire Foster (Steve Carell and Tina Fey) are a married couple from New Jersey with three children whose domestic life has become routine. Phil is a tax lawyer while Claire is a realtor. They have a weekly &quot;date night&quot; at a local steakhouse followed by a movie, but it is just as routine as everything else in their marriage. They learn that their best friends, Brad (Mark Ruffalo) and Haley (Kristen Wiig), are getting a divorce.\nIn an effort to reignite romance, Phil takes Claire to a trendy Manhattan restaurant, but they can't get a table. Phil decides to take a reservation from a no-show couple, the Tripplehorns, despite Claire's misgivings. Halfway through their meal, they are approached by two men named Collins (Common) and Armstrong (Jimmi Simpson), who question them about a flash drive they believe Phil and Claire stole from mobster boss Joe Miletto (Ray Liotta). Phil and Claire try to explain that they are not the Tripplehorns, but the two men threaten them at gunpoint. Not seeing any other way out, Phil decides to tell them it's in a boathouse in Central Park.\nAt the boathouse, Claire pretends to search; while Collins' and Armstrong's backs are turned, Phil hits them with a paddle and escapes with Claire on a boat. At a police station, Phil and Claire talk with Detective Arroyo (Taraji P. Henson) but discover Collins and Armstrong are also detectives, presumably on Miletto's payroll. Realizing they can't trust the police, they decide to find the real &quot;Tripplehorns&quot;. They go back to the restaurant and find their phone number.\nClaire remembers one of her former clients, Holbrooke Grant (Mark Wahlberg), is a security expert. At his apartment, Grant, whom Claire flirts with, traces the signal to an apartment owned by Tom Felton. Collins and Armstrong arrive but Phil and Claire escape in one of Grant's cars, an Audi R8. In the car, they argue.\nThey arrive at Felton's apartment and break in. They question Felton, nicknamed &quot;Taste&quot; (James Franco), and his wife &quot;Whippit&quot; (Mila Kunis) about the flash drive and Joe Miletto. It turns out that they had gone to the restaurant but left when they spotted Collins. Realizing they are now in danger, the couple gives the flash drive to Phil and escape. When Phil and Claire get back in the car, Armstrong and Collins start shooting at them. Phil and Claire crash into a cab. Phil and the cab driver (J. B. Smoove) decide to drive off to get away. Phil climbs into the cab so he can navigate while Claire navigates the other car. Phil checks the flash drive on the driver's Amazon Kindle and finds pictures of district attorney Frank Crenshaw (William Fichtner) with prostitutes. After evading Collins and Armstrong and multiple squad cars, they are eventually hit and separated by another car. The cab falls into the river; Phil and the driver escape, but without the flash drive.\nIn a subway, Claire determines that Felton obtained the flash drive to blackmail Crenshaw. They go back to Grant's apartment, and Grant is reluctant to help this time after becoming exhausted from their incompetence, but Phil begs him and he agrees. Phil and Claire go to the strip club that Crenshaw frequents, with Claire under the guise of a new prostitute and Phil her pimp. Claire changes outfits and the two go into the room where Crenshaw is. After doing a pole dance for him, they confront him and tell him they are the Tripplehorns. Collins and Armstrong come in and hold them at gunpoint and take them up to the roof with Crenshaw. Miletto arrives with henchmen and it is revealed that Crenshaw has been paid by Miletto to keep him out of jail. When Phil mentions the photos, a feud escalates between the mobsters and Crenshaw, Collins, and Armstrong. Phil then asks Claire to count to three and when she does, a helicopter appears and Arroyo and the police come onto the roof to arrest Miletto, Crenshaw, and everyone else. It is revealed that Phil was wearing a wire courtesy of Grant, who informed Arroyo of the situation.\nPhil and Claire enjoy breakfast at a local city diner afterward, where Phil admits that he would marry Claire and have their kids all over again if given the chance. When they arrive back home, they begin kissing passionately on the front lawn for an extended period of time.\nAn after credits scene shows alternate lines and bloopers for various takes.\n\nCast\n\nSteve Carell as Phil Foster[6]\nTina Fey as Claire Foster[6]\nMark Wahlberg as Holbrooke Grant[6]\nRay Liotta as Joe Miletto[7]\nJames Franco as Chase &quot;Taste&quot; Tripplehorn/Tom Felton[6]\nMila Kunis as &quot;Whippit&quot; Tripplehorn[7]\nMark Ruffalo as Brad Sullivan[7]\nKristen Wiig as Haley Sullivan[6]\nCommon as Detective Collins[6]\nJimmi Simpson as Detective Armstrong[7]\nTaraji P. Henson as Detective Arroyo[6]\nLeighton Meester as Katy[6]\nWilliam Fichtner as Frank Crenshaw[8]\nOlivia Munn as the Hostess\nJ. B. Smoove as Cab Driver\nMichelle Galdenzi as Claw Waitress\nGal Gadot as Natanya\n\nThanks !","torrent":{"xt":"urn:btih:9d7cf9f4247d867c3ae739b4b3edb6bd8943d3e8","amp;dn":"Date+Night%282010%29.Xvid","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d7cf9f4247d867c3ae739b4b3edb6bd8943d3e8","infoHashBuffer":{"type":"Buffer","data":[157,124,249,244,36,125,134,124,58,231,57,180,179,237,182,189,137,67,211,232]},"announce":[],"urlList":[]}}