{"title":"Alex Jones Show - 2013 Aug 13 TU [sebaygo1]","uid":8810021,"size":64941854,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:9eae9eb06e361ae8305e8d749cbc9e76bd4d2ef5&amp;dn=Alex+Jones+Show+-+2013+Aug+13+TU+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sebaygo1","files":12,"time":1376436033,"description":"\t\t\t\t\t\t\t\nThe Alex Jones Show\nTuesday, 13 August 2013\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the Infowars web site :: On this Tuesday, August 13 edition of The Alex Jones Show, Alex covers Michael Hastings and the story he was writing on CIA director John Brennan prior to the award-winning journalist's death on June 18 of this year. \n\nAlex looks at the latest on Snowden and new revelations about the CIA's arms shipment to al-Qaeda in Syria. \n\nOn today's show, Alex talks with Press for Truth filmmaker Dan Dicks and Joe Biggs, who will be in-studio. Sgt. Joe Biggs was a friend of the late Michael Hastings and was one of the last people to be in contact with him prior to this death. \n\nAlex also talks with Dr. Seth Farber, a writer, social critic, and dissident psychologist who will break down the DSM-5, the American Psychiatric Association's manual on mental disorders and suicide.\n\nDr. Farber is an activist (in the human rights, Green and anti-war movements -- and a supporter of animal rights) and co-founder of the Network Against Coercive Psychiatry (1988). His newest book is The Spiritual Gift of Madness: The Failure of Psychiatry and the Rise of the Mad Pride Movement.\n\nHe has had four books published previously, including a book on Jewish critics of Israel, and numerous essays and articles. His first book was Madness, Heresy and the Rumor of Angels: The Revolt Against the Mental Health System. The publication of his memoir Lunching with Lunatics: Adventures of a Renegade Psychologist has been postponed indefinitely. Dr Farber is also an editor of the pioneering scholarly review The Journal of Mind and Behavior.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n.\n","torrent":{"xt":"urn:btih:9eae9eb06e361ae8305e8d749cbc9e76bd4d2ef5","amp;dn":"Alex+Jones+Show+-+2013+Aug+13+TU+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9eae9eb06e361ae8305e8d749cbc9e76bd4d2ef5","infoHashBuffer":{"type":"Buffer","data":[158,174,158,176,110,54,26,232,48,94,141,116,156,188,158,118,189,77,46,245]},"announce":[],"urlList":[]}}