{"title":"Attack on Leningrad /2010-PERFECT-Release/PAL/DD5.1/sub 2x","uid":5465262,"size":4661596483,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:9ed089295681e615b857a174aed5a03055bb4cbb&amp;dn=Attack+on+Leningrad+%2F2010-PERFECT-Release%2FPAL%2FDD5.1%2Fsub+2x&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"NLUPPER","files":-1,"time":1269597033,"description":"Attack on Leningrad /2010-PERFECT-Release/PAL/DD5.1/Eng + NLsub \n\nTAGLINE\n\nWhen in 1941 Nazi Germany invaded the Soviet Union, their troops quickly besieged Leningrad. Foreign journalists are evacuated but one of them... \n\nEXTRA INFO\n\nJust a brief explanation of the subtitles. In this film there are 3 spoken languages, Russian, German and English.\nOriginally hard-coded English subs available for non-English speaking parts.\nThese hard-coded English subtitles are not exhaustive and many Russian and German texts remain untranslated.\nBut we have a chance to get Portuguese subtitles that are neatly translated the dialogues.\nWe have Portuguese subtitles so that the base used. So we have all the dialogue translated into any language into Dutch.\nI've never, I repeat not, much work put subtitles in a movie like this.\nFrom Russian into Portuguese, from Portuguese to English and then from English into Dutch.\nTo hearing from German to Dutch. And from English into Dutch.\nWe also have full subtitle line by line completely synchronized perfectly.\nThe usual mergers and extending the subtitles to make everything readable.\nThen viewed the film with custom subtitles, some improvements added. Et voila .....\nWe wish you a lot of fun watching this beautiful war movie that deserves more respect and publishing.\nBoosted by a Dutch subtitles, hope we change that.\n\nMuch respect for the hard work that Thai-Tanic had on this, but mainly BIG thanks.\nCan tell u, this version is better than the original.\nSo watch this version and SAY THANKS TO THAI - TANIC.\n\nType.................: Movie\nAlternatieve titel...: Attack on Leningrad \nFilename.............: Attack.on.Leningrad.PAL.2009.Custom.NL.Thai-Tanic\n\nSource...............: Retail - DVD9 \nRegie................: Aleksandr Buravsky\nActeurs..............: Gabriel Byrne, Mira Sovino en Aleksandr Abdulov\nGenre................: Oorlog / Drama / Actie\nLand.................: Russia | UK \nPlay time............: 110 minuten.\nIMDB.................: imdb.com/title/tt0432314/\nIMDB-RATING..........: 6.9/10 344 votes \nMoviemeter...........: ???\n\nSubs.................: Dutch custom by Thai-Tanic ( Thanks ) \nBewerking en Synch...: Thai-Tanic en Kathmandu  \n\n\nRussia | UK\nOorlog / Drama / Actie\n110 minuten\n\ngeregisseerd door Aleksandr Buravsky\nmet Gabriel Byrne, Mira Sovino en Aleksandr Abdulov\n\nToen in 1941 de Duitse troepen Rusland binnen vielen, werd Leningrad al snel veroverd. Buitenlandse journalisten worden geevacueerd, maar van Kate Davies wordt aangenomen dat ze dood is en mist het vliegtuig.\nAlleen in de stad wordt ze geholpen door Nina Tsvetnova, een jonge idealistische politieagente. Samen moeten ze knokken om te overleven. Net zoals de bevolking van het bezette Leningrad.\nWant Hitler heeft alle voedselvoorzieningen afgesneden en hoopt 3 miljoen mensen te laten verhongeren. \n\n\nDVD INFO\n\nTYPEL: DVD 5\nAspect ratio: Widescreen 16:9\nStandard: PAL\nAudio: Dolby Digital 5.1\nAudio language: English, German, Russian\nSubtitles: English, Dutch \nVideo: CCE 6-pass Compression\nMenu: Untouched\nExtras: Fully Stripped\n\nIMDB:   &lt;a href=&quot; http://www.imdb.com/title/tt0432314/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0432314/&lt;/a&gt;\n\nEXTRA INFO\n\nEven een korte uitleg over de ondertitels. In deze film worden 3 talen gesproken, namelijk Russisch, Duits en Engels.\nOorspronkelijk zijn er hard-coded Engelse subs aanwezig voor de niet-Engels gesproken stukken.\nDeze Engelse hard-coded subtitles zijn lang niet volledig en veel Russische en Duitse teksten blijven onvertaald.\nMaar toevallig hebben wij een portugese ondertiteling weten te bemachtigen die wel netjes alle dialogen vertaald.\nWe hebben deze portugese ondertitel dus als basis gebruikt. We hebben dus alle dialogen vertaald, in welke taal dan ook naar het Nederlands.\nIk heb nog nooit, ik herhaal nog nooit, zoveel werk in een ondertiteling gestoken als deze film.\nVan het Russisch naar het Portugees, van Portugees naar Engels en dan van Engels naar Nederlands.\nVan Duits op gehoor naar Nederlands. En van het Engels naar Nederlands.\nTevens hebben we de volledige ondertitel regel voor regel gesynchroniseerd want dat liep niet helemaal vlekkeloos bij de portugese ondertiteling.\nDe gebruikelijke samenvoegingen en verlenging van de ondertitels om alles goed leesbaar te maken.\nVervolgens de film bekeken met de custom ondertitels, nog wat verbeteringen toegevoegd. Et voila.....\nWe wensen jullie dan ook veel kijkplezier met deze prachtige oorlogsfilm die veel meer waardering en publicatie verdient dan hij nu heeft.\nMede door een Nederlandse ondertiteling hopen we daar verandering in te brengen.\n\nVeel respect voor het vele werk wat Thai-Tanic hieraan heeft gehad, maar vooral VEEL bedankt.\nDoor al deze inspanning is deze versie beter dan de orginele.\nBekijk deze versie en bedank Thai - Tanic voor zijn inspanningen.\n","torrent":{"xt":"urn:btih:9ed089295681e615b857a174aed5a03055bb4cbb","amp;dn":"Attack+on+Leningrad+%2F2010-PERFECT-Release%2FPAL%2FDD5.1%2Fsub+2x","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ed089295681e615b857a174aed5a03055bb4cbb","infoHashBuffer":{"type":"Buffer","data":[158,208,137,41,86,129,230,21,184,87,161,116,174,213,160,48,85,187,76,187]},"announce":[],"urlList":[]}}