{"title":"Zanes The Jump Off S01","uid":8802891,"size":864228357,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9ee900b9967109e0fd8347c16db122a04de4c25d&amp;dn=Zanes+The+Jump+Off+S01&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":8,"uploader":"hltropo","files":13,"time":1376252592,"description":"Five fraternity brothers in their 30s bond with each other and their women in this dramatic series created, executive produced and written by New York Times Bestselling Author Zane, who was also behind Zane's Sex Chronicles\n\nSeason 1\nFirst Down\nS1, Ep1\nMar. 29, 2013\nFirst Down\nNFL star Dmitri Vance and his frat brothers celebrate the break-up of Woody Wood's marriage at his club, &quot;The Jump Off&quot;. Meanwhile, Woody's wife, Kenya, bonds with her friends - the wives, girlfriends and exes of the other frat brothers.\n \nMan-in-Motion\nS1, Ep2\nApr. 5, 2013\nMan-in-Motion\nDmitri picks up his frat brother Earnest Bishop from prison. Earnest begins the long process of rebuilding his life, which includes reaching out to his ex-wife Portia. Tension between Earnest and Chandler Bishop rise.\n \nPass Interference\nS1, Ep3\nApr. 12, 2013\nPass Interference\nEarnest sees ex-wife Portia with her new boyfriend. Brenda wants to move in with Dmitri, but he has his eye on someone new. Woody interviews a sexy singer for the club. Spencer gets a surprise visit at the radio station.\n \nPlaying the Field\nS1, Ep4\nApr. 19, 2013\nPlaying the Field\nGabriel is beginning to have suspicions about Aspen and Sabrina. Much to Spencer's surprise and dismay, Nandi announces her reality TV show. Dmitri has fantasies of Lauren while making love to Brenda.\n \nIllegal Motion\nS1, Ep5\nApr. 26, 2013\nIllegal Motion\nDmitri and Lauren continue to get closer. Woody accuses Kenya of sleeping with her boss. A planned outing between Portia and Earnest has tragic consequences. Gabriel continues to act more and more insecure about Aspen.\n \nRed Flag\nS1, Ep6\nMay 3, 2013\nRed Flag\nSparks are starting to fly all over. Earnest and Portia are starting to ignite. Nandi is starting to feel something for Spencer. Chandler and Earnest have angry words over Earnest's friendship with Sabrina. Oh yeah ... Brenda is still acting like a trick.\n \nTurnover\nS1, Ep7\nMay 10, 2013\nTurnover\nDmitri receives very bad news about his arm. He learns that he has a son from a high school romance. Spencer and Nandi finally connect. Kenya kicks Woody out for good.\n \nBackfield in Motion\nS1, Ep8\nApr. 17, 2013\nBackfield in Motion\nEarnest has the guys frantic that he might try to kill himself. Brenda refuses to make it easy for Dmitri to leave her. Nandi tries to understand how she feels about Spencer. Aspens receives damning information about Chandler.\n \nOffensive Holding\nS1, Ep9\nMay 24, 2013\nOffensive Holding\nA night of passion between Portia and Earnest doesn't turnout the way that Earnest hoped. Dmitri continues to reach out to Harris. Brenda stalks Dmitri. News that Kenya hired a lawyer sends Woody looking for a distraction. Earnest and Sabrina kiss.\n \nBall Control\nS1, Ep10\nMay 31, 2013\nBall Control\nBrenda continues to spy on Dmitri and Lauren. Sabrina, Portia, and Kenya try to figure out what to do with the men in their lives. Chandler threatens Earnest about seeing Sabrina. Harris decides to give a relationship with Dmitri a chance.\n \nPossession\nS1, Ep11\nJun. 7, 2013\nPossession\nSpencer and Nandi profess their love for each other. Woody and Kenya reignite the passion in their relationship. Brenda attempts voodoo to get Dmitri back. Earnest and Keith plot against Chandler.\n \nDown by Contact\nS1, Ep12\nJun. 14, 2013\nDown by Contact\nSpencer and Nandi grow deeper in love each day. Brenda grows crazier in her jealousy. Some of that craziness is now rubbing off on Gisele. She wants to break-up Woody and Kenya. The drama among the Bishop's continues.\n \nTwo-Minute Drill\nS1, Ep13\nJun. 21, 2013\nTwo-Minute Drill\nDmitri throws a surprise birthday party for Lauren that has a few other surprises. Earnest and Sabrina hook up. Nandi and Spencer have a swinging good time. Chandler is arrested.","torrent":{"xt":"urn:btih:9ee900b9967109e0fd8347c16db122a04de4c25d","amp;dn":"Zanes+The+Jump+Off+S01","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ee900b9967109e0fd8347c16db122a04de4c25d","infoHashBuffer":{"type":"Buffer","data":[158,233,0,185,150,113,9,224,253,131,71,193,109,177,34,160,77,228,194,93]},"announce":[],"urlList":[]}}