{"title":"tails-i386-0.20.iso","uid":8803220,"size":897318912,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:9f0400934a6a92a044fc594a3a955eb004d36a91&amp;dn=tails-i386-0.20.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"HyperVigilant","files":1,"time":1376262044,"description":"Tails is a live system that aims to preserve your privacy and anonymity. It helps you to use the Internet anonymously almost anywhere you go and on any computer but leaving no trace unless you ask it to explicitly.\n\nIt is a complete operating system designed to be used from a DVD or a USB stick independently of the computer's original operating system. It is Free Software and based on Debian GNU/Linux.\n\nTails comes with several built-in applications pre-configured with security in mind: web browser, instant messaging client, email client, office suite, image and sound editor, etc.\n\n\nAnonymity online through Tor\n\nTails relies on the Tor anonymity network to protect your privacy online:\n\n    all software is configured to connect to the Internet through Tor\n    if an application tries to connect to the Internet directly, the connection is automatically blocked for security.\n\nTor is free software and an open network that helps you defend against a form of network surveillance that threatens personal freedom and privacy, confidential business activities and relationships, and state security known as traffic analysis.\n\nTor protects you by bouncing your communications around a distributed network of relays run by volunteers all around the world: it prevents somebody watching your Internet connection from learning what sites you visit, and it prevents the sites you visit from learning your physical location.\n\n\nUsing Tails on a computer doesn't alter or depend on the operating system installed on it. So you can use it in the same way on your computer, a friend's or one at your local library. After removing your Tails DVD or USB stick the computer can start again on its usual operating system.\n\nTails is configured with special care to not use the computer's hard-disks, even if there is some swap space on them. The only storage space used by Tails is the RAM, which is automatically erased when the computer shuts down. So you won't leave any trace neither of the Tails system nor of what you did on the computer. That's why we call it &quot;amnesic&quot;.\n\nThis allows you to work on sensitive documents on any computer and protect you from data recovery after shutdown. Of course, you can still explicitly save some documents to another USB or external hard-disk and take them away for future use.\n\nState-of-the-art cryptographic tools\n\nTails also comes with a selection of tools to protect your data using strong encryption:\n\n    Encrypt your USB sticks or external hard-disks using LUKS, the Linux standard for disk-encryption.\n\n    Automatically encrypt with HTTPS all your communications to a number of major websites using HTTPS Everywhere, a Firefox extension developed by the Electronic Frontier Foundation.\n\n    Encrypt and sign your emails and documents using the de facto standard OpenPGP either from Tails email client, text editor or file browser.\n\n    Protect your instant messaging conversations using OTR, a cryptographic tool that provides encryption, authentication and deniability.\n\n    Securely delete your files and clean your diskspace using Nautilus Wipe.\n","torrent":{"xt":"urn:btih:9f0400934a6a92a044fc594a3a955eb004d36a91","amp;dn":"tails-i386-0.20.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f0400934a6a92a044fc594a3a955eb004d36a91","infoHashBuffer":{"type":"Buffer","data":[159,4,0,147,74,106,146,160,68,252,89,74,58,149,94,176,4,211,106,145]},"announce":[],"urlList":[]}}