{"title":"Metal Slug 7[SoloEstreno.com]","uid":5479321,"size":39310463,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:a18056064ac32d8ec80c7d7117997f8f52336e8e&amp;dn=Metal+Slug+7%5BSoloEstreno.com%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nahla","files":1,"time":1270320463,"description":"Como sucede en los otros tÃƒÂ­tulos de la saga, en Metal Slug 7 Nintendo DS nos encontraremos con varios niveles que deberemos ir superando, todos ellos de plataformas. En ellos, oleadas y oleadas de enemigos nos atacarÃƒÂ¡n, haciendo que la acciÃƒÂ³n estÃƒÂ© presente en todo momento. Gracias a nuestras armas, iremos disparando masivamente, provocando explosiones y abriÃƒÂ©ndonos paso de izquierda a derecha.\n\nComo veis, se trata del mismo sistema de juego que el de las anteriores versiones para recreativas: acciÃƒÂ³n plataformera a borbotones y en 2 dimensiones. Pero MS7 Nintendo DS no es un calco de los otros Metal Slug, sino que llega con ciertas novedades bastante interesantes.\n\nEn primerlugar, podremos escoger entre 6 personajes diferentes a la hora de jugar. Clark, Tarma, Eri, Fio, Ralf y Marco serÃƒÂ¡n los protagonistas de la sÃƒÂ©ptima entrega del clÃƒÂ¡sico, y cada uno contarÃƒÂ¡ con habilidades especiales que los diferenciarÃƒÂ¡n de los demÃƒÂ¡s. Ralf, por ejemplo, es todo un experto en la lucha cuerpo a cuerpo, y podrÃƒÂ¡ valerse de ello para destrozar a sus enemigos. Clark, en cambio, tiene el doble de resistencia que sus compaÃƒÂ±eros, y podrÃƒÂ¡ recibir dos golpes en lugar de uno antes de morir. Como hemos dicho, todos cuentan con una habilidad especial y tendremos que saber utilizarla para sacar provecho de sus cualidades.\n\nAl igual que en otros Metal Slug, al avanzar por los niveles y aniquilar enemigos, podremos rescatar a prisioneros. Por hacerlo, seremos recompensados con armas de todo tipo. AsÃƒÂ­ pues, cuando liberemos a los prisioneros obtendremos la pistola lÃƒÂ¡ser, el lanzacohetes, el rayo electrificador u otros tipos de armas. Los enemigos, eso sÃƒÂ­, tambiÃƒÂ©n estarÃƒÂ¡n equipados con devastadores ÃƒÂ­tems. Continuamente se irÃƒÂ¡n sucediendo grupos de soldados armados hasta los dientes, helicÃƒÂ³pteros o tanques que nos bombardearÃƒÂ¡n a discreciÃƒÂ³n sin ningÃƒÂºn tipo de contemplaciÃƒÂ³n.\n\nComprimido:38mb\nDescomprimido:64mb ","torrent":{"xt":"urn:btih:a18056064ac32d8ec80c7d7117997f8f52336e8e","amp;dn":"Metal+Slug+7%5BSoloEstreno.com%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a18056064ac32d8ec80c7d7117997f8f52336e8e","infoHashBuffer":{"type":"Buffer","data":[161,128,86,6,74,195,45,142,200,12,125,113,23,153,127,143,82,51,110,142]},"announce":[],"urlList":[]}}