{"title":"The Exorcist 1, 2, 3, 4 (Retail) Multisub [NLUPPER]","uid":5604448,"size":18730255222,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:a3746f94539f3ea54927f091b92bbbfbef3b8d73&amp;dn=The+Exorcist+1%2C+2%2C+3%2C+4+%28Retail%29+Multisub+%5BNLUPPER%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"NLUPPER","files":79,"time":1275511850,"description":"The Exorcist 1, 2, 3, 4 (Retail) Multisub\n\n\nThe Exorcist (The Version You've Never Seen) (1973/2000)\n\n\nPLOT\n\nWhen a teenager is possessed by a mysterious entity, her mother seeks the help of two priests to save her daughter.\n\n\n\n\nDe film speelt zich af in de Verenigde Staten aan het begin van de jaren '70 over een twaalf jaar oud meisje genaamd Regan MacNeil (Linda Blair) dat lijdt aan duivelse bezetenheid.\nDit wordt duidelijk wanneer ze bovennatuurlijke krachten blijkt te bezitten, waaronder bovenmenselijke spierkracht en de mogelijkheid om te zweven.\nBovendien vloekt en tiert ze hevig.\nDokters kunnen dit gedrag niet verklaren, en ook een psychiater kan haar niet helpen.\nUiteindelijk komt een dokter met het idee een uitdrijving uit te voeren.\nDe uitdrijvingsrite wordt verzorgd door de priesters Lancaster Merrin (Max von Sydow) en Damien Karras (Jason Miller), op aanvraag van haar moeder Chris MacNeil (Ellen Burstyn).\nDe demon laat zich niet zo makkelijk verdrijven en bespot beide priesters.\nUiteindelijk daagt Karras de demon uit om bezit te nemen van hem.\nDe demon doet dit, maar voor hij geheel de controle over zijn lichaam verliest springt Karras uit het raam en sterft.\nMet zijn dood is ook de demon die in hem zat verslagen.\nRegan herinnert zich naderhand niets van haar avontuur.\n\n\n\nINFO:\n\nSource: Retail Disk DVD9\nCover: Yes\nMenu: Yes\nExtra's: No\nBeeld: 16:9 Kleur\nAudio: Dolby Digital 5.1: Engels\nSubs: Nederlands, Engels, Frans, Grieks, Kroaat, Hongaars, Hebreeuws, Portugees, Turks.\nPlaytime: 127 minuten\nFormat: DVD5\nGenre: Drama, Horror, Thriller\n\nMM:   &lt;a href=&quot; http://www.moviemeter.nl/film/145&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.moviemeter.nl/film/145&lt;/a&gt;\n\nWeblink : http://www.imdb.com/title/tt0070047/\n\n\n******************************************************\n\n\nExorcist II: The Heretic (1977)\n\nPLOT\n\nA girl once possessed by a demon finds that it still lurks within her. Meanwhile, a priest investigates the death of the girl's exorcist.\n\n\n\nEen paar jaar na de gebeurtenissen uit het eerste deel, wordt Father Philip Lamont (Richard Burton) naar het huis van Regan McNeil (Linda Blair) gestuurd om de dood van Father Merrin (Max von Sydow) te onderzoeken.\nTijdens hypnosesessies om gebeurtenissen van die tijd terug te halen, blijkt McNeil nog steeds niet helemaal verlost van de demoon die haar destijds bezat.\nLamont reist daarop naar Afrika om Kokumo (James Earl Jones, als kind gespeeld door Joey Green) te vinden, die jaren daarvoor door dezelfde demoon bezeten werd, waarop Merrin deze uitdreef.\nDe inmiddels volwassen Kokumo vertelt hem dat het om de demoon Pazuzu gaat en dat deze zich voortbeweegt in zwermen treksprinkhanen.\nDaarop keert Lamont terug naar Washington, waar Pazuzu zijn greep op Regan weer verstevigd heeft en een nieuwe uitdrijving wacht.\n\n\n\n\nINFO:\n\nSource: Retail Disk DVD9\nCover: Yes\nMenu: Yes\nExtra's: Yes\nBeeld: 16:9\nAudio: Dolby Digital 5.1: Engels, Frans, Italiaans.\nSubs: Nederlands, Arabisch, Bulgaars, Duits, Engels, Spaans, Frans, Italiaans, Roemeens.\nPlaytime: 113 minuten\nFormat: DVD5\nGerne: Drama, Horror, Thriller\n\nMM:   &lt;a href=&quot; http://www.moviemeter.nl/film/3328&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.moviemeter.nl/film/3328&lt;/a&gt;\n\nWeblink : http://www.imdb.com/title/tt0076009/\n\n************************************************\n\n\nExorcist 3 (1990)\n\nPLOT\n\nA police lieutenant in Georgetown mourns the anniversary of a priest's death as a serial killer strikes.\n\n\nEen vrouw kruipt onopgemerkt voorbij? op het plafond, als een vlieg.\nEen moordenaar, zelf al lang dood, maakt het ene slachtoffer na het andere.\nVlammen ontstaan uit het niets, slangen glijden voorbij, de grond scheurt open en onthult een helse poel vol krioelende verdoemden.\nHet kwaad is terug.\nAuteur William Peter Blatty, die met zijn Oscarbekroonde scenario voor de originele Exorcist de grenzen van het horrorgenre verlegde, \nregisseerde zelf dit bloedstollende derde deel van de reeks, met een directe verwijzing naar de oorspronkelijke film.\nGeorge C. Scott vertolkt de rol van inspecteur Kinderman, die een onderzoek leidt naar een reeks geheimzinnige moorden.\nKinderman heeft lak aan demonen en gelooft niet in bezetenheid.\nAlthans, nÃƒÂ²g niet.\nJason Miller speelt wederom de rol als de priester uit de originele film en ook Samuel L. Jackson en profbasketballer Patrick Ewing vervullen verrassende bijrollen.\nEen ijzingwekkende afdaling naar de duivelse hel.\n\n\n\nINFO:\n\nSource: Retail Disk DVD9\nCover: Yes\nMenu: Yes\nExtra's: Yes\nBeeld: 16:9\nAudio: Dolby Digital 5.1: Engels, Frans.\nSubs: Nederlands, Engels, Frans.\nPlaytime: 106 minuten\nFormat: DVD5\nGenre: Drama, Horror, Thriller\n\nMM:   &lt;a href=&quot; http://www.moviemeter.nl/film/3843&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.moviemeter.nl/film/3843&lt;/a&gt;\n\nWeblink : http://www.imdb.com/title/tt0099528/\n\n************************************************\n\n\nExorcist: The Beginning (2004)\n\nPLOT\n\nYears before Father Lancaster Merrin helped save Regan MacNeil's soul, he first encounters the demon Pazuzu in East Africa. \nThis is the tale of Father Merrin's initial battle with Pazuzu and the rediscovery of his faith.\n\n\nJaren voordat priester Merrin in de eerste Exorcist de ziel redde van de 12-jarige Regan MacNeil, voerde hij in Oost-Afrika voor de eerste keer strijd met de demon Pazuzu.\nNa de Tweede Wereldoorlog vlucht priester Merrin naar Oost-Afrika, geplaagd door herinneringen aan de gruweldaden van de nazi's.\nIn Afrika hoopt hij een nieuw leven te beginnen als archeoloog.\nOnder het woestijnzand wordt een christelijke kerk ontdekt.\nMen staat voor een raadsel: de kerk is in perfecte staat en stamt uit de vijfde eeuw, toen het christendom daar nog niet was ingevoerd!\nDiep in het zand bevindt zich iets...een duistere kracht die uit zijn eeuwenoude slaap wordt gehaald.\nDe inboorlingen proberen het kwaad af te wenden met rituele offers.\nHet bloed van onschuldige vloeit in het woestijnzand, maar de echte gruwel moet nog beginnen.\nOp de plek waar het kwaad werd geboren, komt Merrin oog in oog te staan met de demon Pazuzu...\n\n\nINFO:\n\nSource: Retail Disk DVD9\nCover: Yes\nMenu: Yes\nExtra's: No\nBeeld: 16:9 \nAudio: Dolby Digital 5.1: Engels\nSubs: Dutch (Select)\nCategorie : Beeld\nFormat : DVD5\nGenre : Drama, Horror, Thriller\n\nMM:   &lt;a href=&quot; http://www.moviemeter.nl/film/8428&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.moviemeter.nl/film/8428&lt;/a&gt;\n\nWeblink : http://www.imdb.com/title/tt0204313/\n\n************************************************\n\n\n\n\n\n","torrent":{"xt":"urn:btih:a3746f94539f3ea54927f091b92bbbfbef3b8d73","amp;dn":"The+Exorcist+1%2C+2%2C+3%2C+4+%28Retail%29+Multisub+%5BNLUPPER%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3746f94539f3ea54927f091b92bbbfbef3b8d73","infoHashBuffer":{"type":"Buffer","data":[163,116,111,148,83,159,62,165,73,39,240,145,185,43,187,251,239,59,141,115]},"announce":[],"urlList":[]}}