{"title":"Prince of Persia - The Sands of Time (Movie Trailer)","uid":5612682,"size":40750706,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:a3a27e9a7ab89d5d2bde344815f8b06a75b8286c&amp;dn=Prince+of+Persia+-+The+Sands+of+Time+%28Movie+Trailer%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sana.k","files":-1,"time":1275943398,"description":"Release Date: 3 June 2010 \nGenre: Action | Adventure | Fantasy | Romance \nCountry: USA \nLanguage: English \nColor: Color \n\n \nMovies are like food. There are some which are bitter and hard to swallow yet nutritious in every aspect, and those which are tasty albeit fattening. &quot;Prince Of Persia&quot; falls in the latter category, it's fun to watch and enjoyable, and where intelligence doesn't really matter.\n\nWith Jerry Bruckheimer producing, lots of action, adventure and excitement are promised. With &quot;Prince Of Persia: The Sands Of Time&quot; he continues that promise. The film, from start to finish, is filled with well-choreographed sword-fighting action, fantastic special effects, sweepingly exotic scenery, lavish production design, and a good, sweeping music score by Harry Gregson-Williams. During the action scenes the camera does not shake that much compared to recent movies... although I admit there are one too many slow-motion sequences, that (although gorgeous to look at) distracts the audience too much. However Bruckheimer has a thing for slo-mo, so he's excused. The screenplay is about what you'd expect for a Hollywood-filmed Arabian adventure.\n\nThe actors did a good job with the material they're given. Jake Gyllenhaal emits sex appeal and charisma throughout, walking through the film with ease. And he's quite good with the action sequences and fighting! Jake, welcome to the action hero club. A big surprise though is Gemma Arterton's performance as Princess Tamina; it is a HUGE improvement from her bland performances in &quot;Quantum Of Solace&quot; and &quot;Clash Of The Titans&quot;; here Arterton manages to inject wit, charm AND emotion into her character, not to mention looking gorgeous at the same time. However I was slightly disappointed by Ben Kingsley's performance - a two dimensional villain. Granted, Kingsley acted great in the role but I felt like it just didn't match to his standards. Alfred Molina has a funny supporting role and the rest of the cast did quite a good job, although I wish a little characterization would come from this. \n\n","torrent":{"xt":"urn:btih:a3a27e9a7ab89d5d2bde344815f8b06a75b8286c","amp;dn":"Prince+of+Persia+-+The+Sands+of+Time+%28Movie+Trailer%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3a27e9a7ab89d5d2bde344815f8b06a75b8286c","infoHashBuffer":{"type":"Buffer","data":[163,162,126,154,122,184,157,93,43,222,52,72,21,248,176,106,117,184,40,108]},"announce":[],"urlList":[]}}