{"title":"Bananarama - Robert De Niro's Waiting  (2nafish)","uid":5624520,"size":135997444,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a63dc8d16886888f84d3256d660a25d136778575&amp;dn=Bananarama+-+Robert+De+Niro%5C%27s+Waiting++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1276427754,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Robert De Niro's Waiting...&quot; is a song written and recorded by English girl group Bananarama. It was the second single released from their self-titled second album in 1984.\n\nSiobhan Fahey states on her website: &quot;[...] our follow-up single, long overdue, was &quot;Robert de Niro's Waiting&quot; [sic]. (Originally penned as &quot;Al Pacino's Waiting&quot;) [sic] but changed to 'Robert de Niro' [sic] as it worked better with the music. At Jolley Swain's [sic] insistence the line &quot;Talking Italian&quot; was added to add a 'romantic' edge. The lyrics for the song, inspired by the experiences of a rape victim, was a UK #3 hit single (69th top selling single for 1984). Robert de Niro [sic] heard of the 'tribute' song, and rang our council flat and arranged to meet us for drinks and dinner. We were thrilled to meet a bona fide movie star.&quot;\n\nAt the time of the track's release, the members of Bananarama were receiving a lot of criticism from the UK music press, who labelled the trio as a &quot;cover versions band&quot; whose producers and writers controlled their output.\n\nThe single is one of the group's strongest performing releases, peaking at number three in the UK singles chart (the single to date stands in a three-way tie as Bananarama's highest-charting UK hit). It made a brief appearance on the U.S. Billboard Hot 100, peaking at number ninety-five.\n\nA slightly extended version of the song was available on the 12&quot; single (though this was not actually listed as being an extended version (as was the case with all Bananarama's previous 12&quot; versions)). The B-side of both 7&quot; and 12&quot; singles was a song typical of Bananarama during this and their Deep Sea Skiving period, called &quot;Push!&quot;, about a drug-dealer, pushing his wares, and his lack of conscience. Also included on the 12&quot; single, was an unlisted track; a different version &quot;Link&quot; from Bananarama.\n\nBananarama re-recorded &quot;Robert De Niro's Waiting...&quot; with Latin instrumentation on their 2001 album Exotica.\n\nThe Duncan Gibbins-directed music video for &quot;Robert de Niro's Waiting...&quot; shows Bananarama walking around dark streets, possibly followed by mafia-style clothed men. When it gets to the bridge part of the song, Sarah is shown running along, looking behind her as if being followed: her backcombed hair bounces up and down, with strands flying across her face. The video ends with Bananarama back in their flat, when the door bell rings. Keren answers the door, only to be confronted by the man who might have been chasing them, armed with a Mafia-style violin case. As she looks nervously at him, the case falls open to reveal a sign saying &quot;Pizza Delivery&quot;, along with three pizzas. Both the man and Keren start laughing, and right at the end, Bananarama are shown in their flat eating the pizza and laughing.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:a63dc8d16886888f84d3256d660a25d136778575","amp;dn":"Bananarama+-+Robert+De+Niro%5C%27s+Waiting++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a63dc8d16886888f84d3256d660a25d136778575","infoHashBuffer":{"type":"Buffer","data":[166,61,200,209,104,134,136,143,132,211,37,109,102,10,37,209,54,119,133,117]},"announce":[],"urlList":[]}}