{"title":"Legendarische kluchten - Er is er een jarig - ZARCK 2Lions-Team","uid":5646895,"size":4689385654,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:a8fbc1f4242f0e26e140472865f3c401061ec520&amp;dn=Legendarische+kluchten+-+Er+is+er+een+jarig+-+ZARCK+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"crazyadriaan","files":17,"time":1277319314,"description":"Er is er een jarig\n\nHet derde stuk in de box is de klucht Er is er een jarig. Het blijspel werd vertaald en herschreven voor Yoka Beretty en is gebaseerd op Marc Camoletti's 'Happy Birthday'. Samen met Sylvia de Leur, Guikje Roethof en Diana Dobbelman wordt er weer een doldwaas verhaal opgezet. Bernard en Jacqueline zijn getrouwd en krijgen voor een weekend een gast op bezoek, Robert. Speciaal voor de gelegenheid huurt Jacqueline een werkster in, Brigitte. Robert heeft stiekem een verhouding met Jacqueline, terwijl Bernard een vriendin heeft die toevallig ook Brigitte heet. Hij dwingt Robert om te doen alsof Brigitte zijn vriendin is, terwijl die dus eigenlijk de werkster is. Als dan de echte vriendin om de hoek komt kijken, wordt het wel erg ingewikkeld, zeker omdat Jacqeline nu denkt dat Robert haar bedriegt. Een flinke chaos dus, maar dat hoort nou eenmaal bij een goede klucht. Het huis waar dit alles zich afspeelt beschikt over een grote hoeveelheid deuren en de naamsverwarring leidt tot flink veel hilariteit. De acteurs zetten hun rol netjes neer, alleen wordt er soms wel erg overdreven gesproken. Het mag de pret niet drukken.\n\nDit is een oude klucht dus verwacht geen enorme kwaliteit of 3D effecten maar wel een paar uur hilarisch lachen.\nBij voldoende belangstelling blijf ik de komende weken 1 of 2 van deze dvd's per dag plaatsen dus ik hoop dat wij Nederlanders ook blijven seeden na de download, het zou jammer zijn als dit een dode torrent wordt.\n\n \n\nBrought to you by \n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n                    &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers, get a life !!!","torrent":{"xt":"urn:btih:a8fbc1f4242f0e26e140472865f3c401061ec520","amp;dn":"Legendarische+kluchten+-+Er+is+er+een+jarig+-+ZARCK+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8fbc1f4242f0e26e140472865f3c401061ec520","infoHashBuffer":{"type":"Buffer","data":[168,251,193,244,36,47,14,38,225,64,71,40,101,243,196,1,6,30,197,32]},"announce":[],"urlList":[]}}