{"title":"CERTIFIED ETHCAL HACKER SERIES","uid":5638002,"size":711371531,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:a9959d254260baf6e6a422f0a7a21a1189a3f5dc&amp;dn=CERTIFIED+ETHCAL+HACKER+SERIES&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"darkmoves","files":4,"time":1276966658,"description":"Cbt nuggets-Certified Ethical Hacker Series\n\nYou're up late, banging away at your keyboard. You find the hole you were looking for. Now you just find the right directory, copy a couple files, back right out of the system, and erase your tracks. Within 15 minutes of finding a back door into the network, you've downloaded transaction data for all credit card transactions within the last two years. You'd think credit card processing companies would be more secure than that.\nThe FBI should be busting down your door any minute now. But they won't. You print out your keystroke logger info. You make a phone call. &quot;I got in.&quot; They don't believe it. But when you deliver the keystroke log the next day, they're floored. They cut you a check, and offer you an even bigger contract to help them fix the hole.\n\nDo things that should get you arrested - but get paid instead. Ethical Hacking is so cool.\n\n&quot;What makes this knowledge so valuable?&quot;\n\nThe work you do as an Ethical Hacker can save businesses from massive harm. You get to find and close off vulnerabilities that hackers could otherwise exploit to get inside your network and steal or even destroy data. By getting there first, you prevent leaks of sensitive information - even fraud and identity theft against employees and customers.\n\nBusinesses recognize the value of security pros that are able to shut down &quot;back-doors&quot; into their network. Protecting their sensitive data protects their livelihood. Because the work you do as an Ethical Hacker can prevent significant harm to their business, companies will pay you top dollar to do some of the most interesting work in information security.\n\n&quot;What will Ethical Hacker training teach me?&quot;\n\nIn this series you'll learn the 5 Steps of a Hack. You'll also learn legal considerations for working as an Ethical Hacker. You'll learn all about passive intelligence gathering, and get suggestions for gathering critical information through social engineering.\n\nOther things covered in the Certified Ethical Hacker Series include TCP exploits, ICMP exploits, and other network reconnaissance techniques; pulling packets out of network communications to sniff passwords, hubs, and switches; SNMP and DNS exploits; password cracking; gaining unauthorized access to a wireless network; erasing your tracks after penetrating a network; web and file exploits too dangerous to name; and much more.\n\n&quot;Does this training cover the Certified Ethical Hacker exam?&quot;\n\nThe Certified Ethical Hacker Series covers more than how to exploit your network, and how to use that knowledge to keep others from doing the same thing. It also maps to the exam objectives for CEH certification from EC-Council. It's a comprehensive resource to use for both exam prep and on-the-job reference, so you can add this valuable certification to your resume.\n\n&quot;Isn't this knowledge dangerous?&quot;\n\nFrom CBT Nuggets CEO Dan Charbonneau:\n\n\n&quot;I actually had a wave of fear hit me as I was half-way through reviewing this series. 'We can't sell this.' That was my gut reaction. It's too dangerous, it teaches too much, it's too powerful. My second thought was, 'We need to sell this to as many people as possible', thinking it safest if the people being attacked know exactly how to attack, and therefore how to protect.&quot;\nPrerequisites\n\nHaving a basic understanding of information security and networking such as what's taught in the Security+ and Network+ series is recommended before viewing this training. More advanced security policy training such as SSCP or CISSP is strongly recommended before using this knowledge on the job.\n\nThe Certified Ethical Hacker Series contains:\n\n- Series Intro (free video)\n- Hacker Terms\n- Hacker Procedures\n- Using VMWare\n- Using Linux\n- Passive Intelligence Gathering Part 1\n- Passive Intelligence Gathering Part 2\n- Social Engineering\n- Network Reconnaissance Part 1\n- Network Reconnaissance Part 2\n- Service Identification and Enumeration\n- Vulnerability Assessment: Nessus &amp; GFI Languard\n- Vulnerability Assessment: Network Sniffing\n- SNMP\n- DNS\n- Password Cracking\n- Exploits Part 1: Linux\n- Exploits Part 2: Windows\n- Web and File Exploits\n- Wireless Security\n- Erasing Tracks\n\n\nfor more details goto:-http://www.cbtnuggets.com/webapp/product?id=250","torrent":{"xt":"urn:btih:a9959d254260baf6e6a422f0a7a21a1189a3f5dc","amp;dn":"CERTIFIED+ETHCAL+HACKER+SERIES","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9959d254260baf6e6a422f0a7a21a1189a3f5dc","infoHashBuffer":{"type":"Buffer","data":[169,149,157,37,66,96,186,246,230,164,34,240,167,162,26,17,137,163,245,220]},"announce":[],"urlList":[]}}