{"title":"EnigmaT Set Rips { Cuts } - August 1st, 2013","uid":8767024,"size":1097899932,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a9b6eb7d31cf77baf87a4c56adfcca303723cbee&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+August+1st%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"EnigmaT","files":129,"time":1375358241,"description":"5th Dimension - Roses (Original Mix) (Cut From Romel Set)-enTc.mp3\nA &amp; Z - Dystopia (Original Mix) (Cut From A&amp;F Set)-enTc.mp3\nActive Visions - Pure energy (Original Mix) (Cut From Del Mar Set)-enTc.mp3\nAfrojack - Jack That Body (Cut From W&amp;W Set)-enTc.mp3\nAkira Kayosa &amp; Carly Kling - Ransom (Chris Metcalfe Remix) (Cut From Del Mar Set)-enTc.mp3\nAlex Ender - Calore (Original Mix) (Cut From Romel Set)-enTc.mp3\nAlex M.O.R.P.H. feat. Christian Burns - Secret Universe (Woody van Eyden Remix) (Cut From Eyden Set)-enTc.mp3\nAllen &amp; Envy - Fire Glow (Original Mix) (Cut From A&amp;F Set)-enTc.mp3\nAllen &amp; Envy vs. Chris Cockerill - Acidic (Touchstone Banging Remix) (Cut From Burrows Set)-enTc.mp3\nAly &amp; Fila Vs Fady &amp; Mina - The Journey (Original Mix) {FSOE 300 Anthem} (Cut From A&amp;F Set)-enTc.mp3\nAmitacek - Black Orchid (Original Mix) (Cut From Uplift Set)-enTc.mp3\nAndy Elliass pres. Skylove - Love is the Answer (New World Remix) (Cut From Romel Set)-enTc.mp3\nArcalis - Horizon (Set Rip)-enTc.mp3\nArches - Be This Way (Alex Sonata Remix) (Cut From Emery Set)-enTc.mp3\nArctic Moon &amp; Paul Webster - Valhalla (Adam Ellis Remix) (Set Rip)-enTc.mp3\nArno Cost - Arais Magenta (Matt Fax Private Show Me Love Edit) (ABGT 033 Rip)-enTc.mp3\nArys - Ladykillers (Original Mix) (Cut From Anderson Set)-enTc.mp3\nBass Robbers &amp; Toby Traxx feat. Ace Wilder - Place My Heart (Cut From Kihlom Set)-enTc.mp3\nBlanka - Evolution (Ainur Remix) (Cut From Fonarev Set)-enTc.mp3\nBlood Groove &amp; Kikis - Vesta (Matt Fax Remix) (Cut From Matt Fax Set)-enTc.mp3\nBlue Horizon &amp; Shyprince - Lithium (Original Trance Mix) (Cut From Uplift Set)-enTc.mp3\nBluEye - Drop It (Original Mix) (Set Rip)-enTc.mp3\nBroning - Deadline (Cut From Bobina Set)-enTc.mp3\nBruno Mars - Treasure (Audien Dub) (ABGT 033 Rip)-enTc.mp3\nC-Systems ft. Hanna Finsen - Leading Destony (Odonbat Remix) (Set Rip)-enTc.mp3\nCamilo Santi &amp; Krzysztof Chochlow - The Cube (Cut From GO Set)-enTc.mp3\nChris Baker Presents Virtue - Sublimity (Sundes Remix) (Cut From Saux Set)-enTc.mp3\nChris Baker Presents Virtue - Sublimity (Tuomas.L Remix) (Cut From Sty Set)-enTc.mp3\nCJ Arthur &amp; Adam Navel - Crescencia (Dave Cold Remix) (Cut From Romel Set)-enTc.mp3\nConrad Winged - Cast Away (Martin Libsen Remix) (Cut From Above Clouds Set)-enTc.mp3\nConrad Winged - Cast Away (Martin Libsen Remix) (Cut From Sty Set)-enTc.mp3\nCorti Organ - Ibiza (Cut From Eyden Set)-enTc.mp3\nDarkployers - Forgotten Sounds (Christopher Vassilakis Remix) (Cut From Basil Set)-enTc.mp3\nDash Berlin &amp; Carita La Nina - Dragonfly (Cut From W&amp;W Set)-enTc.mp3\nDavid Granha - I Need A Tolldoy (Progreg Remix) (Cut From Matt Fax Set)-enTc.mp3\nDeep Fog feat. Wi - Fear (Original Mix) (Cut From Longflexion Set)-enTc.mp3\nDelirium - Silence  (Adam Deane Re-Edit) (Cut From Haslam Set)-enTc.mp3\nDigital X - UNTITLED -July 2013- (Set Rip)-enTc.mp3\nDigital X Vs. Relyk - Everything About Raptor (Set Rip)-enTc.mp3\nDirty Shade &amp; Arma - Keep On Rockin (Cut From Xabi Set)-enTc.mp3\nDreamy - Connected Feelings (Bart Panco Remix) (Cut From Uplift Set)-enTc.mp3\nDuncan MacPherson - Soul Destroyer (Original Mix) (Cut From GO Set)-enTc.mp3\nE.F.G. &amp; Neptun 505 - Hoovercraft (Cut From Schulz Set)-enTc.mp3\nE.T Project - Forgotten Dreams (Nab Brothers Remix) (Cut From Saux Set)-enTc.mp3\nEast Cafe - Bending the Curve (Cut From Schulz Set)-enTc.mp3\nEnterpryse - Sand Of Love (Eshericks Remix) (Cut From Fonarev Set)-enTc.mp3\nExistence - Sunrise (Original Mix) (Cut From Uplift Set)-enTc.mp3\nExtravagance SL - Aventador (Intro Mix) (-Short- Cut From Eyden Set)-enTc.mp3\nFarhad Mahdavi - Take My Hand (Original Mix) (Cut From Uplift Set)-enTc.mp3\nFarhad Mahdavi - Take My Hand (TrancEye Remix) (Cut From Fady Set)-enTc.mp3\nFehrplay - Talk To Me (Cut From Matt Fax Set)-enTc.mp3\nFonarev &amp; Arrival - Alien Last Contact (A-Mase 'storm' Remix) (Cut From Fonarev Set)-enTc.mp3\nFroxic - Shock Therapy (Cut From Emery Set)-enTc.mp3\nGiuseppe Ottaviani &amp; Ferry Corsten - Magenta (Ahmed Romel Remix) (Cut From GO Set)-enTc.mp3\nGroven - Fieldwork (Cut From Schulz Set)-enTc.mp3\nHanski - New Beginning (C-Systems Remix) (Cut From A&amp;F Set)-enTc.mp3\nHarry Square - Spot The Difference (Cut From Bobina Set)-enTc.mp3\nHassan Jewel - Pretension (G8 Psychedelic Experience Edit) (Cut From Phil Taylor Set)-enTc.mp3\nIgor Dyachkov &amp; U-Jeen - Everyday (Andrew StetS Remix) (Cut From W&amp;W Set)-enTc.mp3\nIgor Dyachkov &amp; U-Jeen - Everyday (Original Mix) (Cut From Anderson Set)-enTc.mp3\nJallen - Bermuda (Sedi Remix) (ABGT 033 Rip)-enTc.mp3\nJamie Walker - Monarchy (Cut From Walker Set)-enTc.mp3\nJan Martin Feat. Hysteria - That's You (Louis Tan Remix) (Cut From Tritonal Set)-enTc.mp3\nJavah feat. Claire Willis - Let Me Show You (TrancEye Remix) (Cut From Romel Set)-enTc.mp3\nJaytech - Timelapse (Cut From Matt Fax Set)-enTc.mp3\nJoey Chilson - Lost &amp; Found (-Short- Cut From GO Set)-enTc.mp3\nJohn O'Callaghan - 2 Alien Craft Departing (Cut From Schulz Set)-enTc.mp3\nJonathan Carvajal - Ten (Original Mix) (Cut From Ozzy XPM Set)-enTc.mp3\nJosh Ferrin - Cry (Original Mix) (Cut From A&amp;F Set)-enTc.mp3\nJP Bates - Timestamp (Original Mix) (Cut From A&amp;F Set)-enTc.mp3","torrent":{"xt":"urn:btih:a9b6eb7d31cf77baf87a4c56adfcca303723cbee","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+August+1st%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9b6eb7d31cf77baf87a4c56adfcca303723cbee","infoHashBuffer":{"type":"Buffer","data":[169,182,235,125,49,207,119,186,248,122,76,86,173,252,202,48,55,35,203,238]},"announce":[],"urlList":[]}}