{"title":"Forest - 7inch single, LPs Forest(1969), Full Circle(1970) (mp3)","uid":8854556,"size":125588057,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a9df2cf17075ad92b133644cd1813760a9a620e7&amp;dn=Forest+-+7inch+single%2C+LPs+Forest%281969%29%2C+Full+Circle%281970%29+%28mp3%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"glngwl","files":31,"time":1377620035,"description":"Forest - UK psych/folk - complete discography (including rare 7-inch single)\n\n#  7-inch single &quot;Searching For Shadows&quot; (1969) (320 kbps, vinyl rip)\n#  LP &quot;Forest&quot; (1969) (160 kbps)\n#  LP &quot;Full Circle&quot; (1970) (192 kbps)\n\nEnglish psychedelic-folk / acid-folk trio who formed in Grimsby, Lincolnshire, in 1966. Made up of brothers Martin Welham, Adrian Welham and school friend Dez Allenby, they started out performing unaccompanied traditional folk music, and became pioneers of the nascent 1960s underground acoustic-psychedelic/acid-folk scene, writing unconventional songs using a variety of acoustic instruments.  Their sound was similar to Comus, Family, Incredible String Band, Fresh Maggots, and others.\n\nThey were championed by DJ John Peel and performed several sessions for BBC Radio 1.  They were amongst the first wave of signings for EMI's new progressive Harvest Records label, recording a non-album single &quot;Searching for Shadows&quot;, which was shortly followed by their debut eponymous album. The second album &quot;Full Circle&quot; was released a year later, and expanded upon the ideas of the first album, although the traditional folk piece 'Famine Song' saw the band return to its unaccompanied three-part harmony roots.\n\nDez Allenby left the band in 1971 and the Welhams drafted in Dave Panton (viola, oboe and saxophone) and Dave Stubbs (bass) for their live work.  Nonetheless the band's final festival appearance was that year (in Holland), and they disbanded the following year in 1972 after recording their final BBC Radio 1 sessions.\n\nThe band's only 7-inch single, their first release, is a particular rarity, and has never been bootlegged or re-released.  Its A-side ('Searching for Shadows') was not included on the first album when it was recorded shortly after, but its B-side ('Mirror of Life') was on the debut album.","torrent":{"xt":"urn:btih:a9df2cf17075ad92b133644cd1813760a9a620e7","amp;dn":"Forest+-+7inch+single%2C+LPs+Forest%281969%29%2C+Full+Circle%281970%29+%28mp3%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9df2cf17075ad92b133644cd1813760a9a620e7","infoHashBuffer":{"type":"Buffer","data":[169,223,44,241,112,117,173,146,177,51,100,76,209,129,55,96,169,166,32,231]},"announce":[],"urlList":[]}}