{"title":"Freddie Redd Quartet with Jackie McLean - 1960 - The Music From ","uid":8758583,"size":839053667,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a9f77f1a933a3899d5b230f1b719c06a3ff83a23&amp;dn=Freddie+Redd+Quartet+with+Jackie+McLean+-+1960+-+The+Music+From+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"eika256","files":-1,"time":1375196696,"description":"Freddie Redd Quartet with Jackie McLean - 1960 - The Music From The Connection (vinyl 24 96)\n\nFreddie Redd composed the music for Jack Gelber's The Connection, a gritty play about musician junkies. Gelber had originally thought that the play would feature real musicians -- who would also double as actors in minor roles -- improvising on blues and jazz standards in the tradition of Charlie Parker, but Redd convinced him to use an original score. The two weaved Redd's original compositions into the score, making it an integral part of the play, but the music holds up superbly on its own. Using the direction &quot;in the tradition of Charlie Parker&quot; as a starting point, the pianist wrote seven pieces of straight-ahead bop, wide open for improvisations, and then assembled a sterling quartet featuring himself, alto saxophonist Jackie McLean, bassist Michael Mattos, and drummer Larry Ritchie. The end result was a set of dynamic straight-ahead bop. While both Redd and McLean show signs of their influences -- the pianist blends Monk and Powell, while the saxophonist has built off of Bird's twisting lines -- they have developed their own voices, which gives the driving, bluesy bop on Music From the Connection an edge. McLean's full, robust tone often dominates, but he never overshadows Redd's complex, intricate playing, and both musicians, as well as Mattos and Ritchie, effortlessly keep up with the changes from hard-hitting, up-tempo bop numbers to lyrical, reflective ballads. Musically, Music From the Connection might not offer anything unexpected, but whenever straight-ahead bop is done this well, it should be celebrated. (AllMusic)\n\nTrack list:\nA1 Who Killed Cock Robin\nA2 Wigglin'\nA3 Music Forever\nB1 Time to Smile\nB2 Theme For Sister Salvation\nB3 Jim Dunn's Dilemma\nB4 O.D\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:a9f77f1a933a3899d5b230f1b719c06a3ff83a23","amp;dn":"Freddie+Redd+Quartet+with+Jackie+McLean+-+1960+-+The+Music+From+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9f77f1a933a3899d5b230f1b719c06a3ff83a23","infoHashBuffer":{"type":"Buffer","data":[169,247,127,26,147,58,56,153,213,178,48,241,183,25,192,106,63,248,58,35]},"announce":[],"urlList":[]}}