{"title":"Superior Stories #1 Invisible Man  Golden Age","uid":8743517,"size":17941912,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:aae3790837713775fdf56f1b25e6f35df41c6cf1&amp;dn=Superior+Stories+%231+Invisible+Man++Golden+Age&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mothra67","files":-1,"time":1374857175,"description":"The Invisible Man was a man called Griffin, an albino and scientist who had devoted himself to discovering the secret of invisibility by researching into optic density. His research is fruitful and he managed to invent a way to make the human body's refractive index the same as air so that it absorbs and reflects no light and thus becomes invisible.\n\nGriffin decided to test his theory by using the procedure on himself, but while successfully turning him invisible the results were permanent which eventually drove Griffin insane. In order to make himself visible again, Griffin wore a stolen trench coat and hat, and wrapped his head in bandages. He also covered his eyes with large dark goggles.\nGriffin later recruited Thomas Marvel, an unwitting tramp, to assist him as his first visible partner. Marvel was trusted to hold on to Griffin's scientific notebooks and stolen money. However, Marvel grows afraid of the Invisible Man and flees to Port Burdock with the notebooks and the money. There he seeks asylum from the Invisible Man by having the police protect him.\n\nAfter being betrayed by Marvel, Griffin pursues him to Port Burdock and runs into Dr. Arthur Kemp, an old schoolmate. He attempted to enlist Kemp's aid but was betrayed when his old schoolmate decided to go to the police. So, Griffin vowing vengeance planned to murder Kemp and begin his &quot;Reign of Terror&quot;. However, Kemp gets the people of Port Burdock to find and mob the Invisible Man. Griffin was then cornered and killed by navy workers. His invisibility drug wears off after death, and Griffin's body became visible once again.","torrent":{"xt":"urn:btih:aae3790837713775fdf56f1b25e6f35df41c6cf1","amp;dn":"Superior+Stories+%231+Invisible+Man++Golden+Age","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aae3790837713775fdf56f1b25e6f35df41c6cf1","infoHashBuffer":{"type":"Buffer","data":[170,227,121,8,55,113,55,117,253,245,111,27,37,230,243,93,244,28,108,241]},"announce":[],"urlList":[]}}