{"title":"Cobra 11","uid":8741245,"size":819476148,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:aaf0be27ebfb9e9b887c53c05f43228e5f7d204a&amp;dn=Cobra+11&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Anakin2313","files":59,"time":1374792676,"description":"=======================================================================\n\n&quot;Alarm for Cobra 11 - Nitro&quot;\n\nReadme_EN.txt\n\nThank you for purchasing &quot;Alarm for Cobra 11 - Nitro&quot;.\nThis readme file contains the latest information and troubleshooting advice.\n\nCONTENTS\n =======\n\n        1. SYSTEM REQUIREMENTS\n        2. INSTALLATION\n        3. GENERAL INFORMATION\n        4. CONFIGURATION\n        5. PC EXTRAS\n        6. PROBLEMS, HINTS &amp; TIPS\n        7. SERVICE INFORMATION\n\n=======================================================================\n \n 1. SYSTEM REQUIREMENTS\n ======================\n\n&quot;Alarm for Cobra 11 - Nitro&quot; uses Microsoft DirectX 9.0c.\n\nSystem Specifications\n* Windows XP with Service Pack 2\n* DirectX 9.0c\n* Athlon XP or Pentium IV 1.8 GHz or better\n* 256 MB RAM\n* 3D video card with at least 128 MB, at least Shadermodel 2.0, HW T&amp;L supported\n* DirectX 9.0c compatible sound card\n* 1.3 GB free hard drive space\n* 2x DVD ROM\n\n\nSupported video cards: AGP 4x / 8x or PCI Express\n\n* ATI Radeon 9600 or better\n* nVidia GeForce 6600 or better\nNot compatible with integrated video solutions, laptops in particular.\n\n\n=======================================================================\n\t\n 2. INSTALLATION\n ===============\n\nStart up Windows and place the &quot;Alarm for Cobra 11 - Nitro&quot; DVD in your PC's DVD ROM drive. If your computer has Autorun enabled, the launcher will appear automatically. If your computer does not have Autorun enabled, please double-click on the &quot;My Computer&quot; icon, then double-click the icon of your DVD ROM drive containing the &quot;Alarm for Cobra 11 - Nitro&quot; DVD. Next, click on &quot;Setup.exe&quot; and follow the on-screen instructions. You must have the DVD in your DVD ROM drive in order to play &quot;Alarm for Cobra 11 - Nitro&quot; after installing it. When the installation process for &quot;Alarm for Cobra 11 - Nitro&quot; has been completed, click on &quot;Start&quot; under Windows, move your mouse to highlight &quot;Programs&quot;, &quot;Alarm for Cobra 11 - Nitro&quot; and click on the &quot;Play Alarm for Cobra 11 - Nitro&quot; shortcut.\n\n=======================================================================\n \n 3. GENERAL INFORMATION\n ======================\n\nDirectX:\n&quot;Alarm for Cobra 11 - Nitro&quot; requires Microsoft DirectX 9.0c. Therefore, the video and sound card drivers installed on your PC must also be DirectX 9.0c compatible.\n\nVideo codec:\n&quot;Alarm for Cobra 11 - Nitro&quot; requires Windows Media Codecs V8 and V9. If these are not present on your system, please install the codec package.\nYou can find the installation file on the DVD in the &quot;WMCodec&quot; folder. Please launch the file &quot;wmp6cdcs.exe&quot; (for Media Player 6.4) or &quot;WM9Codecs9x.exe&quot; (for Media Player 7.1 and later) manually.\n\nYou can find the installation file on Microsoft's web pages at the URL:  &lt;a href=&quot;\nhttp://www.microsoft.com/windows/windowsmedia/download/default.asp&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.microsoft.com/windows/windowsmedia/download/default.asp&lt;/a&gt;\n\nWindows XP:\nWe recommend installing drivers (ideally certified by Microsoft) distributed by your hardware manufacturer for Windows XP. These are to be preferred over the drivers installed by Microsoft when setting up your computer.\n\nBackground applications:\n&quot;Alarm for Cobra 11 - Nitro&quot; makes full use of your system's resources. We therefore recommend closing all other programs before you start &quot;Alarm for Cobra 11 - Nitro&quot;. \n\n=======================================================================\n\n 4. CONFIGURATION\n ================\n\nYou can start the configuration for &quot;Alarm for Cobra 11 - Nitro&quot; any time by clicking on the file &quot;C11_Setup.exe&quot; in the &quot;Alarm for Cobra 11 - Nitro&quot; directory or from the Start menu, in order to adjust your settings. Some of the settings in this menu refer to very specific technical details. If you are not sure which options to choose, or if &quot;Alarm for Cobra 11 - Nitro&quot; no longer starts up, click on the &quot;Defaults&quot; button. This restores the presets, which should always enable you to run &quot;Alarm for Cobra 11 - Nitro&quot;.\n\nResolution: Set the screen resolution for &quot;Alarm for Cobra 11 - Nitro&quot;. The options listed in the pull-down menu depend on the video card and monitor used.\n\nWindowed Size: Adjusts the size of the window for playing &quot;Alarm for Cobra 11 - Nitro&quot; in windowed mode (if selected).\n\nTexture Resolution: Higher resolution textures look better, but they also require more memory on your video card.\n\nUpdate Reflections: This sets the interval between calculations of reflections. Short intervals make your game look better at the cost of performance.\n\nView Distance: Sets the distance to which graphics are calculated. Increasing the visual range lowers the performance, but greatly improves the game's appearance.\n\nGrass Detail Level: This sets the density of grass displayed. At the highest setting, the distance to which grass is drawn is also increased.\n\n3D Car Shadow: Enables 3D auto shadows for the player's vehicle and enemy vehicles, depending on the setting (default: player only).\n\nFullscreen: When activated (default), &quot;Alarm for Cobra 11 - Nitro&quot; will run in full screen mode.\n\nCenter window: If &quot;Alarm for Cobra 11 - Nitro&quot; is running in windowed mode, the window appears in the center of the screen.\n\nWidescreen (16:9): &quot;Alarm for Cobra 11 - Nitro&quot; runs in widescreen mode (default: off).\n\nWideWindow (16:9): The same as widescreen, but in windowed mode.\n\nAntialias: Enables smooth borders. This looks good, but lowers the game performance. Disabled by default.\n\nSquare Pixels: A special mode that makes use of the features of certain video cards.\n\nAdvanced: Opens the setup menu for advanced players (see description below).\n\nPlay videos: Plays back in-game videos (default: on).\n\nPlay videos: WMV9 (dafault) or WMV8. Allows choosing the video codec. This option should be changed if the default setting leads to graphics errors or stalls in the game menu.\n\nEnable sound: Enables sounds in &quot;Alarm for Cobra 11 - Nitro&quot;.\n\nEnable music: Enables music in &quot;Alarm for Cobra 11 - Nitro&quot;.\n\n4 channels surround sound: Enables surround sound (only if the required hardware is available).\n\nDefaults: Restores the presets.\n\nPlay: Saves the current settings and launches &quot;Alarm for Cobra 11 - Nitro&quot;.\n\nAdvanced Setup\nThe Advanced Setup menu is intended for advanced PC users and mainly contains fine tuning options for the video settings. The presets can be restored by clicking on the &quot;Defaults&quot; button.\n\n\n=======================================================================\n\n 5. PC EXTRAS\n ============\n \n MyMusic files:\n\nInstead of using the music tracks from &quot;Alarm for Cobra 11 - Nitro&quot;, you can also play your own selection of music. To do so, simply place the music files in the &quot;MyMusic&quot; sub-folder of the &quot;Alarm for Cobra 11 - Nitro&quot; installation folder and access the Music Manager from the main menu in order to switch to your personal music selection.\nYou can also create new sub-folders under &quot;MyMusic&quot; and save whole CDs there.\nThe Music Manager can read the following formats: .WAV .WMA .MP3 .MP2 .OGG .AC3 .AIF .AIFF. Please note that you must first install the required Media codec. Such codecs are not part of &quot;Alarm for Cobra 11 - Nitro&quot;.\n\n=======================================================================\n\n 6. PROBLEMS, HINTS &amp; TIPS\n =========================\n\nAnti virus software can cause problems during gameplay. We therefore strongly recommend temporarily disabling anti virus software and other background applications while installing or playing the game.\n\nClicking and Hitching Track Sounds \nThis can be caused if your framerate is too low, and is technically unavoidable. Please check your sound card drivers and update them if necessary. Please also lower the visual range in the game or the resolution setup, as this may limit or remove the problem. \n\n&quot;Alarm for Cobra 11 - Nitro&quot; does not support DirectX7 or DirectX 8 video cards. Please use DirectX 9 compatible devices with Shadermodel 2.0 and HW T&amp;L support. Integrated solutions, so-called onboard chips, are not supported.\n\nIf the video display in the menu freezes while loading the next video, this can usually be corrected by updating to a higher version of Windows Media Player. You can find the installation files on Microsoft's web pages at the URL: http://www.microsoft.com/windows/windowsmedia/download/default.asp\n\n=======================================================================\n \n 7. SERVICE INFORMATION\n ======================\n     \nAll service information is included in the back of the manual.\nPlease check online for further information at http://www.cobra11-nitro.de/\n\n=======================================================================\n\n\n=======================================================================\n*end of readme*\n======================================================================\n\n","torrent":{"xt":"urn:btih:aaf0be27ebfb9e9b887c53c05f43228e5f7d204a","amp;dn":"Cobra+11","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aaf0be27ebfb9e9b887c53c05f43228e5f7d204a","infoHashBuffer":{"type":"Buffer","data":[170,240,190,39,235,251,158,155,136,124,83,192,95,67,34,142,95,125,32,74]},"announce":[],"urlList":[]}}