{"title":"Don't Tread On Me - Rise of the Republic [ISO]","uid":5594874,"size":4664666112,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:ac92f7ca46552f9ced6e569d772ecb5d8ff9fa25&amp;dn=Don%5C%27t+Tread+On+Me+-+Rise+of+the+Republic+%5BISO%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cinesimon","files":-1,"time":1275001762,"description":"From the Tea Party Movement to State Legislators, the American people are drawing a line in the sand. On what side of it will you stand? Has the government our Founders created been forgotten by Washington DC? Is a Patriot Uprising ready to capture the spirit of 1776? &quot;Don't Tread On Me: Rise of the Republic&quot; gives the viewer a look into the movements, mindset, and legislation that will catapult the &quot;Great Restoration&quot; into households across America.\n\nWhat is the choke-collar the Federal Government uses to reign in the States? Are the States sovereign or subjects of Washington DC? What did the Founders foresee and how did they seek to protect us from a tyrannical government?\n\n&quot;Don't Tread On Me: Rise of the Republic&quot; exposes the commerce clause, defines Sovereignty, the proper role of government, a Constitutional Militia and much more. &quot;Don't Tread On Me: Rise of the Republic&quot; offers sound solutions to take back rights stolen by our out-of-control, despotic federal government. &quot;Don't Tread On Me: Rise of the Republic&quot; will educate, inspire, and activate a nation desperately seeking direction.\n\nWhat side of the line will you stand?\n\n\n\n\n\n\n\n\n\n\nNOTE: This is the FULL DVD that can be burned to a DVD -R.\n\nUse a free program like IMGBurn to burn it to disc.","torrent":{"xt":"urn:btih:ac92f7ca46552f9ced6e569d772ecb5d8ff9fa25","amp;dn":"Don%5C%27t+Tread+On+Me+-+Rise+of+the+Republic+%5BISO%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac92f7ca46552f9ced6e569d772ecb5d8ff9fa25","infoHashBuffer":{"type":"Buffer","data":[172,146,247,202,70,85,47,156,237,110,86,157,119,46,203,93,143,249,250,37]},"announce":[],"urlList":[]}}