{"title":"Process Lasso Pro v5.1.0.78 by pmp317","uid":8743813,"size":2520048,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:acb7b6976db22f04160b0f6d87fcbfb86177b415&amp;dn=Process+Lasso+Pro+v5.1.0.78+by+pmp317&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pmp317","files":-1,"time":1374866037,"description":"Process Lasso is NOT yet another task manager. It is a process priority optimization and system automation utility. Priority optimization, affinity optimization, core optimization, automated rules, automated power schemes, you name it and Process Lasso has it.\n\nProcess Lasso's most popular feature is the unique process optimization technology called ProBalance (Process Balance) that will improve your PC's responsiveness and stability through process priority optimization and/or CPU affinity adjustments. Windows, by design, allows programs to monopolize your CPU without sufficient restraint -- leading to hangs, micro-lags, and delays in your keystroke or mouse actions. ProBalance intelligently adjusts the priorities and/or CPU affintiies of running programs, on-demand, as-needed so that badly behaved processes won't negatively impact the responsiveness of your PC. ProBalance works by LOWERING the priority of select background processes in high loads, NOT raising priorities.\n\nDon't just take our word on ProBalance, try the graphical proof of concept NOW!. It is a simple 'CPU Eater' running at normal priority, something any programmer can easily recreate in any language. The difference with or without ProBalance is amazing.\n\nIn addition to ProBalance, there are countless features allowing the user to take full automated control of the processes on their PC. You can have a wide range operations performed, or settings applied, each time a process is run. Core optimization technologies allow you to choose on what CPUs/cores a process should run, as well as what their CPU priority class and I/O priority class should be. You can also disallow certain processes from running, log all processes run, and even set various other process rules. These rules, amongst many others, include automatically restarting or terminating a process after it reaches some CPU or memory threshold.\n\nOptimize - Automate\n\nProcess Priority and CPU Affinity Optimization\nProBalance, dynamically adjusts priorities and CPU affinities of monopolizing process(es)\nHyper-Threaded core avoidance\nProcess Settings Automation\nPersistent (saved) CPU, memory, and I/O priorities, CPU affinities, and other process settings\nDisallowed processes, terminate bothersome processes every time they are seen running\nInstance limits, limit the number of instances a process may have per user session, or for the whole PC\nRestart selected processes if they terminate, crash, or are closed\nWatchdog allows custom rules. When processes go over a CPU or virtual memory threshold, one can execute a command, change their CPU affinity, process priority class, I/O priority, trim the working set, log the occurrence, and more!\nPower Profile Automation\nEnergy Saver let's you specify idle and non-idle power profiles \ne.g. Run in High Performance when a user is active, but drop back to Balanced when PC is idle\nApplication Power Profiles, switch power profiles when certain applications are running\nPrevent Sleep, keeps the PC or display awake when certain applications are running\nGaming / Multimedia\nGaming and Multimedia Mode to auto-optimize for game processes, when they are running\nAdvanced\nStand-alone core engine that can run as a system service\nUnique System Responsiveness metric with over a decade of real-world use and testing\nDesigned for multi-user environments\nDisplay of Parked Cores in easy to read shaded graphs\nNeed to disable CPU Core Parking? Check this Bitsum freeware until it becomes part of Process Lasso\nMinimal resource use and totally optional GUI that goes into a sleep-mode when minimized to the tray\nLog of processes launched, and statistics on process duration and average CPU use when they exit\nSilent installer with command line switches for easy deployment\nOptional password protection on configuration\nSilent and automated updates\nSo much more...","torrent":{"xt":"urn:btih:acb7b6976db22f04160b0f6d87fcbfb86177b415","amp;dn":"Process+Lasso+Pro+v5.1.0.78+by+pmp317","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acb7b6976db22f04160b0f6d87fcbfb86177b415","infoHashBuffer":{"type":"Buffer","data":[172,183,182,151,109,178,47,4,22,11,15,109,135,252,191,184,97,119,180,21]},"announce":[],"urlList":[]}}