{"title":"Vader -Polish Death/black metal -3Videoclips {Blasphemy}","uid":5643597,"size":107515016,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:acf4b577915456be7e843644b069090aad5a0279&amp;dn=Vader+-Polish+Death%2Fblack+metal+-3Videoclips+%7BBlasphemy%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Mork_Blasphemy","files":3,"time":1277167897,"description":"Biography\n\nVader formed in 1986, toiling around the European death and thrash circuit while releasing demos into the metal tape-trading circuit. Their 1990 demo Morbid Reich became a huge hit in the underground, leading to a record deal with Earache in 1992. This made them the first death metal band from behind the Iron Curtain to sign a record deal outside of their native Poland. The same year, they released The Ultimate Incantation, a large success in the metal underground. They toured with Bolt Thrower, Grave, Deicide, and many other bands to bring their live performances to American audiences. They left Earache the next year and released two more albums, Sothis (on Repulse Records) and The Darkest Age: Live '93 (on Baron Records). They tried to continue touring despite the declining popularity of death metal and the lack of a consistent recording contract. In 1995, they signed a deal with Impact Records, allowing them to maintain a regular album release schedule. Hammerheart Records released their Necrolust and Morbid Reich demos on CD in 1998, as the band was enjoying their biggest success up to that point with the archival release Reborn in Chaos. They also recorded a live album that year, a mini-album (Kingdom), a VHS video, and signed a new record deal with Metal Blade. By the time 1999 rolled around, the band was opening for Slayer and had their first headlining American tour. They released Litany in 2000 and Reign Forever World in 2001, both on Metal Blade, and continued their grueling touring schedule. Revelations arrived in 2002, followed by Beast in 2004, and Impressions in Blood in 2006.\n\n\nPlease SEED!!Enjoy!!\n","torrent":{"xt":"urn:btih:acf4b577915456be7e843644b069090aad5a0279","amp;dn":"Vader+-Polish+Death%2Fblack+metal+-3Videoclips+%7BBlasphemy%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acf4b577915456be7e843644b069090aad5a0279","infoHashBuffer":{"type":"Buffer","data":[172,244,181,119,145,84,86,190,126,132,54,68,176,105,9,10,173,90,2,121]},"announce":[],"urlList":[]}}