{"title":"Prepare-se: A Chegada do Anticristo.zecarlos","uid":5524297,"size":8462007685,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:acfd3adea3e7bff12dc90c96907de36487ed5e76&amp;dn=Prepare-se%3A+A+Chegada+do+Anticristo.zecarlos&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"zecarlos","files":-1,"time":1272723275,"description":"EpisÃƒÂ³dio 1:\nNesse primeiro documentÃƒÂ¡rio abordamos a Nova Ordem Mundial, seus organizadores e a estratÃƒÂ©gia montada ao longo dos tempos para a sua implementaÃƒÂ§ÃƒÂ£o. ConheÃƒÂ§a os Illuminati, os Bilderbergs e seus objetivos.\nSaiba sobre o mega sacrifÃƒÂ­cio do 11 de setembro, as farsas do homem na Lua, os discos voadores, aquecimento global e demais articulaÃƒÂ§ÃƒÂµes a fim de nos preparar pra aceitar as mudanÃƒÂ§as radicais que ocorrerÃƒÂ£o ainda esse ano!\nConheÃƒÂ§a o plano diabÃƒÂ³lico sobre a reduÃƒÂ§ÃƒÂ£o populacional e o significado do numero 11 para os Illuminati\nFinalmente vocÃƒÂª conhecerÃƒÂ¡ o que a TV esconde de todos nÃƒÂ³s, pois colocamos nesse documentÃƒÂ¡rio. Veja imagens inÃƒÂ©ditas das explosÃƒÂµes que levaram o WTC ao chÃƒÂ£o e a infundada tentativa do governo de culpar a terroristas.\n\nEpisÃƒÂ³dio 2:\nO segundo documentÃƒÂ¡rio da SÃƒÂ©rie Prepare-se apresenta a verdade por trÃƒÂ¡s da ida ÃƒÂ  Lua, com gravaÃƒÂ§ÃƒÂµes inÃƒÂ©ditas dos astronautas se comunicando com o comando na Terra.\nAbordamos tambÃƒÂ©m vÃƒÂ¡rias matÃƒÂ©rias sobre a Rede Globo, alÃƒÂ©m de outros assuntos, como os campos de concentraÃƒÂ§ÃƒÂ£o da FEMA.\nSaiba a relaÃƒÂ§ÃƒÂ£o da Globo com a deusa Artemis, Veja tambÃƒÂ©m informaÃƒÂ§ÃƒÂµes importantes sobre as votaÃƒÂ§ÃƒÂµes no Congresso Americano que tem sido coagido a votar leis contra a prÃƒÂ³pria populaÃƒÂ§ÃƒÂ£o americana.\nConheÃƒÂ§a o que significa a FEMA, como foi criada e qual a sua finalidade. Veja de forma inÃƒÂ©dita os campos de concentraÃƒÂ§ÃƒÂ£o e os caixÃƒÂµes preparados para milhÃƒÂµes de americanos quando for lanÃƒÂ§ada a Lei Marcial na AmÃƒÂ©rica.\n\nEpisÃƒÂ³dio 3:\nO terceiro documentÃƒÂ¡rio da sÃƒÂ©rie Prepare-se nos mostra fatos inÃƒÂ©ditos e importantes que a MÃƒÂ­dia tradicional nÃƒÂ£o pode nos passar, como os ÃƒÂ´nibus de evacuaÃƒÂ§ÃƒÂ£o maciÃƒÂ§a nos EUA, os trens da FEMA, o cristo redentor sendo destruÃƒÂ­do em um novo filme de Hollywood, e muito mais...\nAssista o discurso de Bush (Pai) com 10 anos antes da queda do WTC, saiba tambÃƒÂ©m como foi a criaÃƒÂ§ÃƒÂ£o da Nova Ordem Mundial, e as guerras que foram necessÃƒÂ¡rias para isso. AtravÃƒÂ©s desse novo documentÃƒÂ¡rio vocÃƒÂª ficarÃƒÂ¡ sabendo de todos os plano para implementaÃƒÂ§ÃƒÂ£o da tirania global.\nEstratÃƒÂ©gias mÃƒÂ³rbidas estÃƒÂ£o sendo utilizadas como os rastros quÃƒÂ­micos que estÃƒÂ£o cada dia mais constantes. Na AmÃƒÂ©rica um policial reuniu diversas pessoas em uma praÃƒÂ§a e denunciou os planos da Elite Global de levar as pessoas para os campos da FEMA e cometer um genocÃƒÂ­dio em grande escala!\n\nEpisÃƒÂ³dio 4:\nO quarto documentÃƒÂ¡rio da SÃƒÂ©rie Prepare-se trÃƒÂ¡s as mais recentes informaÃƒÂ§ÃƒÂµes sobre os acontecimentos finais na preparaÃƒÂ§ÃƒÂ£o para os terrÃƒÂ­veis eventos preparados pelos senhores do mundo.\nConheÃƒÂ§a a manipulaÃƒÂ§ÃƒÂ£o sobre a pandemia da Gripe SuÃƒÂ­na e o remÃƒÂ©dio Tamiflu. Veja como americanos tem saÃƒÂ­do as ruas e filmado toda a movimentaÃƒÂ§ÃƒÂ£o estranha por parte do Governo Americano e estÃƒÂ£o fugindo para as montanhas com medo da vacina.\nJane Burgemeister, uma jornalista austrÃƒÂ­aca, foi despedida apÃƒÂ³s denunciar que a Elite Global, junto a ONU e OMS estÃƒÂ£o se preparando para exterminar 3 bilhÃƒÂµes de pessoas com a pandemia. Ela cita em seu dossiÃƒÂª, Barack Obama e David Rockeffeler entre outros.\nOs exÃƒÂ©rcitos do MÃƒÂ©xico, CanadÃƒÂ¡ e AustrÃƒÂ¡lia estiveram nos EUA no final de Julho, participando de exercÃƒÂ­cios de guerra.\n\nEpisÃƒÂ³dio 5:\nNo quinto documentÃƒÂ¡rio da SÃƒÂ©rie Prepare-se saiba o que a TV esconde de vocÃƒÂª. Veja como estÃƒÂ¡ a situaÃƒÂ§ÃƒÂ£o atual nos Estados Unidos. Como as pessoas estÃƒÂ£o reagindo ao Painel da morte de Obama e o que ele tem a dizer sobre isso.\nA populaÃƒÂ§ÃƒÂ£o americana sofre com o descaso e o corte de verba destinada ÃƒÂ  saÃƒÂºde nos Estados Unidos, que estÃƒÂ¡ incentivando a EutanÃƒÂ¡sia. Saiba tambÃƒÂ©m porque os EUA pode se desintegrar como a UniÃƒÂ£o SoviÃƒÂ©tica. O alerta ÃƒÂ© de um renomado analista da KGB.\nDavid Rockefeller fala sobre a sua preocupaÃƒÂ§ÃƒÂ£o com aumento populacional. Aprenda mais um pouco sobre os Illuminati e sua espiritualidade. Saiba por que o enorme interesse no Iraque, como fazem sacrifÃƒÂ­cios humanos em massa.\nVeja tambÃƒÂ©m um documentÃƒÂ¡rio totalmente produzido por nÃƒÂ³s, mostrando o que hÃƒÂ¡ de comum entre: Ninrode, Titanic, John Lennon, Super-Homem e Tancredo Neves.\n\nEpisÃƒÂ³dio 6:\nO sexto documentÃƒÂ¡rio da SÃƒÂ©rie Prepare-se mostra o sistema que comanda o mundo a cada dia e trabalha para implementaÃƒÂ§ÃƒÂ£o da sua famigerada agenda global. Nas sombras, caminham furtivamente, oculto por trÃƒÂ¡s do sistema implementado jÃƒÂ¡ hÃƒÂ¡ muito tempo.\nExiste um grande encobrimento de um planejamento terrÃƒÂ­vel contra todos os seres humanos. Mas, a partir de agora, vocÃƒÂª estarÃƒÂ¡ imune a suas tÃƒÂ¡ticas, pois mesmo contra a vontade dos senhores do mundo, vocÃƒÂª estarÃƒÂ¡ conhecendo suas maiores artimanhas e ocultas por trÃƒÂ¡s da TV, da escola e da imprensa.\nTodo o mal que eles tem planejado contra a humanidade serÃƒÂ£o descobertos. Finalmente aprenda como eles trabalham e saiba como se comportar quanto a esse planejamento diabÃƒÂ³lico.\n\nEpisÃƒÂ³dio 7:\nO sÃƒÂ©timo documentÃƒÂ¡rio da SÃƒÂ©rie Prepare-se mostra que a mÃƒÂ­dia convencional nÃƒÂ£o comenta sobre o CODEX ALIMENTARIUS, e se comentar certamente que farÃƒÂ¡ de forma diferente da realidade, nÃƒÂ£o para informar, mas apenas para dar uma resposta do seu jeito a algo que escondem da populaÃƒÂ§ÃƒÂ£o.\nO CODEX ALIMENTARIUS estÃƒÂ¡ sendo planejado desde 1962 e aqui vocÃƒÂª terÃƒÂ¡ todas as informaÃƒÂ§ÃƒÂµes sobre isso. Outros assuntos de igual relevÃƒÂ¢ncia sÃƒÂ£o tratados neste documentÃƒÂ¡rio como o atual momento em que vive o Governo Americano.\nAgora ÃƒÂ© oficial, embora a maioria das pessoas nÃƒÂ£o suspeitem de nada, o governo frances jÃƒÂ¡ estÃƒÂ¡ com toda a articulaÃƒÂ§ÃƒÂ£o posta em prontidÃƒÂ£o para vacinar de forma obrigatÃƒÂ³ria a cada cidadÃƒÂ£o francÃƒÂªs.\n\nEpisÃƒÂ³dio 8:\nO oitavo documentÃƒÂ¡rio da SÃƒÂ©rie Prepare-se estÃƒÂ¡ abordando entre outros assuntos, a vacina contra a Gripe SuÃƒÂ­na. Depois de Barbara Lou Fisher fazer um alerta quanto ao seu risco, diversas outras pessoas ligadas ÃƒÂ  saÃƒÂºde no mundo todo vem fazendo o mesmo alerta.\nOs profissionais de saÃƒÂºde de Nova York foram ÃƒÂ s ruas protestar contra a obrigatoriedade da vacina e pela TV Fox ao vivo um mÃƒÂ©dico entrevistado deixou bem claro que nÃƒÂ£o toma a vacina nem aplica em seus filhos. Neste documentÃƒÂ¡rio vocÃƒÂª terÃƒÂ¡ muito mais informaÃƒÂ§ÃƒÂµes sobre esse assunto.\nNossa matÃƒÂ©ria de capa trÃƒÂ¡s a nova arma acÃƒÂºstica de longo alcance. Esse equipamento jÃƒÂ¡ estÃƒÂ¡ substituindo as bombas de efeito moral, as balas de borracha e outras armas consideradas nÃƒÂ£o letais. Foi utilizada na ÃƒÂºltima reuniÃƒÂ£o do G20 para dispersar tumultos.\n\nEpisÃƒÂ³dio 9:\nO nono documentÃƒÂ¡rio da SÃƒÂ©rie Prepare-se aborda assuntos de mÃƒÂ¡xima importÃƒÂ¢ncia. Em Dezembro de 2009 serÃƒÂ¡ assinado o tratado de Copenhague e nesse tratado, o mundo todo atravÃƒÂ©s de seus representantes, tomarÃƒÂ£o algumas decisÃƒÂµes a respeito do clima no planeta.\nIrÃƒÂ£o tributar os paÃƒÂ­ses mais desenvolvidos e esse tributos serÃƒÂ£o repassados aos paÃƒÂ­ses menores para aderirem ao tratado de um governo mundial. O problema do clima ÃƒÂ© na verdade somente uma fachada para esse evento, saiba porque!\nEsse nÃƒÂ£o serÃƒÂ¡ o ÃƒÂºnico tema ou assunto a ser tratado, mas certamente para nÃƒÂ³s ÃƒÂ© o mais importante e preocupante, porque atravÃƒÂ©s desse tratado onde se irÃƒÂ¡ tirar dos paÃƒÂ­ses ricos para dar aos paÃƒÂ­ses pobres, estarÃƒÂ£o usando um argumento muito forte, o dinheiro, para convencer a todos em aderir ao tratado.\n\nEpisÃƒÂ³dio 10:\nO dÃƒÂ©cimo documentÃƒÂ¡rio da SÃƒÂ©rie Prepare-se, mostra como Al Gore o homem escolhido pelos senhores do mundo para liderar a farsa do aquecimento global, tenta se promover em um dia de autÃƒÂ³grafos do seu livro em um shopping, de repente seus leitores comeÃƒÂ§am a fazer perguntas que o deixam sem palavras e sua atitude ÃƒÂ© a mais vergonhosa de todas, simplesmente se retirar.\nConheÃƒÂ§a a vacina da gripe suÃƒÂ­na, uma vacina que cria vÃƒÂ­timas, podendo causar efeitos colaterais assustadores nos sobreviventes!\nOs americanos sentem a queda de sua naÃƒÂ§ÃƒÂ£o, como a maior potÃƒÂªncia no mundo e sendo o berÃƒÂ§o da manipulaÃƒÂ§ÃƒÂ£o mundial. Cada vez mais os americanos percebem a mudanÃƒÂ§a iminente chegar!\nA vergonha nacional! Pastores assalariados nos USA, veja uma nova ditadura escondida na sociedade.\n\nEpisÃƒÂ³dio 11:\nO dÃƒÂ©cimo primeiro documentÃƒÂ¡rio da SÃƒÂ©rie Prepare-se, mostra como a manipulaÃƒÂ§ÃƒÂ£o atravÃƒÂ©s dos filmes, revistas e nas mÃƒÂºsicas atuam como uma lavagem em nossas mentes, com suas mensagens subliminares, e estÃƒÂ£o nos preparando para seus objetivos futuros mundiais.\nVeja tambÃƒÂ©m porque os franceses se negaram a tomar a nova vacina.\nForam compradas na FranÃƒÂ§a uma quantidade enorme de vacinas, suficiente para vacinar toda a populaÃƒÂ§ÃƒÂ£o, porÃƒÂ©m as pessoas estÃƒÂ£o decididas a nÃƒÂ£o tomarem a vacina por receio e inseguranÃƒÂ§a.\nMichael Jackson um ÃƒÂ­dolo que moveu o mundo com suas mÃƒÂºsicas, nos deixou uma mensagem de alerta que a TV nÃƒÂ£o pode mostrar. Veja tudo isso aqui.\n\nEpisÃƒÂ³dio 12:\nO dÃƒÂ©cimo segundo documentÃƒÂ¡rio da SÃƒÂ©rie Prepare-se, ÃƒÂ© especial... O NATAL...\nQual o verdadeiro mistÃƒÂ©rio e sentido por trÃƒÂ¡s do Natal? Por que o natal ÃƒÂ© comemorado pela humanidade a cada ano?\nVocÃƒÂª sabia que se comemora o natal inclusive em paÃƒÂ­ses nÃƒÂ£o cristÃƒÂ£os, onde nÃƒÂ£o se crÃƒÂª em Jesus? Por que isso?\nDescubra a ligaÃƒÂ§ÃƒÂ£o desta data com as antigas civilizaÃƒÂ§ÃƒÂµes, entenda finalmente todo o paganismo que estÃƒÂ¡ por trÃƒÂ¡s dessa data. Saiba quem ÃƒÂ© a mulher misteriosa que todas as religiÃƒÂµes pagÃƒÂ£s, sem exceÃƒÂ§ÃƒÂ£o, cultuam hÃƒÂ¡ milÃƒÂªnios...\nInclusive ÃƒÂ© a mesma mulher que estÃƒÂ¡ presente em todas as moedas do mundo. Por que? Quem ÃƒÂ© ela? Descubra a origem de fatos que se arrastam pela humanidade desde a Torre de Babel. Surpreenda-se!","torrent":{"xt":"urn:btih:acfd3adea3e7bff12dc90c96907de36487ed5e76","amp;dn":"Prepare-se%3A+A+Chegada+do+Anticristo.zecarlos","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acfd3adea3e7bff12dc90c96907de36487ed5e76","infoHashBuffer":{"type":"Buffer","data":[172,253,58,222,163,231,191,241,45,201,12,150,144,125,227,100,135,237,94,118]},"announce":[],"urlList":[]}}