{"title":"edge of darkness por memitoxxx etorrents.org ( ingles/latino)","uid":5617909,"size":4509114368,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:ae61256f4fea834f0f5b1eb9e45bf4fde23dcf8e&amp;dn=edge+of+darkness+por+memitoxxx+etorrents.org+%28+ingles%2Flatino%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"memitoxxx","files":15,"time":1276137081,"description":"Directed by \tMartin Campbell\nProduced by \tGraham King\nTim Headington\nMichael Wearing\nWritten by \tWilliam Monahan\nAndrew Bovell\nTroy Kennedy Martin (Series)\nStarring \tMel Gibson\nRay Winstone\nDanny Huston\nBojana Novakovic\nJay O. Sanders\nMusic by \tHoward Shore\nCinematography \tPhil Meheux\nEditing by \tStuart Baird\nStudio \tGK Films\nBBC Films\nIcon Productions\nDistributed by \tWarner Bros. Pictures\nRelease date(s) \t28 January 2010 (2010-01-28)\n02010-05-11 11 May 2010 (United States)\n(DVD Release)\nRunning time \t117 minutes\nCountry \tUK, United States\nLanguage \tEnglish\nBudget \t$87 million\nGross revenue \t$79,644,708,\n\nBy moonlight, three bodies float to the surface of the Western Massachusetts stretch of the Connecticut River. At South Station, Boston, Thomas Craven (Mel Gibson) picks up his daughter, Emma (Bojana Novakovic), who has returned home to visit. She vomits while getting into the car. At home, as Thomas prepares a meal, Emma starts to nosebleed and vomits again, and then says that she needs to see a doctor and tell him something. When they stop at the porch, as they hurriedly leave to find a hospital, a masked gunman yells &quot;Craven!&quot; and then fires simultaneous shotgun blasts at Emma before driving away. Blasted through the door, she dies in Thomas' arms.\n\nAt first, everyone believes that Thomas, a police detective, was the gunman's target, but when Thomas finds Emma had a pistol in her night stand, he starts to suspect that Emma was an intended target. He checks the ownership of the pistol and finds that it belongs to her boyfriend David (Shawn Roberts). David fears the company Northmoor where Emma worked, and Thomas discovers that Emma realized that Northmoor was manufacturing nuclear weapons, intended to be traced to foreign nations if they are used as dirty bombs. Following the failed break-in of the activists seen dead at the opening, Emma was poisoned with thallium through a carton of organic milk. Burning her effects in his backyard, Thomas encounters Jedburgh (Ray Winstone), a &quot;consultant&quot; tasked to prevent Craven from discovering Emma's information, or kill him. Liking each other, instead, Jedburgh leaves Thomas to investigate. Throughout the film, Thomas repeatedly imagines he hears and sees his daughter, even having short conversations and interactions with her.\n\nThomas also has several encounters with Northmoor mercenaries, and he eventually discovers through Emma's activist contact that Jack Bennett (Danny Huston), head of Northmoor, ordered the murder of his daughter, as well as the activists Emma was working with to steal evidence of the illegal nuclear weapons. Northmoor personnel kill a hitman marked as a fall guy after he is set up for killing Emma's boyfriend, and attempt to murder another activist who gave Emma's information to Thomas. Thomas confronts a lawyer and senator that Emma contacted, revealing that they know almost everything that happened. At night, Craven's fellow detective and friend, Bill (Jay O. Sanders) talks to Craven at his home while Northmoor operatives break into the house. Craven realizes that Bill set him up, and the operatives taser and kidnap him, take him to Northmoor, and poison him with thallium, as his daughter was. Thomas manages to quickly escape the facility and returns home.\n\nIll from the poison, Thomas arrives at Bennett's house and kills the mercenaries, one of whom Thomas realizes is the man who shot his daughter after he orders him at gunpoint to scream the name &quot;Craven&quot;. He then executes his daughter's killer. Bennett shoots Thomas, but Thomas tackles Bennett and pulls out the radioactive milk. He forces it down Bennett's throat and collapses. Bennett runs to his cabinet to get pills to counteract the radioactivity but Tom drags himself over and shoots Bennett in the throat, killing him.\n\nThomas is hospitalized for the gunshot wounds and radiation poisoning. Jedburgh, who is revealed to be suffering from a terminal illness, meets with Moore, the Senator (for whom he had been working) and the political advisor who assigned Jedburgh to eliminate Craven. He listens to their suggestions as to how to play the Northmoor incident in a positive light. He tells them that he is done and then suggests an assassination attempt on the Senator should be the feature story, to drive Bennett's death out of the tabloids. They are happy to go along with the story until Jedburgh tells the senator that he is on the wrong side of the equation. Jedburgh then pulls out a gun and shoots all three men dead before a young Massachusetts State Police officer enters. Jedburgh points his gun at the officer and asks if the young man has a family and kids. The officer says yes, so Jedburgh lowers his gun but is instantly shot dead by the officer.\n\nAs Thomas lies dying in the hospital, Emma is shown walking into his room and leaning down at his bedside and whisper in his ear. Across town, a young reporter opens a letter from Thomas with DVDs revealing the conspiracy, with Thomas's &quot;good luck&quot; wishes, ensuring the company's end. As he dies, Emma comforts him. Then the father and daughter are shown leaving the hospital together, walking down the corridor and toward a bright, white light.\n\n\nIMAGENES\n &lt;a href=&quot;\nhttp://img814.imageshack.us/img814/4049/20100609171143.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img814.imageshack.us/img814/4049/20100609171143.png&lt;/a&gt; &lt;a href=&quot;\nhttp://img532.imageshack.us/img532/7002/20100609171218.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img532.imageshack.us/img532/7002/20100609171218.png&lt;/a&gt; &lt;a href=&quot;\nhttp://img42.imageshack.us/img42/2460/20100609171307.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img42.imageshack.us/img42/2460/20100609171307.png&lt;/a&gt;","torrent":{"xt":"urn:btih:ae61256f4fea834f0f5b1eb9e45bf4fde23dcf8e","amp;dn":"edge+of+darkness+por+memitoxxx+etorrents.org+%28+ingles%2Flatino%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae61256f4fea834f0f5b1eb9e45bf4fde23dcf8e","infoHashBuffer":{"type":"Buffer","data":[174,97,37,111,79,234,131,79,15,91,30,185,228,91,244,253,226,61,207,142]},"announce":[],"urlList":[]}}