{"title":"ACLU: At War With America","uid":5628469,"size":546937085,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:aebac9e4d8060ba805a494244ad4d9eb2d3c53dc&amp;dn=ACLU%3A+At+War+With+America&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Porkster","files":-1,"time":1276576265,"description":"The ACLU's stated mission is to defend the rights of all citizens as enshrined in the Bill of Rights of the United State Constitution. However, its radical agenda has been criticized from all sides of the political spectrum. Disguised as a defender of our freedoms, the ACLU has for decades been at war, both legally and intellectually, with the fundamental rights and values of our nation.\n\nOur documentary will shed further light on the dangers of the ACLU and will inform and educate the American people.\n\n\n\nThrough interviews and personal stories the documentary highlights some of the outrageous sides that the ACLU finds itself on in seemingly obvious battles. Take for example the ACLU defending NAMBLA members OVER defending Megan's law or fighting the Boy Scouts in their right to assemble on public property such as a state park or national forest.\n\nThe ACLU has even found itself fighting to keep pornography restrictions out of public libraries making it almost impossible for these institutions to regulate what kinds of materials are making their way into the hands of our youth.\n\nIt is time for America to step back and open their eyes to what is really going on at the ACLU; to finally see that this is an organization run-a-muck in desperate need of re-focusing and reorganization to get back in the fight for America, not against it.\n\nFeaturing Michael Boos, Mark Corallo, Former Congressman John Hostettler, Michael Medved, Former Attorney General Edwin Meese III, Deroy Murdock, US Congresswoman Marilyn Musgrave, Michael Reagan, Alan Sears, Mathew Staver and Victoria Toensing.\n &lt;a href=&quot;\nhttp://www.acluthemovie.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.acluthemovie.com/&lt;/a&gt;\n\n\n  ____                      _                      _   _       _\n / ___|___  _ __  ___ _ __ (_)_ __ __ _  ___ _   _| | | |_   _| |__\n| |   / _ \\| '_ \\/ __| '_ \\| | '__/ _` |/ __| | | | |_| | | | | '_ \\\n| |__| (_) | | | \\__ \\ |_) | | | | (_| | (__| |_| |  _  | |_| | |_) |\n \\____\\___/|_| |_|___/ .__/|_|_|  \\__,_|\\___|\\__, |_| |_|\\__,_|_.__/\n                     |_|                     |___/\n   ____\n  / ___|___  _ __ ___\n | |   / _ \\| '_ ` _ \\\n | |__| (_) | | | | | |\n(_)____\\___/|_| |_| |_|\n\n\nPLEASE KEEP SEEDED TO PASS ON THE MESSAGE.  PLEASE VISIT OUR SITE AND SHARE THE WORD!\n\n* Don't Be Fooled Any Longer on Darwinism, Evolution, Global Warming Lies, Internationalism, etc.\n* Get The Message Out, Openly!\n* Copy Our Torrents To All Open Trackers!!!\n","torrent":{"xt":"urn:btih:aebac9e4d8060ba805a494244ad4d9eb2d3c53dc","amp;dn":"ACLU%3A+At+War+With+America","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aebac9e4d8060ba805a494244ad4d9eb2d3c53dc","infoHashBuffer":{"type":"Buffer","data":[174,186,201,228,216,6,11,168,5,164,148,36,74,212,217,235,45,60,83,220]},"announce":[],"urlList":[]}}