{"title":"Whitney Duncan - Right Road Now  (2nafish)","uid":5606950,"size":147159044,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:af920cf25065f312be7216cff18ba72cd2881ba2&amp;dn=Whitney+Duncan+-+Right+Road+Now++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1275644485,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nWhitney Duncan (born August 3, 1984 in Scotts Hill, Tennessee) is an American country music artist, who was the fifth place finalist on the fifth season of Nashville Star. She has released one studio album and has charted on the U.S. country singles charts with &quot;When I Said I Would&quot; and &quot;Skinny Dippin',&quot; as well as a Christmas single and guest appearance on a Kenny Rogers single which was released before her Nashville Star appearance.\n\nIn 2007, Duncan participated on the USA network show Nashville Star and self-released her debut album. After coming in fifth place, she signed to Warner Bros. Records Nashville. Her first solo single, &quot;When I Said I Would&quot; was released from the label in August 2008, peaking at #48 on the U.S. country charts. The second single, The Bed You Made, followed in December 2008 and failed to chart. The third single, Skinny Dippin was released in July 2009, and debuted at #60 and reached #48 as well.\n\nA Christmas digital single, a cover version of the Mariah Carey hit &quot;All I Want for Christmas Is You&quot;, was issued in November 2008. A digital EP titled Selections From Right Road Now was released in December 2008.\n\nDuncan's debut album, Right Road Now, was originally slated for a May 2009 release, but was pushed back due to the lackluster success of the singles. The album was released digitally and through Amazon.com on compact disc on April 20, 2010.\n\nWhitney Duncan was born on August 3, 1984 in Scotts Hill, Tennessee, a town consisting of only 900 people. Her father is a state environmentalist and her mother is a schoolteacher. Her grandfather introduced her to music.  Duncan began singing at her church, later performing in local talent shows, fairs, and festivals. She would also travel to the neighboring states of Kentucky and Missouri  to perform at events. In her early teens, she began to travel to Nashville, Tennessee to perform at local clubs, including Tootsie's Lounge.\n\nIn her senior year of high school, Duncan signed a recording contract with a label, cutting a few sides she had written. One of these sides was &quot;My World Is Over&quot;, which became a duet with Kenny Rogers, and appeared on his 42 Ultimate Hits album in 2004. A single was made of their duet, and charted for one week on the Billboard Hot Country Songs chart in July 2004. Afterwards Duncan parted ways with the label. In 2006, she opened for the CMA Music festival, performing the National Anthem and singing the next day as well. \n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:af920cf25065f312be7216cff18ba72cd2881ba2","amp;dn":"Whitney+Duncan+-+Right+Road+Now++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af920cf25065f312be7216cff18ba72cd2881ba2","infoHashBuffer":{"type":"Buffer","data":[175,146,12,242,80,101,243,18,190,114,22,207,241,139,167,44,210,136,27,162]},"announce":[],"urlList":[]}}