{"title":"Medwyn Goodall collection","uid":5458840,"size":4526873592,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:af9c17cb638803383ae40c5f99c9f6842a519c50&amp;dn=Medwyn+Goodall+collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"Ooinn","files":-1,"time":1269415426,"description":"Medwyn is a legend in the world of music with over two million album sales to his credit. He has gained an international reputation for composing and recording quite stunning music. He is regarded as being amongst the finest multi-instrumentalist in the music industry. Amongst his credits are &quot;Earth Healer&quot; which was voted leading instrumental album of 1992 and the acclaimed &quot;Druid&quot; trilogy. His reputation was further recognised with three phenomenally successful music albums, &quot;Way of the Dolphin&quot; and &quot;Great Spirit&quot; for which he was awarded Gold Disc status with each album selling in excess of 100,000; and &quot;Medicine Woman&quot; which was awarded Gold, Platinum and a coveted 'Best Album Ever' award in 2002 for selling in excess of 300,000.\n\nInspired by nature, ancient mysteries and cultures, Medwyn develops his music from his Studio in rural Cornwall. He plays over a dozen instruments and has evolved unique styles of instrumental music, which are highly melodic, expressive and inspiring. His music magically blends many acoustic instruments as in &quot;The Scroll&quot; and &quot;Medicine Woman 2&quot; although Medwyn continues to enthral us as he breaks ever-new ground with such critically acclaimed contemporary albums as &quot;Millennium&quot; which won the album of the year in 1999 and &quot;Comet&quot;; which was nominated for various prestigous awards, Medwyn never ceases to share his journey with us from the gentle tones of &quot;Timeless&quot; to the mystical power of Rhythm of the Ancients, he is a master of his genre.","torrent":{"xt":"urn:btih:af9c17cb638803383ae40c5f99c9f6842a519c50","amp;dn":"Medwyn+Goodall+collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af9c17cb638803383ae40c5f99c9f6842a519c50","infoHashBuffer":{"type":"Buffer","data":[175,156,23,203,99,136,3,56,58,228,12,95,153,201,246,132,42,81,156,80]},"announce":[],"urlList":[]}}