{"title":"My Balls aka Oretama (Manga)","uid":5634497,"size":116965163,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:b094077a92d56e1184fdb622e7d549d5fd5864cd&amp;dn=My+Balls+aka+Oretama+%28Manga%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"garymce","files":-1,"time":1276824254,"description":"My Balls a.k.a. Oretama\nSeinen Manga\nGenre: Romantic comedy, fantasy, ridiculous sexy fun times\nAuthor: Shigemitsu Harada\nIllustrator: Takahiro Seguchi\n\nSummary: The fate of the world rests on one man's shoulders. Or, to put it more precisely, it rests in his balls.\n\nEmmaniel, the Queen of Terror, is a demon on her way to destroy the world. Then, in an accident involving an angel, a soul jar and a stream of urine, she is sealed away inside the right testicle of perennial loser (and virgin) Satou Kohta. The angel informs him that if she remains sealed for the entire month, the world will avoid destruction. The only way for Kohta to keep her sealed is to not ejaculate for one month, or she'll escape. Thus Kohta must resist temptation for a full month, lest the world be destroyed.\n\nAlthough this manga is not technically classified as hentai, it deliberately skirts as closely as possible while still being publishable in a mainstream magazine. Be prepared for some extremely raunchy, explicit and hilarious content if you read it.\n\nInfo: Contains chapters 1 to 22, I haven't been able to find translated versions of the rest of the chapters yet. Please note I did not scan/translate this manga, all the work was done by the Strays group (http://strays.vnmanga.com) who I have no affiliation with, thanks to them for their work!","torrent":{"xt":"urn:btih:b094077a92d56e1184fdb622e7d549d5fd5864cd","amp;dn":"My+Balls+aka+Oretama+%28Manga%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b094077a92d56e1184fdb622e7d549d5fd5864cd","infoHashBuffer":{"type":"Buffer","data":[176,148,7,122,146,213,110,17,132,253,182,34,231,213,73,213,253,88,100,205]},"announce":[],"urlList":[]}}