{"title":"Nosutoradamusu No Daiyogen - Original Uncut Japanese Version [Du","uid":8772685,"size":2177993888,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b0e1d4e7199318078db0605696d65ea68d5129ac&amp;dn=Nosutoradamusu+No+Daiyogen+-+Original+Uncut+Japanese+Version+%5BDu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"svenkvist","files":-1,"time":1375489928,"description":"Note that I am sharing this torrent - I did not encode or create the files within. All credit goes to the real encoders, as well as the creators and artists depicted in the movie.\n\n----\nTitle: Prophecies of Nostradamus: Catastrophe 1999\nAlso Known As: Nosutoradamusu no daiyogen, Prophecies of Nostradamus, The Last Days of Planet Earth\nYear: 1974\nGenre: disaster/sci-fi/action/drama\nRuntime: 114 min\nCountry: Japan\nLanguage: Japanese/English\nSubtitles: English (srt)\nIMDb: http://akas.imdb.com/title/tt0071923/\n\nDirected by: Toshio Masuda\nWritten by: Toshio Yasumi, Yoshimitsu Banno, Tsutomu Goto (based on the book Les Propheties by Michel de Nostredame)\nCinematography: Rokuro Nishigaki\nMusic: Isao Tomita\nCast: Tetsuro Tanba (Dr. Nishiyama), Toshio Kurosawa (Akira Nakagawa), Kaoru Yumi (Mariko Nishiyama), Yoko Tsukasa (Nobuo Nishiyama), Katsuhiko Sasaki (assistant to Nishiyama), Akihiko Hirata (scientist), Hiroshi Koizumi (scientist), Takashi Shimura (hospital director), Jun Hamamura (Kida), Mikizou Hirata (Nakagawa's father), So Yamamura (prime minister), Syoutarou Sera, Mizuho Suzuki, Taketoshi Naitou (cabinet members), Tony Cetera, Rolf Jeter, Franz Gruber, Riner Geshman, Ousmane Yusef (New Guinea search party members), George A. Grim, Willie Dorsey (UN representatives), Goro Naya (news anchor), Shinji Nakae (narrator), Kyoko Kishida (voice of the prophecy)\n\nSource: cinemageddon\nRipped by: Kevin Pyrtle/wtf-film.com\nType: movie\nFile Format: AVI\nCodec: H264\nResolution: 856x366\nAspect ratio: 2.35:1\nVideo Bitrate: 2147 Kbps\nAudio: mp3 2ch\nAudio Bitrate: 192 Kbps\n\nProphecies of Nostradamus: Catastrophe 1999 is an epic disaster film released by Toho in 1974 as a thematic sequel to the highly successful Submersion of Japan (1973). Loosely based on the writings of Renaissance prophecist Michel de Nostredame, the film centers around the exploits of pediatrician and scientist Dr. Nishiyama, his family and co-workers. Dr. Nishiyama has a tough time convincing people of an impending environmental catastrophy until weird phenomena such as giant slugs and children with super-human capabilities start cropping up. Also featured are man-eating fruit bats, hippie suicide groups on motorbikes and exploding traffic jams along with the obligatory earthquakes, tsunamis, volcanic eruptions and firings of nuclear missiles. The memorable soundtrack was composed by synth guru Isao Tomita.\n\nDespite being the highest grossing domestic release of 1974 in Japan, the original 114 minute cut was quickly pulled out of theaters after complaints from an atom bomb survivors group. Several shorter cuts exist, including a US tv version by the title of The Last Days of Planet Earth. The original cut has never been released officially on video or dvd. The copy presented here originates from a timecoded master tape for an intended (but never released) vhs release. Along with the original soundtrack, there's also a comment track by Ted Johnson from wtf-film.com.","torrent":{"xt":"urn:btih:b0e1d4e7199318078db0605696d65ea68d5129ac","amp;dn":"Nosutoradamusu+No+Daiyogen+-+Original+Uncut+Japanese+Version+%5BDu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0e1d4e7199318078db0605696d65ea68d5129ac","infoHashBuffer":{"type":"Buffer","data":[176,225,212,231,25,147,24,7,141,176,96,86,150,214,94,166,141,81,41,172]},"announce":[],"urlList":[]}}