{"title":"Ardentjohn - On The Wire (2010)(Indie Alternative Folk Rock)(MP3","uid":5597494,"size":90883345,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b177b9c8efa64ed2e4feff4ac1d24a6321133ef7&amp;dn=Ardentjohn+-+On+The+Wire+%282010%29%28Indie+Alternative+Folk+Rock%29%28MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SoundbaronPirateBay","files":13,"time":1275089027,"description":"Music : Indie : MP3/Over 256Kbps\n\n\n\nArdentjohn - On The Wire (2010)\n\n\nScotland's loch loving, alpine air appreciating one time Italian Club Bianconiglio residents, Ardentjohn, have eventually followed up 2007's EP 'When The Time Comes' with their new album 'On The Wire'. Emanating originally from the 'Jewel In The Clyde' that is the Isle Of Bute, and picking up members along the A85 at Crieff, as well as further afield in New York and Alberta, Ardentjohn are either a lover of the extremely soft launch, or like the slow burn, as opposed to the fireworks and fanfare approach.\n\nArdentjohn have been rather spectacularly, and somewhat flatteringly, compared in parts of the more sycophantic Scottish media to Snow Patrol and Coldplay with their 'epic' musical compositions. More recently the similarities have been made to last years favourite new band of many 'Mumford &amp; Sons'. Either way I think the comparisons a little far of the mark and wholly inaccurate. Ardentjohn share more in common with their Scottish counterparts and musical forebears, Travis, as well as a nod state side with whispers of 70's stadium fillers The Eagles. No bad pedigree, but more Steve Wright than Steve Lamacq.\n\n\n\n\nThe album 'On The Wire' is a blend of folk, rock and easy listening that flows along in a meander, taking you effortlessly, unassumingly and for the most part, uninterestingly................nowhere really. Having a band name that partially means 'very enthusiastic or passionate' is either tongue in cheek or unfortunate when throughout the album what appears to be lacking, in gratuitous amounts, is both crucial components. Even on the more sombre and melancholy tracks there is a lack of conviction and a holding back on going 'the whole hog'. If we are to engage in a spot of shoe gazing and self reflection, questioning our place in the world and the meaning of life, lets at least make it intense, make us care.\n\nWhere Ardentjohn show some teeth and shine is when their talk is of returning home (A recurrent theme on the album) and the reflection is on their beloved roots. (The Bute Tourist Board should definitely snap up a copy of 'On The Wire'!) Hardly surprising then that the new single, due for release on 15th February is Home/Where All Paths Lead! ('Home where our lovers wait, home where the fire is'). By far the best track on the album is 'Follow Me', a moody, tad maudlin, dramatic piece that builds marvellously throughout. What makes it all the more special is not only the laid back, soft velvety vocal, guitar work and string arrangement but the combination of each coupled with the sensitive production. Elsewhere, apart from the popier/pacier 'One Step Behind' and gentle beat of 'Where All Paths Lead', the tempo never really sets your heart racing or your toe tapping. From track #2, 'Open Road', to the closer, 'Morning Song', you can hear the influence of harmony and composition from Fran Healy &amp; Co. It's not a bad thing but lacks a certain individuality and creativity.\n\nThe album is a pleasant but slightly dull collection of songs easy on the ear but as easily forgettable. You can't help but think that it's a shame Ardentjohn were a tad too restrained and didn't let a little more self belief burn through. (The cover art, 'Fading Light, Loch Fyne', where the album was recorded, by Glasgow School Of Art contemporary artist John Kingsley is quite nice!). Don't be surprised to hear the Edinburgh based 6 piece in the background at a soirÃƒÂ©e near you soon.\n\n\n\n\nTrack listing:\n\n01. All that we need 3:01\n02. Open road 3:51\n03. Fleeting moments 3:19\n04. Colours of the day 4:37\n05. Follow me 3:54\n06. Where all paths lead 3:58\n07. Home 3:54\n08. One step behind 2:53\n09. Pride of place 4:36\n10. Believing man 3:05\n11. Morning song 4:40\n\n\n\n\nMore info:\n\n &lt;a href=&quot;\nhttp://www.ardentjohn.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.ardentjohn.com/&lt;/a&gt;\n\n\n\n\n\n\n\n\nENJOY &amp; REMEMBER TO KEEP SEEDING FOR OTHERS!!\nTHANKS!!","torrent":{"xt":"urn:btih:b177b9c8efa64ed2e4feff4ac1d24a6321133ef7","amp;dn":"Ardentjohn+-+On+The+Wire+%282010%29%28Indie+Alternative+Folk+Rock%29%28MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b177b9c8efa64ed2e4feff4ac1d24a6321133ef7","infoHashBuffer":{"type":"Buffer","data":[177,119,185,200,239,166,78,210,228,254,255,74,193,210,74,99,33,19,62,247]},"announce":[],"urlList":[]}}