{"title":"Die Ritterinnen (2002)","uid":5541167,"size":732188082,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b212ee919582478bc620f767b507f3a3c00acac1&amp;dn=Die+Ritterinnen+%282002%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"manesi","files":3,"time":1273191932,"description":"aus den amazon-rezensionen:\n\nDer Film erzÃƒÂ¤hlt die Geschichte einer linken, punkigen Frauen-WG im Berlin der spÃƒÂ¤teren achtziger Jahre. Das Leben besteht aus Demonstrationen, politischen Aktionen, philosophischen und feministischen Debatten sowie den leider nÃƒÂ¶tigen &quot;proletarischen Arbeiten&quot; zwecks Geldverdienens. \n\nEs beginnt damit, daÃƒÅ¸ die junge Punkerin Bonnie (wunderbar gespielt von Jana Straulino) aus der Provinz nach West-Berlin geht, um dort ein freies Leben zu fÃƒÂ¼hren. Sie findet Anschluss an eine WG von Gleichgesinnten, die sich relativ bald, im Zuge von Feminismusdebatten, in eine reine Frauen-WG wandelt. Es ist die Zeit der groÃƒÅ¸en Demonstrationen. Der IWF und die Weltbank planen eine gemeinsame Konferenz in Berlin, und dagegen steht die Linke auf und stellt eine massive Gegenkampagne auf die Beine. \nIm Anschluss daran gibt es verschiedene StrÃƒÂ¶mungen. So schlieÃƒÅ¸t sich die Titel&quot;heldin&quot; Bonnie bspw. kurzzeitig den &quot;RevolutionÃƒÂ¤ren Zellen&quot; (RZ) an. \nUnd schlieÃƒÅ¸lich, letztendlich, wird das gesamte Weltbild der linken Szene in Berlin durcheinandergewirbelt durch den Fall der Mauer. Die Frauen-WG des Film zerbricht letztendlich daran. \n\nErzÃƒÂ¤hlt wird das Ganze von jemandem, der damals dabei war: Die Regisseurin ist gleichzeitig das alter ego von Bonnie. Zwar wird am Anfang des Films betont, daÃƒÅ¸ der dieser keine abosolut korrekte historische Darstellung ist, doch im GroÃƒÅ¸en und Ganzen ist es damals wohl so abgelaufen. Untermauert wird dies im gesamten Film durch die Einbindung originaler Aufnahmen (von Demonstrationen, zum Beispiel) und von Interviews mit den handelnden Personen heute. \n\nFazit: Eine interessante, kurzweilige Darstellung der linken Szene in Berlin zur Handlungszeit, aber keineswegs ein trockenes Geschichtsbuch, sondern amÃƒÂ¼sant dargestellt.\n\n\nffmpeg -i:\nDuration: 01:34:12.64\nBitrate: 1035 kb/s\nVideo: mpeg4, yuv420p, 640x366 [PAR 1:1 DAR 320:183], 25 tbr, 25 tbn, 25 tbc\nAudio: ac3, 48000 Hz, stereo, s16, 192 kb/s","torrent":{"xt":"urn:btih:b212ee919582478bc620f767b507f3a3c00acac1","amp;dn":"Die+Ritterinnen+%282002%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b212ee919582478bc620f767b507f3a3c00acac1","infoHashBuffer":{"type":"Buffer","data":[178,18,238,145,149,130,71,139,198,32,247,103,181,7,243,163,192,10,202,193]},"announce":[],"urlList":[]}}