{"title":"Trevor's World Of Sport - S01 to 03 - Audio Comedy - MP3 - Sl","uid":5541361,"size":482610373,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b39a278621ab8dc6de51bcc991cf0094f8a0b773&amp;dn=Trevor%5C%27s+World+Of+Sport+-+S01+to+03+-+Audio+Comedy+-+MP3+-+Sl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"_Slimoo_","files":18,"time":1273242699,"description":"Trevor's World Of Sport - Series 01 to 03 - Audio Comedy - BBC7 via DVB-T\n18 x 30 Minute Episodes - 128Kbps - Mp3 - Slimoo \n\n\nTrevor's World of Sport was a 2003 BBC sitcom written and directed by Andy Hamilton and starring Neil Pearson as Trevor. Only one television series was made, and Hamilton felt mistreated by the BBC over the scheduling of the show. Hamilton went public with his displeasure over the show's scheduling and vowed never to work for BBC1 again. A radio version was first broadcast on BBC Radio 4 in 2004, with subsequent series in 2005 and 2007.\n\nThe series is set in the world of TS Sports, a sports public relations firm, run by Trevor Heslop and his partner Sammy Dobbs. Trevor is portrayed as being an essentially decent honest man in a corrupt money-obsessed industry of sporting celebrity, who is still deeply in love with his estranged wife Meryl. Andy Hamilton also appears in a minor role within the show, and several actors who have worked in his other comedy shows for television and radio appear. Neil Pearson was in Hamilton's Drop the Dead Donkey.\n\nThe other TS Sports office staff are the cool German receptionist Heidrun, whose lesbianism obsesses Sammy; the young black trainee Barry; and strongly Christian office manager Theresa.\n\n\nCast:\nNeil Pearson - Trevor Heslop \nPaul Reynolds - Sammy Dobbs \nRosalind Ayres - Theresa \nMichael Fenton Stevens - Ralph Renton \nMatthew Thomas - Toby \nAbdul Salis - Barry \nCosima Shaw - Heidrun \nJoe Absolom - Scott \n\n\nCrew \nAndy Hamilton - Writer \nAndy Hamilton - Director \n\n\nTrevor's World Of Sport - S01 - E01 - Jason \nTrevor's World Of Sport - S01 - E02 - Ethics \nTrevor's World Of Sport - S01 - E03 - Samantha \nTrevor's World Of Sport - S01 - E04 - Antonia \nTrevor's World Of Sport - S01 - E05 - Divorce \nTrevor's World Of Sport - S01 - E06 - Quiz\nTrevor's World Of Sport - S02 - E01 - Work Experience\n\nTrevor's World Of Sport - S02 - E02 - Dog \nTrevor's World Of Sport - S02 - E03 - Stalker \nTrevor's World Of Sport - S02 - E04 - Trust\nTrevor's World Of Sport - S02 - E05 - Marathon\nTrevor's World Of Sport - S02 - E06 - French\n\nTrevor's World Of Sport - S03 - E01 - Trial\nTrevor's World Of Sport - S03 - E02 - Beards\nTrevor's World Of Sport - S03 - E03 - Pre-nuptial\nTrevor's World Of Sport - S03 - E04 - Dead Cert\nTrevor's World Of Sport - S03 - E05 - Change\nTrevor's World Of Sport - S03 - E06 - Gap Year\n.\n\nAudio Format : MP3\nDuration : 28mn 1s\nBit rate mode : Constant\nBit rate : 128 Kbps\nChannel(s) : 2 channels\nSampling rate : 44.1 KHz\nResolution : 16 bits\n\n\n\n[b]\nA number of people are posting my torrents on other trackers.\nI have no problem with that - (Not much need as I already do this) - But a name check would be nice\nI was the one who spent weeks,months,years recording them.\n\nThere is little point in downloading a &quot;Torrent&quot; and then recreating a &quot;Torrent&quot; using the same files.\n\nThe fact there was a torrent for you to download is clear you don't need to use the files to make another exactly the same version,\n\nAll you will do is split seeders over 2 torrents with the &quot;same&quot; files and make both have less seeders.\n\n\n\n[/b]\n","torrent":{"xt":"urn:btih:b39a278621ab8dc6de51bcc991cf0094f8a0b773","amp;dn":"Trevor%5C%27s+World+Of+Sport+-+S01+to+03+-+Audio+Comedy+-+MP3+-+Sl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b39a278621ab8dc6de51bcc991cf0094f8a0b773","infoHashBuffer":{"type":"Buffer","data":[179,154,39,134,33,171,141,198,222,81,188,201,145,207,0,148,248,160,183,115]},"announce":[],"urlList":[]}}