{"title":"Alex Jones Show - 2013 Aug 16 FR [sebaygo1]","uid":8820579,"size":62800872,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:b3af64cc57269a884e47fa14c680f091f4b817b7&amp;dn=Alex+Jones+Show+-+2013+Aug+16+FR+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sebaygo1","files":11,"time":1376692159,"description":"\t\t\t\t\t\t\t\nThe Alex Jones Show\nFriday, 16 August 2013\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the Infowars web site :: On the Friday, August 16 edition of The Alex Jones Show, Alex breaks down the tumultuous state of affairs in Egypt, where the military has taken to slaughtering protesters wholesale as the country edges on the brink of civil war. \n\nAlex also explores the possibilities of Google's new patent for tracking eye movements, Wikileaks founder Julian Assange's praise of Matt Drudge and Ron and Rand Paul's brand of Libertarian republicanism, and the announcement of a yet another NSA data lab. \n\nOn today's show, Alex welcomes back the founders of overpasses.org James Neighbors and Dallas Thurman, who recently helped organize protests for impeaching Obama over highway overpasses. \n\nWe'll also talk to producer and film director Kevin Booth about his latest film American Drug War 2: Cannabis Destiny and the rise of the police state. Booth worked with the late comedian Bill Hicks to posthumously produce his albums Rant in E Minor and Arizona Bay.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n.\n","torrent":{"xt":"urn:btih:b3af64cc57269a884e47fa14c680f091f4b817b7","amp;dn":"Alex+Jones+Show+-+2013+Aug+16+FR+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3af64cc57269a884e47fa14c680f091f4b817b7","infoHashBuffer":{"type":"Buffer","data":[179,175,100,204,87,38,154,136,78,71,250,20,198,128,240,145,244,184,23,183]},"announce":[],"urlList":[]}}