{"title":"Lex.Poles.Little.Holes.XXX.1080p.MP4-QUAGMIRE","uid":8805026,"size":12595001896,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:b3d03e365783482e4aa432760161d44fe54b5f91&amp;dn=Lex.Poles.Little.Holes.XXX.1080p.MP4-QUAGMIRE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":-1,"time":1376308017,"description":"Lex Poles Little Holes [Split Scenes]\n\n Directed By: Lexington Steele\n\n Updated: 2013-08-09 | Views : 6528 | Length : 04:25:28\n\n Starring: Allie Haze, Cindy Starfall, Giselle Leon, Katie St. Ives, Lexington Steele, Prince Yahshua, Riley Reid\n\n Categories: Asian, Behind The Scene, Black, Blonde, Bonus Scene, Brunette, Bubble Butt, College, Cumshot, Cunilingus\n\n Description: In ï¿½ex Poles Little Holes,ï¿½famed director/stud Lexington Steele and his enormous black cock give five stunning, petite porn princesses the ultimate test, thoroughly ramming their tiny, pink orifices. The big, ebony legend delivers a massive meat injection to his gorgeous cast; fueled by relentless passion, he fills and expands their wee pussies with his huge, throbbing black dick. This type of forbidden sexual magnetism can make amazing things happen ... sometimes it even appears to overcome the laws of physics! Sweet Katie St. Ives eagerly rides her manï¿½ monster cock until Lexington decorates her pretty face with gooey sperm. Diminutive slut Riley Reid takes on Lex and another huge stud, Prince Yahshua, for a double serving of towering black dicks, each one as thick as her forearm! Riley receives two gooey, tasty cum facials. Exotic cutie Giselle Leon gets thoroughly stuffed with throbbing black penis. Adorable Allie Haze orally worships Lexï¿½ erection, gagging on the veiny shaft, and takes a passionate pussy pounding. Beautiful Asian spinner Cindy Starfall has a hidden agenda for her big, black sex therapist: She worships his huge tool and gets fucked silly until sheï¿½ covered in a mess of hot jism. The double-DVD includes a bonus masturbation scene starring Cindy and her favorite toy, plus 24 minutes of post-game, behind-the-scenes interviews with all of Lexï¿½ lovely little bitches. Thereï¿½ nothing more erotic than a small woman getting way more than she bargained for. ï¿½ex Poles Little Holesï¿½is a mind bending, hole-stretching, perhaps life-changing experience!\n\n\n &lt;a href=&quot;\nhttp://bayimg.com/aAoKKaAEe&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/aAoKKaAEe&lt;/a&gt;","torrent":{"xt":"urn:btih:b3d03e365783482e4aa432760161d44fe54b5f91","amp;dn":"Lex.Poles.Little.Holes.XXX.1080p.MP4-QUAGMIRE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3d03e365783482e4aa432760161d44fe54b5f91","infoHashBuffer":{"type":"Buffer","data":[179,208,62,54,87,131,72,46,74,164,50,118,1,97,212,79,229,75,95,145]},"announce":[],"urlList":[]}}