{"title":"Live On Broadway - Bubbe Meises -1994 - DVD5 NTSC","uid":5538422,"size":3613246381,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b521254bdb3bc2cdce323c7ae48efb43a39b3f52&amp;dn=Live+On+Broadway+-+Bubbe+Meises+-1994+-+DVD5+NTSC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rambam1776","files":-1,"time":1273104233,"description":"Live On Broadway - Bubbe Meises\n\nVideo\nID                               : 224 (0xE0)\nFormat                           : MPEG Video\nFormat version                   : Version 2\nBit rate mode                    : Variable\nWidth                            : 720 pixels\nHeight                           : 480 pixels\nDisplay aspect ratio             : 4:3\nFrame rate                       : 29.970 fps\nStandard                         : NTSC\n\nAudio\nID                               : 128 (0x80)\nFormat                           : AC-3\nFormat/Info                      : Audio Coding 3\nChannel(s)                       : 2 channels\nSampling rate                    : 48.0 KHz\nLanguage                         : English\n\nNo Subtitles, No Extras\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0860897/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0860897/&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Bubbe-Meises-Stories-VHS/dp/6303454038&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Bubbe-Meises-Stories-VHS/dp/6303454038&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://bayimg.com/HAMgeaAcA&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/HAMgeaAcA&lt;/a&gt;\n\n\n\nMusical. By Ellen Gould. Original Songs by Ellen Gould and Holly Gewandter. Winner of TWO Emmy Awards\n\nA joyous celebration of family, tradition and identity, Bubbe Meises, Bubbe Stories is the story of a granddaughter's passionate journey through time and memory to recall her grandmothers' anecdotes as a way to understand her own life. One grandmother, Bubbe Gittie, passes down her social consciousness to her granddaughter. The other grandmother, Annie is a free-spirited and passionate woman who urges her granddaughter to grab on to every morsel life has to offer. These Bubbe Meises - a noun of Yiddish derivation meaning old wives' tales, fantastical stories or superstitions - are filled with wisdom and just the right mix of humor and sentiment to create an emotional bridge linking her to her past. The granddaughter begins her journey enveloped in loneliness, but as she moves through her grandmothers' rich and poignant life experiences, she begins to understand that they comprise her own heritage. This connection with her roots gives her the strength to embrace the present. The show's 10 songs included the title song and others such as You're Dancing Inside Me; The Bridge Song (The Bubbe Rag); Chocolate Covered Cherries and Take More Out of Life. Universally appealing, this musical combines the emotional resonance, entertaining storytelling and age-old cross-cultural wisdom that will enrich and delight a wide audience.\n\n\nEllen Gould has appeared on and off-Broadway?from Lincoln Center (Macbeth) to Second Avenue (The Golden Land). In 1992, her one-woman show, Bubbe Meises, Bubbe Stories, opened to critical acclaim at the Cherry Lane Theater. In December 1994, a made-for-television version aired on National Public Television and received two Emmys (writer and performer). Other television credits include PBS-TV The Mogul and the Singer and the HBO special Subway Stories. Since Bubbe Meises, Gould has written and performed three original musicals?two with Holly Gewandter: 1993?The Miracle of the Five Hannahs (commissioned by the 92nd Street Y with orchestrations by Dick Hyman); 1995?Seeing Stars, a musical about visual impairment (The Lighthouse Inc.); and 1997?The Glass House (Northlight Theatre, Chicago). A native of Worcester, Mass., Gould is a graduate of Brandeis University, has an M.F.A. in acting from Tisch School of the Arts and was the recipient of a Fulbright-Hays fellowship in ethnomusicology (Eastern Europe). She is married to Daniel Ray.\n\n","torrent":{"xt":"urn:btih:b521254bdb3bc2cdce323c7ae48efb43a39b3f52","amp;dn":"Live+On+Broadway+-+Bubbe+Meises+-1994+-+DVD5+NTSC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b521254bdb3bc2cdce323c7ae48efb43a39b3f52","infoHashBuffer":{"type":"Buffer","data":[181,33,37,75,219,59,194,205,206,50,60,122,228,142,251,67,163,155,63,82]},"announce":[],"urlList":[]}}