{"title":"K-Lite Codec Pack 5.9.4","uid":5551980,"size":5861168,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b54d71389bb18cf475a3fd078b24b94bb8a4961c&amp;dn=K-Lite+Codec+Pack+5.9.4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xBlean","files":-1,"time":1273575378,"description":"The K-Lite Codec Pack has a couple of major advantages compared to other codec packs:\n\n-It is updated frequently. So it is always up-to-date with the newest and/or best components.\n\n-All components have been carefully selected for specific purposes. It is not just a random bunch of stuff thrown together.\n\n-It is very user-friendly and easy to use.\n\n-Works great with Windows Media Player and Windows Media Center. But also with all other DirectShow players, such as Media Player Classic, BS.Player, ZoomPlayer, and others.\n\n-The installation is fully customizable, meaning that you are able to install just those components that you really want.\n\n-The pack has many options, which allows you to tweak it to your own specific needs and preferences.\n\n-Uninstallation removes everything that was installed by the pack. Including all registry keys. All changes are properly undone.\n\n-It is extremely easy to make a fully customized unattended installation with the integrated wizard.\n\n-It does not contain any codecs or filters that are known to be bad, buggy or unstable. In fact, the installer is able to detect and disable several known troublemakers.\n\n-It tries to avoid potential conflicts with other codecs installed on your computer. The installer is able to detect and remove over 100 different codec and filter packs.\n\n-The installer is able to detect broken codecs and filters on your system, and helps you to remove them.\n\n-It is a very complete package, containing everything you need to play your movies.\n\n-The pack has options to activate thumbnail generation in Windows Explorer for several popular video file formats, which are by default not thumbnailed in Explorer.\n\n-The pack automatically configures Media Center to recognize all common audio and video file formats, so that such files show up in your media library.\n\n-This pack has a huge user base. This means that problems are found and resolved quickly.\n\n-There are different variants of the pack. From very small to large.\n\n-The pack is suitable for both novice and expert users.","torrent":{"xt":"urn:btih:b54d71389bb18cf475a3fd078b24b94bb8a4961c","amp;dn":"K-Lite+Codec+Pack+5.9.4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b54d71389bb18cf475a3fd078b24b94bb8a4961c","infoHashBuffer":{"type":"Buffer","data":[181,77,113,56,155,177,140,244,117,163,253,7,139,36,185,75,184,164,150,28]},"announce":[],"urlList":[]}}