{"title":"The Essex Green - Cannibal Sea [2006][EAC,log,cue. FLAC]","uid":8741001,"size":304654222,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b57a44be1f8127761f3ca2f9beba0e0039a786bd&amp;dn=The+Essex+Green+-+Cannibal+Sea+%5B2006%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dickspic","files":21,"time":1374787866,"description":"Artist: The Essex Green\nRelease: Cannibal Sea\nReleased: 2006\nLabel: Merge\nCatalog#: 278\nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: USA\nStyle: psychedelic pop, soft rock, folk, \n\n1 This Isn't Farmlife 4:06 \n2 Don't Know Why (You Stay) 3:26 \n3 Penny &amp; Jack 2:53 \n4 Snakes in the Grass 3:32 \n5 Rue de Lis 3:15 \n6 Cardinal Points 4:26 \n7 Rabbit 2:24 \n8 Uniform 3:22 \n9 The Pride 3:13 \n10 Sin City 2:32 \n11 Elsinore 3:24 \n12 Slope Song 3:33\n\nThe Essex Green's previous album was a marvelous fusion of their psychedelic pop, soft rock, folk, and indie pop influences, much like a fusion of the Ladybug Transistor and the Sixth Great Lake (not surprising since the three principals in the band also play in those two groups). Released in 2006, Cannibal Sea is a continuation of that sound with the added ingredient of better songs, higher production values, and Final Four-worthy performances. Not that they have been weak in those departments in the past, but now they seem to have hit upon a seam of pure gold. From the opening one-two-three punch of the rollicking and lush &quot;This Isn't Farmlife,&quot; the power pop rocker &quot;Don't Know Why (You Stay),&quot; and the melancholy heartbreak-in-the-city ballad &quot;Penny &amp; Jack,&quot; which features the two voices of the Green, the lovely Sasha Bell and the just as lovely Christopher Ziter, trading verses and harmonizing like seraphim on the choruses, there isn't a weak song to be found. And they sound magnificent, too, as the bandmembers seemingly brought all their musical and arrangement skills and ideas to the sessions and they, along with producer Britt Myers, know exactly what each song needs. Some, like &quot;Snakes in the Grass&quot; and the shimmering ballad &quot;Sin City,&quot; are bolstered with enough percussion, background vocals, vintage keys, horns, strings, and reverb to make Phil Spector raise his guns in tribute; some, like &quot;Rue de Lis&quot; and &quot;Rabbit,&quot; are stripped down and brilliantly arranged. From beginning to end, it feels like there is just an added amount of conviction and excitement from the group on Cannibal Sea -- more soul and more dedication. In particular, Bell has stepped up her game; her vocals are perfect throughout and the chorus on &quot;Snakes in the Grass&quot; is guaranteed to cause four out of every five indie kids who hear it to fall instantly in love. Both she, Ziter and third member of the trio Jeff Baron have become first-class songwriters and The Essex Green definitely sound like a real band now and not a side project. In fact, Cannibal Sea is the equal of anything the Ladybug Transistor have released (which is saying a whole lot), and is better than just about any indie pop or rock circa 2006.","torrent":{"xt":"urn:btih:b57a44be1f8127761f3ca2f9beba0e0039a786bd","amp;dn":"The+Essex+Green+-+Cannibal+Sea+%5B2006%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b57a44be1f8127761f3ca2f9beba0e0039a786bd","infoHashBuffer":{"type":"Buffer","data":[181,122,68,190,31,129,39,118,31,60,162,249,190,186,14,0,57,167,134,189]},"announce":[],"urlList":[]}}