{"title":"Hogtied--HT-33123 Adriana Chechik WMV","uid":8862557,"size":689607978,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:b6fad231b5adee2c32d4690d63c613a520faf9df&amp;dn=Hogtied--HT-33123+Adriana+Chechik+WMV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1377813424,"description":"\nFresh Young Pretty Girl Destroyed by Bondage and Orgasms\n\nAug 29, 2013 - Performers: Adriana Chechik \n \n\nWMV only. MP4 + Pics later.\n\n\nGorgeous, young and willing are the three best adjectives for this little piece of fresh meat, Adriana Chechik. Her pretty face is striking - thick brunette hair frames a round, olive toned face and penetrating, deep blue eyes with a gaze that falls right about at my crotch. She is hungry, horny and eager. I smile. \n\nI tie her elbows tight behind her back, then wrap the rough rope around her pretty, slutty thighs and push her to the floor. I shove her face down, ass up, and rip at those silky little panties. The air hits her skin and I can smell her moist cunt. I hold out the rubber cock and tell her to get it. So amusing to watch her struggle against the rope to get that fat cock in her horny little pussy. If she is a good girl, she cums. If not, well, there is always scene two. \n\nThe gag cuts hard into her face, stuffing her hot fucking mouth with a lewd red rubber ball. I add rope after rope, jacking her thighs apart and jamming the vibe tight against her swollen, deprived clit. She is drooling all over herself, making a fucking mess, squirming, moaning and I could just swear I heard a whimper in there. I laugh and take the other leg away, leaving her spinning in the air with a throbbing, horny pussy all to herself. Poor thing. \n\nLet's get a closer look at this cunt. I jack her legs over her head and spread that twat like cheap frosting. The clit vibe gets her so close, but she just can't seem to get over the edge completely. I watch her struggle with her orgasms for a while, alternating between the clit vibe and slapping the fuck out of her naughty pussy. She is so scared of the pain that she practically pees herself in anticipation of the strikes. When I finally get her off, she squirts so much come all over me and my crew that we have to shower off afterwards. Good job tramp - you are now a HogTied rope slut.\n\nScreens  &lt;a href=&quot;\nhttp://www.hogtied.com/site/shoot.jsp?shootId=33123&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hogtied.com/site/shoot.jsp?shootId=33123&lt;/a&gt;\n\n11 000 uploads and counting, 12k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n\n","torrent":{"xt":"urn:btih:b6fad231b5adee2c32d4690d63c613a520faf9df","amp;dn":"Hogtied--HT-33123+Adriana+Chechik+WMV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6fad231b5adee2c32d4690d63c613a520faf9df","infoHashBuffer":{"type":"Buffer","data":[182,250,210,49,181,173,238,44,50,212,105,13,99,198,19,165,32,250,249,223]},"announce":[],"urlList":[]}}