{"title":"War Inc. m4v H.264 Iphone,ipod,ipad,nero,itunes,wmp BDRIP","uid":5601911,"size":394924003,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:b72b2572408079d8e03f0b56f84da368c012a5a9&amp;dn=War+Inc.+m4v+H.264+Iphone%2Cipod%2Cipad%2Cnero%2Citunes%2Cwmp+BDRIP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"konejo7","files":-1,"time":1275360996,"description":"M4V for Ipad, Iphone &amp; Ipod\n\nMore ipod iphone itunes nero... media files in  &lt;a href=&quot;\nhttp://thepiratebay.se/user/konejo7/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/konejo7/&lt;/a&gt;\n\n\n\nOriginal format\nSource: Blu ray\nResolution: 480.320\nAudio: Downmix stereo 48.000khz M4A\n\n\n\nBesides Apple iTunes and Apple QuickTime Player, M4V files can also be opened and played with the version of Windows Media Player included with Windows 7, Media Player Classic, RealNetworks RealPlayer, and VideoLAN VLC media player. The format, with DRM removed, can also be played in the webOS  Video Player for use on the Palm Pre  and Palm Pixi smartphones BS player, nero show time etc.\n\nThe movie opens with Brand Hauser (John Cusack) in Iqualiuit, Northern Canada. He enters a bar where some German gentlemen are chatting. He asks for a shot glass, fills it with hot sauce, and throws it back in one gulp. His synapses start firing as he pulls out a gun and shoots each of the Germans. He takes a photo of one of the gentlemen, sends it off, and disposes of the cell phone.\n\nCut to a jet aircraft. Hauser is the only person on board, but he is regularly chatting with the GuideStar voice. Though it is helping with navigation, it also is providing psychiatric advice.\n\nOn the flight, he chats with the former Vice President (Dan Ackroyd). The VP is sitting on the toilet throughout the video call. Hauser is instructed to fly to Turaqistan, where the VP's company, Tamerlane, is engaged in the first war to be entirely outsourced. His mission is to assasinate the Oil Minister, Omar Sherif (Lyubomir Neikov). He is to be hit because he is insisting that Turaqistan build a cross country pipeline on their own, shunning a bid from Tamerlane. For cover, he is to act as the Chair of a Tamerlane Trade Mission, which is holding a trade fair within the Green Zone (the Emerald City) of the Turaqustan capital. A highlight of the fair will be the marriage of pop star Yonica Babyyeah (Hilary Duff) to the son of the Emerit.\n\nHauser arrives, and meets his contact, Marsha Dillon (Joan Cusack).\n\nTanks with sponsor decals, city is a mess, lots of bombs &amp; explosions in various marketplaces.\n\nPlease help fill this in! Various shots of hot sauce, flashbacks to a row with his CIA boss.","torrent":{"xt":"urn:btih:b72b2572408079d8e03f0b56f84da368c012a5a9","amp;dn":"War+Inc.+m4v+H.264+Iphone%2Cipod%2Cipad%2Cnero%2Citunes%2Cwmp+BDRIP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b72b2572408079d8e03f0b56f84da368c012a5a9","infoHashBuffer":{"type":"Buffer","data":[183,43,37,114,64,128,121,216,224,63,11,86,248,77,163,104,192,18,165,169]},"announce":[],"urlList":[]}}