{"title":"Dreamland - 06-12-10 - The Sun, Earthquakes And The Soul","uid":5629635,"size":21745831,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:b7c9c92d4ef3ecb4ea2855f89243f1fce8639188&amp;dn=Dreamland+-+06-12-10+-+The+Sun%2C+Earthquakes+And+The+Soul&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lyrian","files":2,"time":1276620742,"description":" Saturday June 12th, 2010\n\nThe Sun, Earthquakes and the Soul\n\nFirst, Linda Moulton Howe reports on the collapse of the RAF Bentwaters coverup, with 2 fantastic interviews. Then, David Sereda is not only a scientist but also a meditator, and he has been watching the sun both from a scientific and a spiritual viewpoint for many years. He has made some eye-opening discoveries about how the sun and the earth interact, and what, exactly, happens on the sun prior to major earthquakes.\n\nThe sun has a profound effect on the earth that goes far beyond heat and light. Its relationship to our geology and our weather is powerful and little understood, and David has made some groundbreaking discoveries about this. Listen as he describes exactly what was happening on the sun just prior to a number of powerful earthquakes, tsunamis and hurricanes.\n\nAnd what about the huge sinkholes in Guatemala, China and other places in the world? What are they? How do they relate to what is happening on the sun, and where does the human mind fit in?\n\nAnd what, exactly does 2012 mean? David explains how earth is now rising above the galactic plane, and entering an area where there is far less cosmic dust and the radiation reaching the sun and the earth from the galactic center is increasing fast.\n\nIncredibly, David's description of what happens corresponds with the ideas behind Whitley Strieber's upcoming novel the Omega Point, to be released on June 22.\n\nAnd do not miss his deeply moving description of the vision of Christ he had many years ago, which is one of the most powerful such visions ever described, because it happened to a scientist who understood the way the vision was actually generated in his brain, and therefore why it was a truly transcendent experience.\n\nThis interview is Dreamland at its most exciting and original. You just will not find explosive new ideas like these explored anywhere else! ","torrent":{"xt":"urn:btih:b7c9c92d4ef3ecb4ea2855f89243f1fce8639188","amp;dn":"Dreamland+-+06-12-10+-+The+Sun%2C+Earthquakes+And+The+Soul","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7c9c92d4ef3ecb4ea2855f89243f1fce8639188","infoHashBuffer":{"type":"Buffer","data":[183,201,201,45,78,243,236,180,234,40,85,248,146,67,241,252,232,99,145,136]},"announce":[],"urlList":[]}}