{"title":"Vince Neil - Tattoos &amp; Tequila  (2nafish)","uid":5607400,"size":140058628,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b7e27344f47fe9c0f3d57a19c1e25e497b3d8815&amp;dn=Vince+Neil+-+Tattoos+%26+Tequila++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1275612394,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nVincent Neil Wharton (born February 8, 1961) is an American  vocalist  and musician, best known for being the lead singer of heavy metal band MÃƒÂ¶tley CrÃƒÂ¼e.\n\nNeil was born in Hollywood, California to Odie and Shirley Wharton. During the 1960s, his family moved around Southern California from Inglewood to Watts, before finally settling in Glendora attending Sunflower Intermediate School and later Royal Oak High School. Neil eventually got in trouble at school for fighting and drug use, and was subsequently expelled. As well as having an interest in music while a teenager, Neil was also interested in surfing, basketball, baseball, football, and wrestling.\n\nNeil was discovered while performing with his band, Rock Candy in 1980, and joined MÃƒÂ¶tley CrÃƒÂ¼e in 1981. Neil had been friends with Tommy Lee in high school (at one point, Neil lived in Lee's van, then Lee's parents invited him in, and Neil slept beside Lee's bed). MÃƒÂ¶tley CrÃƒÂ¼e was looking for a lead vocalist at the time and were impressed by Neil, after hearing him through Lee. MÃƒÂ¶tley CrÃƒÂ¼e released its first album, Too Fast for Love the same year. In 1983, MÃƒÂ¶tley CrÃƒÂ¼e released Shout at the Devil, a blockbuster success that has established the band as a big act at the time in rock and roll.\n\nIn 1985, Neil regrouped with MÃƒÂ¶tley CrÃƒÂ¼e to record Theatre of Pain. The band subsequently recorded the hugely successful Girls, Girls, Girls (1987). The band then released their highest-selling album, Dr. Feelgood, in 1989 after going through drug rehabilitation. The band's stint in rehab was due to bassist Nikki Sixx's overdose on heroin in December 1987. Sixx was revived by two adrenaline shots to the heart, which inspired the hit song &quot;Kickstart My Heart,&quot; but the band's management nevertheless cancelled an upcoming European tour and insisted that all members of the group go to drug rehabilitation with the admonition: &quot;If you guys go to Europe, at least one of you will be coming back in a bodybag.&quot;\n\nIn February 1992, MÃƒÂ¶tley CrÃƒÂ¼e parted ways with Vince Neil, both sides issuing statements. MÃƒÂ¶tley CrÃƒÂ¼e claimed that Neil was more interested in car racing and partying than the band's new music, and claims that Neil quit the band on his own accord. Neil claims that he was fired from the band, because he didn't approve of the bands new musical direction.\n\nNeil had taken up indie racing a few years prior, often turning up at celebrity races. Neil enjoyed the sport so much, that he eventually formed Vince Neil Racing. Neil was racing in the Indy Lights open wheel developmental series at the time. Neil retired from racing in 1992 after crashing his car during a race in Long Beach after the third lap.\n\nIn 1992 he released his first solo offering, the single &quot;You're Invited (But Your Friend Can't Come)&quot; was featured on the Encino Man soundtrack. Neil quickly made a video for the song which featured a cameo by Pauly Shore. The video does not feature guitarist Steve Stevens as Stevens was hired after the song and video had been released. Stevens re-recorded the song for Neil's first solo album.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:b7e27344f47fe9c0f3d57a19c1e25e497b3d8815","amp;dn":"Vince+Neil+-+Tattoos+%26+Tequila++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7e27344f47fe9c0f3d57a19c1e25e497b3d8815","infoHashBuffer":{"type":"Buffer","data":[183,226,115,68,244,127,233,192,243,213,122,25,193,226,94,73,123,61,136,21]},"announce":[],"urlList":[]}}