{"title":"Zenon 1, 2 &amp; 3","uid":8815335,"size":2201763158,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b7e64999daa07c54dea3e5e8de7f9459592f2b82&amp;dn=Zenon+1%2C+2+%26amp%3B+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"cj48089","files":-1,"time":1376567620,"description":"pretty sure these are TV rips but still pretty good copies!! ^_^\n-------------------------------------------------------------------------------------\n\nZenon: Girl of the 21st Century (1999)\n\nZenon Car is a trouble-prone 13-year-old girl who, in the year 2049 AD, lives on a space station with the rest of her family. When she runs afoul of Parker Windom, the owner of the station, Zenon is determined to be &quot;incorrigible&quot;, and as punishment is exiled to the worst place imaginable: The planet earth. After several painful weeks of adjustment to her new surroundings, Zenon enlists the aid of her earthbound pals to return to her &quot;real&quot; home with evidence that the &quot;respectable&quot; Mr. Windom is up to no good.\n-------------------------------------------------------------------------------------\n\nZenon: The Zequel (2001)\n\n15-year-old Zenon Kar's space station home is getting torn apart by the U.S. military. She's on duty in A.P. when she comes in contact with Aliens. She must convince everyone that they need to fly out and help the aliens.\n-------------------------------------------------------------------------------------\n\nZenon: Z3 (2004)\n\nIn the third installment of the hit Zenon Disney Channel Original Movie trilogy, Zenon Kar (Kirsten Storms) is a space-aged teenager in the year 2054. Having always been successful at everything she does, she jumps at a chance to compete in the first Galactic Teen Supreme contest. The only thing standing in her way is the lack of a hot-pod license needed for the first stage of the contest - a pod race from the earth to the Moonstock Festival on the moon. After a few near-misses during her driving test, her pod is taken over by some mysterious force that allows her to land safely on earth and get her license.\n\nMeanwhile Dasha (Alyson Morgan), Commander Plank (Stuart Pankin) and Aunt Judy's (Holly Fulger) new foster daughter, can't believe she's had the good fortune to be placed in a home with Zenon, her idol. She quickly sets out on a path to become Zenon's &quot;Mini-Me&quot; and stows away in Zenon's hot pod before the race.\n\nOnce she gets to the moon and qualifies for the second heat of the Galactic Teen Supreme contest, Zenon gets a chance to get a little closer to Bronley Hale (Glenn McMillan), her handsome competitor. However, Zenon's attention is soon on Sage Borealis, a lone environmentalist intent on stopping the Moonstock Festival and the subsequent colonization of the moon. He seeks Zenon's help, but she's confused about what she can do, and reluctant to quit the Galactic Teen Supreme competition.\n\nZenon's also puzzled by the strange dreams she and her friends Cassiopeia (Phumi Mthembu) and Margie (Lauren Maltby) have been having about Zenon and Moon Goddess Selena on the surface of the moon. She feels Selena is trying to tell her something important, but can't decipher the meaning. While Zenon struggles to figure out what's going on around her, things take a turn for the worse on earth. Inexplicable heavy rain and snowstorms threaten to destroy everything, and Zenon can't get in touch with her aunt and uncle to let them know Dasha is with her.\n\nWith everything on earth going haywire, Bronley Hale threatening to take the Galactic Teen Supreme Title, Selena beckoning to Zenon in her dreams and Dasha constantly underfoot, Zenon must decide how to make things right again.\n","torrent":{"xt":"urn:btih:b7e64999daa07c54dea3e5e8de7f9459592f2b82","amp;dn":"Zenon+1%2C+2+%26amp%3B+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7e64999daa07c54dea3e5e8de7f9459592f2b82","infoHashBuffer":{"type":"Buffer","data":[183,230,73,153,218,160,124,84,222,163,229,232,222,127,148,89,89,47,43,130]},"announce":[],"urlList":[]}}