{"title":"Easy Rider 1969 Full Untouched RIP Dennis Hopper","uid":5603103,"size":6853882294,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b8bb3b0b8790312ca0e7c41e6bb11df6a5c66430&amp;dn=Easy+Rider+1969+Full+Untouched+RIP+Dennis+Hopper&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"shango","files":22,"time":1275420914,"description":"I shared this because this is a great movie and I love the hippie generation. I am very saddened to see Dennis Hopper die and I intend to share a few more of his greater/rarer movies.\n\nThis is a full untouched dvd ripped using anydvd. Please do your part and stop sharing 700mb and dvds ripped to fit on dvd5! This is 2010. People can learn how to shrink their own damn dvds and if you are still on dialup stop being a cheap fucker and get a job! If you dont own a dvd burner thats ridiculous.\n\n\nTwo young &quot;hippie&quot; bikers, Wyatt and Billy sell some dope in Southern California, stash their money away in their gas-tank and set off for a trip across America, on their own personal odyssey looking for a way to lead their lives. On the journey they encounter bigotry and hatred from small-town communities who despise and fear their non-conformism. However Wyatt and Billy also discover people attempting 'alternative lifestyles' who are resisting this narrow-mindedness, there is always a question mark over the future survival of these drop-out groups. The gentle hippie community who thank God for 'a place to stand' are living their own unreal dream. The rancher they encounter and his Mexican wife are hard-pushed to make ends meet. Even LSD turns sour when the trip is a bad one. Death comes to seem the only freedom. When they arrive at a diner in a small town, they are insulted by the local rednecks as weirdo degenerates. They are arrested on some minor pretext by the local sheriff and thrown in jail where they meet George Hanson, a liberal alcoholic lawyer. He gets them out and decides to join them on their trip to New Orleans in time for Mardi Gras. \n\n#  Actors: Peter Fonda, Dennis Hopper, Jack Nicholson, Tita Colorado, Warren Finnerty\n# Format: AC-3, Anamorphic, Closed-captioned, Color, Dolby, DVD, Special Edition, Widescreen, NTSC\n# Language: English (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1)\n# Subtitles: English, Spanish, Portuguese, Georgian, Chinese, Thai\n# Region: Region 1 encoding (US and Canada only)\nPLEASE NOTE: Some Region 1 DVDs may contain Regional Coding Enhancement (RCE). Some, but not all, of our international customers have had problems playing these enhanced discs on what are called &quot;region-free&quot; DVD players. For more information on RCE, click here.\n# Aspect Ratio: 1.85:1\n# Number of discs: 1\n# Rating: R (Restricted)\n# Studio: Sony Pictures\n# DVD Release Date: June 4, 2002\n# Run Time: 95 minutes\n\nMore Dennis Hopper movies:\n\nComing soon: &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0105226/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0105226/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0116828/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0116828/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:b8bb3b0b8790312ca0e7c41e6bb11df6a5c66430","amp;dn":"Easy+Rider+1969+Full+Untouched+RIP+Dennis+Hopper","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8bb3b0b8790312ca0e7c41e6bb11df6a5c66430","infoHashBuffer":{"type":"Buffer","data":[184,187,59,11,135,144,49,44,160,231,196,30,107,177,29,246,165,198,100,48]},"announce":[],"urlList":[]}}