{"title":"Librivox M4B - Great Shadow by Arthur Conan Doyle","uid":5521323,"size":111989024,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b961973787fad857d801724fb39e11301c367686&amp;dn=Librivox+M4B+-+Great+Shadow+by+Arthur+Conan+Doyle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"VoxRatio","files":-1,"time":1272628579,"description":"Set in an English-Scottish border village during the waning days of the Napoleonic era, this adventure story introduces us to Jock Calder, whose quiet way of life is shattered when a mysterious stranger steps ashore near his home. The stranger changes forever the lives of Jock, his cousin Edie, and his best friend Jim, sending the young men into the jaws of the final battle to defeat The Great Shadow that threatens to devour the whole of Europe. Don't look for Sherlock Holmes in this well-written tale, but do expect a wonderful glimpse of life at the end of the Napoleonic era, including an exciting rendition of The Battle of Waterloo. (Introduction by Christine Dufour)\n\n\n\nAn M4B file is an audio file which can be bookmarked. This is the audio-book file type. These files can have chapter markers which can be skipped through as you would skip through files on a play list. They can have built in cover art and chapter images. They will remember where you left off each time you stop the file and come back to it . And variable speed settings on Ipods and a growing number of other mp3 players can be utilized by this file type. The ability to bookmark allows for as little as one large file instead of many small ones without the burden of fast forwarding to find your spot every time you resume listening or the fear of otherwise losing your place. The reduced number of files also makes browsing through your files to find your book and your place in it much less effort.\n","torrent":{"xt":"urn:btih:b961973787fad857d801724fb39e11301c367686","amp;dn":"Librivox+M4B+-+Great+Shadow+by+Arthur+Conan+Doyle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b961973787fad857d801724fb39e11301c367686","infoHashBuffer":{"type":"Buffer","data":[185,97,151,55,135,250,216,87,216,1,114,79,179,158,17,48,28,54,118,134]},"announce":[],"urlList":[]}}