{"title":"XSOFTWARE VIDEO VAULT  LATEST2005.rar","uid":5609513,"size":17699404,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:bc8c1dc63b0429501551b5f9ab5ed0c8c2486b1e&amp;dn=XSOFTWARE+VIDEO+VAULT++LATEST2005.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"BLACKTROY","files":1,"time":1275783574,"description":"\n\nTHIS IS 321 STUDIO BEST SOFTAWRE.VERY RARE TO GET ON THE NET\n\n\n\nVideo Vault is a &quot;Rosetta Stone&quot; for the digital video age, enabling you to convert DVDs, VCDs, Tapes and Downloaded videos to virtually any device including any blank DVD disc, Mobile Phones, PDAs, Wireless Media Servers, and even the latest technology - Personal Video Players. \n\nThe great part is you don't need to know anything about codecs, formats, bit rates, frame rates, or any other technical information, simply select your device from a list and Video Vault does the rest! In one simple interface you can move your videos off a myriad of consumer electronic devices, store them to view on your computer, organize them, categorize them, then with one-click, transfer them to almost any device with a viewscreen! \n\nHighlights: \n- Import your video from DVDs, VCDs, Tapes, Camcorders, and even Downloaded files \n- Organize your videos - including custom and preset thumbnails, genres and categories \n- Export your videos to DVDs, PDAs, Phones, Wireless Media Servers, and Personal Video Players \n- Store your videos on an external harddrive and take them all with you \n- Transfer dozens of your supercompressed videos to a laptop and watch them in the airport or hotel \n- Create custom DVds for your In-Car DVD player with no annoying coming attractions or Menus - and store multiple DVD movies on one DVD disc! \n\nSupported Devices: \nPersonal Video Players (PVP): Apex, Archos, Creative, Epson, iRiver, Mobinote, MpAvio, RCA, Samsung, Zvue and many more! \nMedia Servers: D-Link, Hauppage, Microsoft Media Center Edition \nPDA''s: Pocket PC &amp; Palm Phones: Microsoft SmartPhone and Palm (Treo) \nDVD''s: All Single and Dual Layer DVD''s supported \n\nSupported Video and Audio Formats: \nDIVX, WMV, ASF, MPEG1, MPEG2, MPEG4, DVD, SVCD, VCD, VOB, AVI, MS-DVR, WMA, MP3, MPEG1 Layer II, WAV, PCM, LPCM, AC3 \n","torrent":{"xt":"urn:btih:bc8c1dc63b0429501551b5f9ab5ed0c8c2486b1e","amp;dn":"XSOFTWARE+VIDEO+VAULT++LATEST2005.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc8c1dc63b0429501551b5f9ab5ed0c8c2486b1e","infoHashBuffer":{"type":"Buffer","data":[188,140,29,198,59,4,41,80,21,81,181,249,171,94,208,200,194,72,107,30]},"announce":[],"urlList":[]}}