{"title":"The.Vampire.Diaries.S01.E14.SWESUB.HDTV.XviD-TexasChainsawMassac","uid":5524621,"size":365961216,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:bdd705e69552e982b9c335819bd55a1fbdc3c2b3&amp;dn=The.Vampire.Diaries.S01.E14.SWESUB.HDTV.XviD-TexasChainsawMassac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"TexasChainsawMassacre","files":1,"time":1272734688,"description":"Detta ÃƒÂ¤r det fjortonde avsnittet av The Vampire Diaries med svensk text! \n\nInformationstext om fjortonde avsnittet: \n\nElena wakes to find that she and Bonnie have been kidnapped by Anna and Ben. Stefan has been trying to find her and asks Damon for help, but he refuses. With help from Grams, Stefan eventually saves Elena and Bonnie. Stefan later ends up killing Ben for not obeying his order to leave town. Jeremy asks Anna to a party in the woods, unaware that she has her own reasons for wanting to meet him there. With the help of Bonnie and Grams, the tomb is opened and Damon realizes that Katherine is not inside. Anna enters the tomb to find her mother Pearl and helps her escape by having her feed on Elena's blood. Stefan warns Damon that the seal of the tomb has only been temporarily broken, and Elena helps them both escape in order to not be sealed in forever. Out of the tomb, Elena sees how upset Damon is and comforts him. Damon afterward confronts Anna and Pearl, and learns that a smitten church guard had let Katherine go, and she was never inside the tomb. Anna admits to having seen Katherine in Chicago in 1983, but she was indifferent regarding Damon. At home, Bonnie checks on Grams, but finds that she has died from the strain back at the tomb. The episode ends with one of the vampires escaping from the tomb. \n\nSeeda efter er!","torrent":{"xt":"urn:btih:bdd705e69552e982b9c335819bd55a1fbdc3c2b3","amp;dn":"The.Vampire.Diaries.S01.E14.SWESUB.HDTV.XviD-TexasChainsawMassac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bdd705e69552e982b9c335819bd55a1fbdc3c2b3","infoHashBuffer":{"type":"Buffer","data":[189,215,5,230,149,82,233,130,185,195,53,129,155,213,90,31,189,195,194,179]},"announce":[],"urlList":[]}}