{"title":"RegDoctor v2.22 Portable","uid":5626947,"size":9194624,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:bfee986bfb35bf3f356f8f475bda86b484660b46&amp;dn=RegDoctor+v2.22+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"NoExcuses","files":4,"time":1276473947,"description":"RegDoctor v2.22 made Portable.\n\nNo need to install it!\nOr, if you want to, Setup and some already generated licenses are included...\n\n\nIs your computer running slow? Are you experiencing computer crashes or windows error messages? Do you want to improve your system performance and stability? If you are answering yes, then you very likely need to clean up your Windows registry.\n\nRegistry problems are the common cause of Windows crashes, error messages, and degraded performance! RegDoctor can safely and quickly clean and repair Windows registry problems with a few simple mouse clicks! RegDoctor uses an intelligent, high-performance detection engine to accurately identify missing and invalid references in your Windows registry. Identified registry problems are listed and rated by risk level using an easy to understand color-coded system for your information. You can choose to have RegDoctor automatically repair all identified problems, or more selectively choose which problems to repair immediately. RegDoctor also offers a Restore feature to create registry backup files, giving you the capability to safely undo any registry changes.\n\nThe auto-start feature of RegDoctor helps to support its regular use. By using RegDoctor regularly to clean and repair your registry, your system should not only be more stable but it will also help Windows and your software run faster. Click here for more information on why you need software for cleaning your Windows registry.\n\nWorks with Windows 7. Also, works with Windows 95/98/ME/2000/XP/Vista. \n\n\nMore infos at\n  &lt;a href=&quot;\nhttp://www.itcompany.com/regdoctor.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.itcompany.com/regdoctor.htm&lt;/a&gt;\n\n\n\nThe Portable SFX EXE file is built up using WinRAR. You can use it to extract the files and check them one by one if you want to be sure of what is running on your machine.\n\n\nThis also has been built up on an XP x86 machine, I don't know if this program can run on a x64 or Vista/W7 machine. It's up to you to check it if you are using them.\n\n\n\nSUGGESTIONS ON USING P2P DOWNLOADS\n==================================\n\n1) It's always better to run all downloaded programs using Sandboxie or a similar virtual machine until you are sure they are clean.\n\n\n2) When in doubt, scan them with an Internet Scan service as the ones provided by Jotti and VirusTotal\n  &lt;a href=&quot;\nhttp://virusscan.jotti.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://virusscan.jotti.org/&lt;/a&gt;\n  &lt;a href=&quot;\nhttp://www.virustotal.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.virustotal.com/&lt;/a&gt;\n\nThis will ***NOT*** give you any warranty that a file passing their analysis is clean, nor that if they see them as a troian it's so or not just another false positive, but helps you to decide and at least ask for help or infos.\n\n\n3) Remember, trust nobody, and when in doubt, go to point 1) \n\n\n4) If you find any upload containing trojans or whatsoever malicious or unclean, instead of start cursing in the comments of the upload, take the time to go to the Suprbay Forum at:\n  &lt;a href=&quot;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&lt;/a&gt;\n\nand report links and comments there, and someone will take care of all the nasties.\n\n\nThat's the only way to keep TPB and its uploads fresh and clean.\n\n\nThat's for what is regarding security. If after testing it you see that you like it and it's useful for you, show your support by buying it!\n\n\n\nEnjoy and remember to seed... :o)","torrent":{"xt":"urn:btih:bfee986bfb35bf3f356f8f475bda86b484660b46","amp;dn":"RegDoctor+v2.22+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfee986bfb35bf3f356f8f475bda86b484660b46","infoHashBuffer":{"type":"Buffer","data":[191,238,152,107,251,53,191,63,53,111,143,71,91,218,134,180,132,102,11,70]},"announce":[],"urlList":[]}}