{"title":"Glam Metal Detectives","uid":5478198,"size":2784426150,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c1d61e0b0561f47761ca2892718c9af51c54ffee&amp;dn=Glam+Metal+Detectives&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jebus197","files":9,"time":1270257479,"description":"The Glam Metal Detectives was a comedy show combining both sketch and sitcom elements, produced by the BBC in 1995. It was screened on BBC2 in the Thursday 9pm slot, a place long renowned as a breeding ground for new and more experimental comedy. As with other shows launched in this timeslot, The Glam Metal Detectives attempted to innovate and combine genres, resulting in an off-the-wall mix of the sublime and the surreal which broke new ground with its 'multimedia' approach. The show lasted one series of seven episodes.\n\nThe scripts were written by the cast, and director Peter Richardson, and the series starred Gary Beadle, Phil Cornwell, Doon Mackichan (playing most of the female roles), Sara Stockbridge, George Yiasoumi, and Mark Caven.\n\nThe show was designed to appear as if the viewer was channel surfing through a multi-channel wasteland, happening upon spoof adverts, short sketches, and recurring show elements. Like other BBC content of the mid-1990s (most notably KYTV), it often lampooned the harsh and low-quality satellite television available in the UK at the time.\n\nwww. com/ results?search_query=glam+metal+detectives&amp;aq=1 (Remove gaps.)\n\nIt was the single most awesome comedy ever produced by the BBC. Burn to DVD if you want and have a glam metal night in!\n\n\nPlease share for posterity.","torrent":{"xt":"urn:btih:c1d61e0b0561f47761ca2892718c9af51c54ffee","amp;dn":"Glam+Metal+Detectives","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1d61e0b0561f47761ca2892718c9af51c54ffee","infoHashBuffer":{"type":"Buffer","data":[193,214,30,11,5,97,244,119,97,202,40,146,113,140,154,245,28,84,255,238]},"announce":[],"urlList":[]}}