{"title":"VSO ConvertXtoDVD 5.0.0.73 Beta by Cerberus - DM999","uid":8772414,"size":32473563,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c4322c63c51119899aaca3ef17f957790826800a&amp;dn=VSO+ConvertXtoDVD+5.0.0.73+Beta+by+Cerberus+-+DM999&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"AN0NYMOUS142857","files":1,"time":1375482169,"description":"Version 5 vs V4: why get the new version ?\n\nYou may be wondering what is this new V5 offering?\nWhat new features have been added, is it really worth upgrading from Version 4?\nWhat has taken so long to develop?\n\nWell here is a quick list of the new features we've developped for V5 and why you won't look back!\nNB: We have not removed any options from ConvertX 4, but we have added new possibilities. Anything you were familiar with V4 is still there, it might be displayed differently though. More guides on how to use V5 to come!\n\n1. New Interface\nNew display for clearer view and new live preview: no more converting files you're not totally happy with, no more wondering how the menu, the file, the subs, etc will come out.\nAny editing is shown live on the preview.\nNow you can customize your menus like an artist!\nNew feature: Edit menu duration!\n\n2. New edition options\nSubtitles, with new advanced features, like embedding subs directly into the video\nNEW: add brightness and contrast for a better image, flip the video\nVideo format: select the right format according to your TV screen, apply your own values for ultimate editing\nNEW: Remove unwanted parts of your video: say goodbye to ads, or anything you want to cut out, anywhere in the video, with exact selection (frame by frame) for professional result.\n\n3. Encoding Features\nA new conversion engine has been developped especially for this V5.\nNow you can have faster conversions with the simultaneous conversion feature (if you add more than one video) and hardware decoding (if available on your PC)\n- better audio quality due to rewritten engine\n- audio/video desynchronisation problems should be nearly non-existant - one of the main reasons for rewritten engine\n- add chapters support (original chapters supported and/or import chapters from list)\n- Version 5 has a new text renderer, meaning we are using a different engine than what was used in version 4 for text in menus and subtitles. We are now using Free type text renderer which provides visually nicer results.\n\n\nConvertXtoDVD changes history\nConvertXtoDVD - 5.0.0.73 Beta\n===========================================\n- 0006892: [Bug] No video with PhotoStory1.wmv or PhotoStory2.wmv (felicia) - resolved.\n- 0006890: [Bug] Issue with ALAC and APE audio codecs (wesson) - resolved.\n- 0006887: [Bug] overlapping in chapter tab (felicia) - resolved.\n- 0006886: [Bug] No sound in menus (wesson) - resolved.\n- 0006885: [Bug] Selecting Automatic for TV format during installation progress does not have any effects (felicia) - resolved.\n- 0006879: [Bug] Program version not always showing on form caption (felicia) - resolved.\n- 0006157: [Bug] cant minimize app during conversion (felicia) - resolved.\n- 0006184: [Bug] Out Of System Resources message when removing several input files... (felicia) - resolved.\n- 0006258: [Bug] .32 scroll bars on fresh install (felicia) - resolved.\n- 0006063: [Feature Request] Could we see nice arrows for the streams in the Hint Bubble and in the ASCII Log file... (cedric) - resolved.\n- 0006268: [Bug] wrong language identifier displayed (cedric) - resolved.\n- 0006347: [Bug] unable to set starting time of video background in title menu with Black mirrors template (felicia) - resolved.\n\n\nCerberus Patch Install Instructions:\nStep 1. Install.\nStep 2. Disable Auto Updates in the Settings ... General Menu and CLOSE the program.\nStep 3. Copy Patch to ConvertXtoDVD Installation Folder.\nStep 4. Run Patch As Administrator and Click on Patch Button.\nEnjoy !\nDO NOT UPDATE THIS PROGRAM","torrent":{"xt":"urn:btih:c4322c63c51119899aaca3ef17f957790826800a","amp;dn":"VSO+ConvertXtoDVD+5.0.0.73+Beta+by+Cerberus+-+DM999","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4322c63c51119899aaca3ef17f957790826800a","infoHashBuffer":{"type":"Buffer","data":[196,50,44,99,197,17,25,137,154,172,163,239,23,249,87,121,8,38,128,10]},"announce":[],"urlList":[]}}