{"title":"Wicked Passions 2012 Wicked Pictures","uid":8865477,"size":6910948868,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:c46e5d16a0045d625a3cd7b2aa4d0543045cbd68&amp;dn=Wicked+Passions+2012+Wicked+Pictures&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"grighta","files":16,"time":1377897140,"description":"Wicked Pictures scooped a bunch of nominations for XBIZ 2012 Couples-Themed Release of the Year (see) - A Love Story, Blow and Next Friday Night in the running. Only A Love Story is from their &quot;Wicked Passions&quot; series, which was also up for XBIZ 2012 Couples-Themed Line of the Year.  Another of the films from this series, Immortal Love, was a nominee for the 30th AVN awards Best Romance Release (a new category; the full list of nominees is at https://en.wikipedia.org/w/index.php?title=30th_AVN_Awards&amp;oldid=567432871 )\n\n\nShe's The One - https://thepiratebay.se/torrent/7153790\nFor the last several months, Ryan (Xander Corvus) has been coming into the diner where Rachel (Lexi Belle) works. Is it the food, or does he want something that's not on the menu? Their attraction is obvious to everyone. When Ryan finally steps up to ask Rachel out, he finds her in the arms of another man (Kris Slater) and backs off. Looks can be deceiving however, and the other man is actually Rachel's visiting brother who eventually teams up with Rachel's best friend (Brooklyn Lee) to help track Ryan down and make sure the pair have another chance at love.\n\nA Love Story - http://www.adultfilmdatabase.com/video.cfm?videoid=96830\nNew romance novelist Michael (Xander Corvus) is experiencing writers block after the love of his life walks out on him. With his publishers' deadline fast approaching, his agent brings in Danielle (Jessica Drake). She's tasked with getting him back on track to finish his latest masterpiece. \nThe two couldn't be more different, but they soon realize that opposites attract. The underlying sexual tension between them breathes new life into the hot, steamy characters in the book. \nWhen Danielle walks in on her boyfriend doing a little romancing of his own, she ends up back at Michael's. Before the night is over the new lovers show that their passion isn't confined to the pages of his novel. \nBut with the final chapter is in sight, will &quot;The End&quot; mean the end of their budding romance?\n\nLove Blossoms - https://thepiratebay.se/torrent/7399671\nJane seems to have the perfect life. Her career is on the fast track and her model boyfriend Remy is attentive and loving. Appearances can be deceiving; as a tragic car accident leaves her with no memory and has her questioning everything. Enter Brian, a sweet horticulturalist and neighbor. They've always been good friends, but is there more there? Is it possible that love can blossom through tragedy?\n\nBFF's - https://thepiratebay.se/torrent/7491035\nShoulda, coulda, woulda? Yeah, that's what John's thinking when he meats Julia. She's perfect! Just one thing... he's been playing the &quot;gay&quot; card to meet chicks! Forced to come clean, John tells her the truth, and even though she's crazy about him, can she trust him? Will Cupid miss the mark and end this budding romance or will they find a friend, a lover... or maybe both?\n\nImmortal Love - https://thepiratebay.se/torrent/7682576\nHeartbroken and alone, Madelyn finds comfort in her music. When she begins to feel like she's being watched, her tears become all too real. After a shadowy figure saves her from some would-be attackers, Madelyn's suspicions are confirmed!\nWhen she confronts the mystery man their undeniable passion causes two very different worlds to collide. Madelyn soon learns that it is not just her heart that is in danger, but her very soul. Can their immortal love overcome the odds or will it destroy them all?\n\nSummer Lovin' - https://thepiratebay.se/torrent/7832217\nYoung, beautiful Keiko grows restless in her small town existence, as she dreams of what's beyond the town limits. Only when a summer breeze blows into town - and with it, a chance encounter - does her dream appear to be a possibility. When drifter Jake arrives in town, he and Keiko lock eyes, the attraction is undeniable. Will Keiko risk everything to take a chance on love with a stranger or will she do what her family expects and stay the course. Find out if this summer romance can withstand the heat.\n\n\nFeminist Porn Reviews' Wicked Passions reviewsays:\n\nWicked Passions is the female-friendly imprint of Wicked Pictures, which is one of the top mainstream porn studios. Wicked's main offerings tend to be pretty inoffensive, as mainstream porn goes, and they were the first major studio to mandate the use of condoms in all their movies.\n\nAfter the first four films [crossing 2011 and 2012], the series undergoes a bit of a transformation, as the films become (with one exception) story-oriented, as several of Wicked's usual directors start to participate. Stormy Daniels, Brad Armstrong, Barrett Blade, and Francois Clousot have all directed films in the series. Some of these have been more successful than others, but The Fate of Love (2011), directed by Daniels, and Love Blossoms (2012), directed by Blade, are both well worth watching. That said, the series overall has not been terribly successful, and the releases have been quite slow of late, with just two in the first six months of 2013.","torrent":{"xt":"urn:btih:c46e5d16a0045d625a3cd7b2aa4d0543045cbd68","amp;dn":"Wicked+Passions+2012+Wicked+Pictures","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c46e5d16a0045d625a3cd7b2aa4d0543045cbd68","infoHashBuffer":{"type":"Buffer","data":[196,110,93,22,160,4,93,98,90,60,215,178,170,77,5,67,4,92,189,104]},"announce":[],"urlList":[]}}