{"title":"Create multiple partitions(Linux,windows)","uid":5481600,"size":3703,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c5a36c0bff6faab891797b4547940c306a95b029&amp;dn=Create+multiple+partitions%28Linux%2Cwindows%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ibstars","files":1,"time":1270425720,"description":"How to create a partition on top of the partition, without damaging you OS.\n\n\nPlease read carefully and proceed with caution and please understand we are not responsible fot your actions taken from the following steps.\nThis has been tested and it should work fine.\n\n\nLet's sys you want to install another operating system without formating your hard without any change to your system done, or you want just \nanother partition fo future use, whether you want it as linux file-system or as windows file-system , Or USB or any other device.\n\nFo this tutorial we gonna use  Puppy linux 4.2.1 version.\n\nRequirements\n\nA cd with puppy linux installed on it.\nA windows OS or Linux OS on your pc installed.\n\n--For windows--\n\nPuupy homepage.\n &lt;a href=&quot;\nhttp://puppylinux.org/main/index.php?file=How%20to%20download%20Puppy.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://puppylinux.org/main/index.php?file=How%20to%20download%20Puppy.htm&lt;/a&gt;\n\nIf you'v already downloaded puppy linux and burned it on CD, then use the following procedures.\n\n1. Reboot your system and log to Bios settings menu.\n2. Select for Boot priority , CD to be the first to boot, save seetings insert Puppy cd on your drive and restart.\n2. Once you restart you should be able to boot from cd to Puppy linux.\n3. If are at the Puppy screen, chose menu -&gt; system and select Gparted.\n4. On the gparted window you will see your Hard drive, if mounted right click to   unmount it, right click again to resize the hd to your appropriate needed size and click apply then restart back to windows.\n\n5.Once logged in windows right click my computer and click manage-&gt;disk mamagment and you should see the unallocated drive you just created in \npuppy. Right click that one and select new partition, click next, select as primary click next, assign a drive letter, click next, and for \n\nformat chose ntfs, for label(eg linux or Mnew drive) and perform quick format, click next, and click finish.\nThe drive should be formated and ready to use.\n\nAll done\n\n\nTry this.............\n\nAdvanced please only\nNewbies with caution???\n\nNow for fun let's restart, boot back to Puppy and try this\nGo to gparted and format the partition we created to ext3 and right click for flag chose boot , unflag the windows one.\nOpen the puppy cd and copy the files initrd.gz vmlinuz and puppy421.sfs file to you new partition we formated to ext3\n\nGo to create  boot-loader from system menu and create the boot-loader for that drive(partition)(mine is /dev/sda2)\nis the one with ext3 fs, so you can't go wrong here\nRemove the cd and restart and you should be able to directly boot to puupy without the cd (well what we'v done here we just installed puppy \n\nwithout any installation or any CD.\n\nIf you got an error at the boot screen, Type this on the screen\n\nkernel /vmlinuz\ninitrd /initrd.gz\nboot\n\nWhy we got that error because you have to modify the menu.lst with those lines above on puppy boot folder.\n\nThere is more in this tutorial than you can imagine, say u can't boot from usb or your pc wont boot from usb. you can use the same procedures \nto brute force boot USB installation  hehe.... \n\nEnjoy and if you get into trouble plese leave a comment???\n\nBrought to you by Dummy-Team.\n\nMy spieling is awfuller\n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:c5a36c0bff6faab891797b4547940c306a95b029","amp;dn":"Create+multiple+partitions%28Linux%2Cwindows%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5a36c0bff6faab891797b4547940c306a95b029","infoHashBuffer":{"type":"Buffer","data":[197,163,108,11,255,111,170,184,145,121,123,69,71,148,12,48,106,149,176,41]},"announce":[],"urlList":[]}}