{"title":"touch tone terrorists - customer service disasters","uid":5525435,"size":54737179,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:c94d65b962d56391b4066b8f9b4a5e42cf50b098&amp;dn=touch+tone+terrorists+-+customer+service+disasters&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Surf-It-Up","files":17,"time":1272756136,"description":"Alright everyone, this is my next TTT torrent. This is the real deal so please seed away as I cannot leave my computer on all day especially in the summer! No album art, just the calls. Go look on Amazon or someplace if you want to look at album art. Me? I just care about the calls. \n\n1. Damage Claim \t\n2. Jive Ass Hussy \t\n3. Rude Reps in Cubicles \t\n4. Look on Your Damn Calander \t\n5. Should Have Sent it Sooner \t\n6. Junkyard Romance \t\n7. Pay Yo Damn Bill \t\n8. Excuse Me! \t\n9. Human Resources \t\n10. Customer Service Wackos \t\n11. Rude Bird Brain \t\n12. Fools in the Mailroom \t\n13. Gimme Yer Tracking Number \t\n14. Corrupt Admissions Director \t\n15. Hip-No-Alergic \t\n16. Drunk Phone Company Rep \t\n17. Pee in Yo Gas Tank \t\n\nAbout the Artist\nThe Touch-Tone Terrorist has appeared live in person on the Howard Stern Show while 5 cuts off the 2nd CD (A Permanent Lapse of Reason) have been aired on Howard Stern. Other noteworthy airplay includes: KQRC (Kansas City), Steve &amp; D.C. (St. Louis), WEGR (Memphis), WNCD (Youngstown, OH), KYLD (San Francisco), Jonathan Brandmeier (Chicago, L.A.), WLIR, WMZK, KLAQ, WRHT, WSFO, WKLH, Man-Queer (Chicago), etc.\nProduct Description\nThese are the now infamous hi-jacked customer service calls! As heard on Howard Stern (6 calls) and Crank Yankers (2 calls). Plus (as reported in the LA Weekly, September 2002) UPS has tried to stop Infestation Records from selling this CD and the Permanent Lapse of Reason CD! These are actual calls of people calling IN to resolve various customer service issues. The only problem is that the phone numbers they are calling have been hijacked by RUDE customer care misfits like Junkyard Willie, Jim Bob the Inbred Hillbilly and Blade the Drunken Rocker. Their motto is simple: The Customer is always WRONG. Unsuspecting callers get fed up, then scream, yell and raise hell! It's been said You can't find good help these days ...but it was never THIS bad! Treat customers like this at your work and you'll be out of a job! Running time: 1 hour and 13 minutes (includes 1 stand up comedy track). This CD contains 18 mostly angry calls (17 of which are INBOUND customer service calls). This is the third CD released by Touch-Tone Terrorists. \nThe last call is not a call but some stupid fake stand up comedy bit so i didn't bother leaving that in the torrent. enjoy\n","torrent":{"xt":"urn:btih:c94d65b962d56391b4066b8f9b4a5e42cf50b098","amp;dn":"touch+tone+terrorists+-+customer+service+disasters","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c94d65b962d56391b4066b8f9b4a5e42cf50b098","infoHashBuffer":{"type":"Buffer","data":[201,77,101,185,98,213,99,145,180,6,107,143,155,74,94,66,207,80,176,152]},"announce":[],"urlList":[]}}