{"title":"Extreme.Weight.Loss.S03E06.Mehrbod.HDTV.x264.NY2.mp4","uid":8744119,"size":519771890,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ca6c7efe903890b9ac708a62e863972388532931&amp;dn=Extreme.Weight.Loss.S03E06.Mehrbod.HDTV.x264.NY2.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TroyHorse","files":-1,"time":1374874088,"description":"Originally Titled &quot;Extreme Makeover: Weight Loss Edition&quot;\n\nExtreme Weight Loss\nSeason 3 , Episode 6 - &quot;Mehrbod&quot;\n\nMehrbod, a 32-year-old music producer and DJ now living in Los Angeles, CA, is a child of the Iran/Iraq war who fled to America with his family when he was very young. Mehrbod was taught at an early age that food was scarce and one should eat whenever food is available; he currently weighs 434 pounds. Except for the weight and a food addiction preventing him from fully enjoying his life, Mehrbod has it all - a devoted girlfriend, a supportive family and a career full of potential. When trainer Chris Powell learns that Mehrbod has a history of losing and regaining weight, he vows to help Mehrbod safely get to his weight goal in one year. If he reaches his first weight loss milestone, Chris will help him purchase an engagement ring to give to his girlfriend. Another successful weight loss milestone could give Mehrbod the opportunity to ski with Chris in Whistler, British Columbia alongside World Cup alpine ski racer and Olympic gold medalist Picabo Street. But after his triumphant record breaking weigh-ins, a personal setback causes Mehrbod to fall back into his food addiction, jeopardizing his chances of reaching once attainable goals.","torrent":{"xt":"urn:btih:ca6c7efe903890b9ac708a62e863972388532931","amp;dn":"Extreme.Weight.Loss.S03E06.Mehrbod.HDTV.x264.NY2.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca6c7efe903890b9ac708a62e863972388532931","infoHashBuffer":{"type":"Buffer","data":[202,108,126,254,144,56,144,185,172,112,138,98,232,99,151,35,136,83,41,49]},"announce":[],"urlList":[]}}