{"title":"Bruce Springsteen - 57 Channels (And Nothin' On)(2nafish)","uid":5641460,"size":90099716,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ca9106d8925056c01656906548b2104b04898788&amp;dn=Bruce+Springsteen+-+57+Channels+%28And+Nothin%5C%27+On%29%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1277126100,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;57 Channels (And Nothin' On)&quot; is a song written and performed by Bruce Springsteen, appearing on his album Human Touch, released in 1992. The song was released as a single, charting in the Top 100 in various countries. A video for the song was also released.\n\nHuman Touch is the ninth studio album by Bruce Springsteen, released in 1992. It was one of many of Springsteen's #1 albums in the UK. This album was co-released on the same day as Lucky Town. It was the more popular of the two, peaking at #2 on the Billboard 200 and single release &quot;Human Touch&quot; (paired with Lucky Town's &quot;Better Days&quot;) peaked at #1 on the Album Rock Tracks  chart and #16 on the Billboard Hot 100 chart.\n\nBruce Frederick Joseph Springsteen (born September 23, 1949), nicknamed &quot;The Boss&quot;, is an American singer-songwriter. He records and tours with the E Street Band. Springsteen is widely known for his brand of heartland rock infused with pop hooks, poetic lyrics, and Americana sentiments centered on his native New Jersey.\n\nSpringsteen's recordings have tended to alternate between commercially accessible rock albums and somber folk-oriented works. Much of his status stems from the concerts and marathon shows in which he and the E Street Band perform intense ballads, rousing anthems, and party rock and roll songs, amongst which he intersperses whimsical or deeply emotional stories. He is known for bringing on electrifying live performances that last over 3 hours, and sometimes in the early days over 4 or 5 hours. In gross earnings, Springsteen has made about $1.6 billion, making him the 3rd highest earning musical act in the world, only behind U2 and The Rolling Stones. He's still one of the best selling musicians in the world, among 80's stars. His most successful studio albums, Born to Run and Born in the U.S.A., epitomize his penchant for finding grandeur in the struggles of daily life in America, and the latter album made him one of the most recognized artists of the 1980s within the United States. A Democrat, his support for the presidential campaigns of Senator John Kerry and President Barack Obama have caused Springsteen and his music to become identified with modern American liberalism. He is also noted for his support of various relief and rebuilding efforts in New Jersey and elsewhere, and for his response to the September 11 attacks in 2001, on which his album The Rising reflects.\n\nHe has earned numerous awards for his work, including twenty Grammy Awards, two Golden Globes and an Academy Award, and continues to have a strong global fan base. He has sold more than 65 million albums in the United States and 120 million worldwide. He was a 2009 recipient of the Kennedy Center Honors and in the same year Forbes ranked him 6th in The Celebrity 100.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:ca9106d8925056c01656906548b2104b04898788","amp;dn":"Bruce+Springsteen+-+57+Channels+%28And+Nothin%5C%27+On%29%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca9106d8925056c01656906548b2104b04898788","infoHashBuffer":{"type":"Buffer","data":[202,145,6,216,146,80,86,192,22,86,144,101,72,178,16,75,4,137,135,136]},"announce":[],"urlList":[]}}