{"title":"Sherryl Woods - After Tex - Audio Book","uid":5632296,"size":87059828,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:cbc681de7fbaa7c7240938a1e3c879131d3ed8dd&amp;dn=Sherryl+Woods+-+After+Tex+-+Audio+Book&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":null,"files":2,"time":1276731872,"description":"ALIVE, TEX O'ROURKE WAS A SNEAKY OLD COOT. NOW THAT HE'S DEAD, HE'S EVEN WORSE.\n\nMegan O'Rourke's beloved grandfather had always been determined to lure her out of New York and back to the ranch in Whispering Wind, Wyoming, where he had raised her. And when Megan returns for Tex's funeral, she realizes his will is going to make it impossible for her to refuse. Her &quot;inheritance&quot; is Tex's daughter, Tess, an eight-year-old bundle of trouble Megan had never even known existed.\n\nJake Landers has also come home to Whispering Wind. After leaving town years before under a cloud of suspicion, he's returned to put down roots. And when he comes face-to-face with the woman who shared his troubled past, he hardly recognizes Megan. She's become a driven, stressed-out powerhouse who runs a successful entertainment empire, but who's forgotten what's really important.\n\nHe knows Megan is going to have to make some big decisions--about life and love, about where home really is. And he's only too happy to help. Because he's letting go of old grudges and beginning to recall some old dreams.\n\nAnd the best one begins with Megan.\n","torrent":{"xt":"urn:btih:cbc681de7fbaa7c7240938a1e3c879131d3ed8dd","amp;dn":"Sherryl+Woods+-+After+Tex+-+Audio+Book","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbc681de7fbaa7c7240938a1e3c879131d3ed8dd","infoHashBuffer":{"type":"Buffer","data":[203,198,129,222,127,186,167,199,36,9,56,161,227,200,121,19,29,62,216,221]},"announce":[],"urlList":[]}}