{"title":"Hunt for the Skinwalker: Science Confronts the Unexplained at a","uid":8806818,"size":937285,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cbd22f0830a81eaafeb4dba93e62d7dc9b76e65e&amp;dn=Hunt+for+the+Skinwalker%3A+Science+Confronts+the+Unexplained+at+a+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"flexy321","files":5,"time":1376354422,"description":"Hunt for the Skinwalker: Science Confronts the Unexplained at a Remote Ranch in Utah\n\nPh.D. Colm A. Kelleher &amp; George Knapp\n\nTags: Skinwalker Ranch, Paranormal, UFOs, UTAH, Skinwalker\n\nDESC:\n\nThe author of the controversial bestseller Brain Trust brings his scientific expertise to the chilling true story of unexplained phenomena on Utah's Skinwalker Ranch -- and challenges us with a new vision of reality.\n\nFor more than fifty years, the bizarre events at a remote Utah ranch have ranged from the perplexing to the wholly terrifying. Vanishing and mutilated cattle. Unidentified Flying Objects. The appearance of huge, otherworldly creatures. Invisible objects emitting magnetic fields with the power to spark a cattle stampede. Flying orbs of light with dazzling maneuverability and lethal consequences. For one family, life on the Skinwalker Ranch had become a life under siege by an unknown enemy or enemies. Nothing else could explain the horrors that surrounded them -- perhaps science could.\n\nLeading a first-class team of research scientists on a disturbing odyssey into the unknown, Colm Kelleher spent hundreds of days and nights on the Skinwalker property and experienced firsthand many of its haunting mysteries. With investigative reporter George Knapp -- the only journalist allowed to witness and document the team's work -- Kelleher chronicles in superb detail the spectacular happenings the team observed personally, and the theories of modern physics behind the phenomena. Far from the coldly detached findings one might expect, their conclusions are utterly hair-raising in their implications. Opening a door to the unseen world around us, Hunt for the Skinwalker is a clarion call to expand our vision far beyond what we know.\n\n*** \nNote: This book turned out WAY better than I expected. I usually don't trust anything which is often featured on the C2C show, but the book really gave me chills. Good read!","torrent":{"xt":"urn:btih:cbd22f0830a81eaafeb4dba93e62d7dc9b76e65e","amp;dn":"Hunt+for+the+Skinwalker%3A+Science+Confronts+the+Unexplained+at+a+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbd22f0830a81eaafeb4dba93e62d7dc9b76e65e","infoHashBuffer":{"type":"Buffer","data":[203,210,47,8,48,168,30,170,254,180,219,169,62,98,215,220,155,118,230,94]},"announce":[],"urlList":[]}}