{"title":"Edges Of The Lord (2001) - 2Lions-Team","uid":5604526,"size":4160680383,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:cc54dc0829e191b47bbb9d30f9af8c0a31cf0965&amp;dn=Edges+Of+The+Lord+%282001%29+-+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SAIMOR","files":15,"time":1275516209,"description":"Verenigde Staten / Polen\nDrama / Oorlog\n95 minuten\n\nRegisseur: Yurek Bogayevicz \nmet Malgorzata Foremniak, Haley Joel Osment, Willem Dafoe, Liam Hess, Dorota Piasecka, Andrzej Grabowski, Chiril Vahonin, Ola Frycz, Olaf Lubaszenko, Richard Banel\n\nBeschrijving:\n\nAls de nazi's in de herfst van 1943 KrakÃƒÂ³w (Polen) binnenvallen, wordt het 11-jarige jongetje Romek (Haley Joel Osment) op het nippertje bij zijn ten dode opgeschreven familie weggehaald. \nEen boer zal hem helpen onderduiken. Verborgen in een aardappelzak begint Romeks avontuur. De boer smokkelt Romek naar zijn dorp in Oost-Polen. \nOfschoon hij daar wordt voorgesteld als een verre neef, wordt zijn joodse achtergrond al snel duidelijk. Romek raakt bevriend met Tolo, de jongste zoon van de boer. \nSamen zien ze treinen voorbij trekken die duizenden joden naar de concentratiekampen brengen. \nOndanks de wrede en troosteloze situatie leren de kinderen elkaar uiteindelijk te accepteren en te waarderen en hopen ze samen te overleven. \nDoordat de film door een Pool is geregisseerd, is de sfeer alternatief. Een klein minpunt van deze film is dat er Engels met een Pools accent wordt gesproken. \nDat wordt echter gecompenseerd door goed acteerwerk door de gehele cast, met Haley Joel Osment bovenaan. \n\n(Kijkwijzer: Let op met kinderen tot twaalf jaar in verband met angst, geweld en discriminatie.)\n\n\nBeeldformaat : 16:9\n \nTaal         : Engels\n \nAudio        : Dolby Digital 2.0 / 5.1\n \nOndertiteling: Nederlands\n \n****************************************************************************\nUnited States / Poland \nDrama / War \n95 minutes \n\nDirector: Yurek Bogayevicz \nwith Malgorzata Foremniak, Haley Joel Osment, Willem Dafoe, Liam Hess, Dorota Piasecka, Andrzej Grabowski, Chiril Vahonin, Frycz Ola, Olaf Lubaszenko, Richard Banel \n\nDescription: \n\nIf the Nazis in the autumn of 1943, Krakow (Poland) invade, the 11-year-old boy, Romek (Haley Joel Osment), a close call with his doomed family away. \nA farmer will help him abscond. Hidden in a potato sack Romek adventure begins. The farmer smuggles Romek to his village in eastern Poland. \nAlthough he is portrayed as a distant cousin, his Jewish background quickly became clear. Romek befriends Tolo, the youngest son of the farmer. \nTogether they see trains passing that bring thousands of Jews to concentration camps. \nDespite the brutal and bleak situation children learn together eventually accept and appreciate them together and hope to survive. \nBecause the film is directed by a Pole, the atmosphere is an alternative. A small drawback of this film is that English is spoken with a Polish accent. \nThis is offset by good acting by the entire cast, with Haley Joel Osment top. \n\n(Rating: Be careful with children under twelve years in connection with terror, violence and discrimination.) \n\n\nAspect ratio   : 16:9 \n  \nLanguages      : English \n  \nAudio          : Dolby Digital 2.0 / 5.1 \n  \nSubtitles      : Dutch\n\n*****************************************************************************\nBrought to you by \nROMIAS\n2Lions Team \n\nmeer zien?? \nKom dan eens kijken op ons forum \n    &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt; \n\n2Lions-Team for all your Dutch MOVIES and more \n\n****************************************************************************** \nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding.\n\n******************************************************************************\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\n*******************************************************************************\t\n \n \n \n","torrent":{"xt":"urn:btih:cc54dc0829e191b47bbb9d30f9af8c0a31cf0965","amp;dn":"Edges+Of+The+Lord+%282001%29+-+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc54dc0829e191b47bbb9d30f9af8c0a31cf0965","infoHashBuffer":{"type":"Buffer","data":[204,84,220,8,41,225,145,180,123,187,157,48,249,175,140,10,49,207,9,101]},"announce":[],"urlList":[]}}