{"title":"Greedy Torrent the survival kit for a leech","uid":8730171,"size":1210201,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:cccb101931f9ec29eb8ebec6d9b1fe25314505e8&amp;dn=Greedy+Torrent+the+survival+kit+for+a+leech&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"vale89","files":-1,"time":1374540018,"description":"GreedyTorrent, the survival kit for a leech.\n\nGreedyTorrent can help you survive on trackers that enforce a minimum 1:1 trading ratio, and can keep you from getting banned for not uploading. In simple words, it modifies the conversation between your bittorrent client and the tracker, suppressing the actual upload amount. Instead, GreedyTorrent puts you in control of your own upload ratio -- you can define how much upload you want to submit to the tracker.\n\nGreedyTorrent has the following features:\n\nGreedyTorrent is set-once-and-forget type software. No need of configuring it each time you queue a torrent file to download.\nNo complicated options to configure. The default installation of GreedyTorrent is configured to provide you five times actual upload, enough for the survival of a normal ADSL user. There is no need to manually find the hash values or to set tracker URLs, it takes care of them automatically. GreedyTorrent was developed with the beginner user in mind, with an easy to use interface.\nGreedyTorrent generates no additional traffic. It does not run or emulate an &quot;extra torrent client&quot;, and thus does not waste your precious bandwidth.\nYou can continue to use your favorite BitTorrent client, no need to switch to another BitTorrent client to use GreedyTorrent.\nand much more...\n\n_______It seems that the program is useful only for http trackers, not udp._____","torrent":{"xt":"urn:btih:cccb101931f9ec29eb8ebec6d9b1fe25314505e8","amp;dn":"Greedy+Torrent+the+survival+kit+for+a+leech","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cccb101931f9ec29eb8ebec6d9b1fe25314505e8","infoHashBuffer":{"type":"Buffer","data":[204,203,16,25,49,249,236,41,235,142,190,198,217,177,254,37,49,69,5,232]},"announce":[],"urlList":[]}}