{"title":"Detskiy sad/Kindergarten(1983)Yevgeni Yevtushenko,1CD, 704x512","uid":8800695,"size":1992662724,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ce68e136cc8a875dfb051be68374f4fadc8932bf&amp;dn=Detskiy+sad%2FKindergarten%281983%29Yevgeni+Yevtushenko%2C1CD%2C+704x512&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"app1985","files":-1,"time":1376192764,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0085433/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0085433/&lt;/a&gt;\n\n\nYear of release: 1983\nGenre: autobiographical\nDuration: 2:11:37\n\nDirected by Yevgeny Yevtushenko\nWritten by: Yevgeny Yevtushenko\nOperator: Vladimir Papayan\nComposer: Gleb May\nProduction Designer: Viktor Yushin\nProduction: Mosfilm\n\nCast: Sergei Bobrovsky (Toljan), Serge Gander (Eugene), Svetlana Evstratova (Lily), Klaus Maria Brandauer (German officer), Yevgeny Yevtushenko (eccentric chess player), Elena Yevtushenko (conductor), Victor Egunov, Nicholas Karachentsov (Spire, the leader of a gang of thieves'), Leonid Markov (blind), Igor Sklar (father Eugene), Galina Stakhanova (grandmother Jenny), Andrey Gusev (episode).\n\nDescription:\nTwo-part film-remembering the poet Yevgeny Yevtushenko about his wartime childhood, when he was getting to a Siberian winter station, where his grandmother was waiting. The path was unusually long, cold, hungry and angry. Over time, the way the boy has grown up, and when he got to the station, I realized that nothing was going for so long. One day, take the opportunity dreaming of Jack climbed into the front hatch of the tank - and left the village ...\nThe film features verses of eight schoolgirls Nicky Turbine and most Yevgeny Yevtushenko.\n\n&quot;The film is well-known poet Yevgeny Yevtushenko unusual. His language is based on metaphors and symbols sometimes seems too straightforward, the poster. For example, where else can you see the carefully arrayed composition - a bust of Napoleon's hat, a cigarette butt, lying under the wheels of a train? Where else on the way there are a bride and a widow, and at the same snow-white veil is interwoven in the air with black veil? Where else in the film can be seen rampant thieves' den, hunting women (!) On the bear and brightly dressed Gypsy, whooping leaving the front?\nThis all sounds pretentious, secondary and even unprofessional. But the film's unprofessionalism in the film, paradoxically, has a positive side. Yevtushenko takes a picture-memoirs about his wartime childhood so that the mosaic consists of a set of events unpolished, multi-style and unequal episodes. And where the author goes on didactics and false romanticism &quot;thieves of the world&quot;, there are scenes and images truly poetic. And then did not seem to liberty shots where not yet lost remnants of conscience Nazi officer after talking with the prisoner standing at the window, and behind him disappears from the frame portrait of the Fuhrer. And instead - there is a photo of two boys with violins. One-haired German. The other - a dark-haired Russian ... In the beginning of the film Jack carefully and thoughtfully released into the river aquarium fish, which can not be taken to a Siberian evacuation. And then, somewhere in the middle of the picture, there is, at first glance, a strange rhyme - Zhenya's dream, where slowly and intently, carefully and majestically marching soldiers with aquariums in their hands ...\nTemperamentally put in the film crowd scenes. Here chuvstvutsya and scope, and special author attitude. Good actors in the episodes. Their portraits are removed so that palpable in stark contrast with the spectacular acting and garish theatricality Nicholas Karachentsova and Leonid Markov, who played crooks and thieves who have settled in the Siberian rear.\nYevtushenko's controversial film, full of dissonance. But in the film feels a talent quest for style, experimental obsession. &quot;Kindergarten&quot; favorably gladenko film debut, where, no matter how hard you try, you will not find any true sense, no serious thought ... &quot;\nAlexander Fedorov\n\n\nQuality: DVDRip\nFormat: AVI\nVideo codec: DivX\nAudio: MP3\nVideo: 704x512 (1.38:1), 25 fps, DivX Codec 5.2.1 alpha ~ 1848 kbps avg, 0.20 bit / pixel\nAudio: 48 kHz, MPEG Layer 3, 2 ch, ~ 160.00 kbps avg","torrent":{"xt":"urn:btih:ce68e136cc8a875dfb051be68374f4fadc8932bf","amp;dn":"Detskiy+sad%2FKindergarten%281983%29Yevgeni+Yevtushenko%2C1CD%2C+704x512","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce68e136cc8a875dfb051be68374f4fadc8932bf","infoHashBuffer":{"type":"Buffer","data":[206,104,225,54,204,138,135,93,251,5,27,230,131,116,244,250,220,137,50,191]},"announce":[],"urlList":[]}}