{"title":"Rocco.Ravishes.Hollywood.[English].XXX.DVDRiP.XviD-","uid":5612496,"size":1453361152,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:cf3cdfbb0bda90bf95d0b2aa7abaf2cda1850848&amp;dn=Rocco.Ravishes.Hollywood.%5BEnglish%5D.XXX.DVDRiP.XviD-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"trxt","files":2,"time":1275935915,"description":"Director Rocco Siffredi's trip to sunny Southern California results in four scenes of light-hearted, la-la land fun and sexy mayhem linked by a loose story. Christian Clay and Toni Ribas can't understand American trick-or-treaters, but lucky ...    Full Descriptionfor them the Halloween revelers are a crazy slut (Ally Ann) and a ravishing L.A. beauty (Dana DeArmond) who likes cock up the ass and loves ejaculating girl cum onto her sex partners, then licking it up! Rocco's date with a flashy Beverly Hills type (Nikki Benz) gets off to a bizarre start when an irrepressible Latina photo model (Ann Marie Rios) intercepts his advances and wallows in his champagne, but he's got enough lust and cock to leave each of them roughly, vigorously fucked. When Christian runs out of gas in the Hollywood Hills, his vehicle blocks the driveway of two party sluts (Andy San Dimas, Roxy Reed) who take advantage of the situation and his dick. Hot-tempered Roxy gets anally manhandled and lovely Andy tongues the gaping anus that results. Rocco wants to rent a big house in Hollywood's high-rolling hills, and the owners get a big dick deposit. Girly, strawberry blonde Dani Jensen can't resist Rocco, and he can't resist Amy Brooke's stunning rear asset. Dani gets choked, hair-pulled, spanked and fucked till her face flushes red and her foot spasms with orgasm, and Amy shows that her impossibly round, God-sculpted ass can give as pretty a pounding a it takes. Whether performing heroically (in two scenes) or directing (all four), Mr. Siffredi's adventures in L.A. evoke one conclusion: Rocco Ravishes Hollywood. ","torrent":{"xt":"urn:btih:cf3cdfbb0bda90bf95d0b2aa7abaf2cda1850848","amp;dn":"Rocco.Ravishes.Hollywood.%5BEnglish%5D.XXX.DVDRiP.XviD-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf3cdfbb0bda90bf95d0b2aa7abaf2cda1850848","infoHashBuffer":{"type":"Buffer","data":[207,60,223,187,11,218,144,191,149,208,178,170,122,186,242,205,161,133,8,72]},"announce":[],"urlList":[]}}