{"title":"The Big Lebowski A XXX Parody","uid":5540140,"size":1462700032,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:cf58e99b548383b7472fbd13390f18fd83249840&amp;dn=The+Big+Lebowski+A+XXX+Parody&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"trxt","files":2,"time":1273197083,"description":"From New Sensations, the studio that brought you the AVN Award winning Sex-Comedy, 30 Rock: A XXX Parody, cums a spoof of one of the Biggest cult films of all time - THE BIG LEBOWSKI: A XXX PARODY! IT IS A XXX Parody that dares to bring the ...    Full Descriptionworld a dirty spoof that is better than good and thorough. It is Great AND thorough! When some horny thugs almost drown Jeffrey Lebowski in his own toilet and leave some splooge on his new VHS Porn tapes (the tapes that really tied his porn collection together), it sets off a Sexy AND Funny chain of events. You will Absolutely get to see coitus, in AND out, the physical act of love, fuckin' A, and some Orgasm-achieving from one of the Biggest Lebowski's you have ever seen! What will happen in THE BIG LEBOWSKI: A XXX PARODY? Will you finally get to witness the true version of Logjammin', hardcore, the way it was meant to be seen? Will you get to see this horny Dude get his Gutterballs drained? Will the Dude accept Bunny's offer of Oral Coitus? Will Brandt watch? And will that Cable Repairman finally fix the cable? A resounding YES is the answer to these and other questions in New Sensations' THE BIG LEBOWSKI: A XXX PARODY!","torrent":{"xt":"urn:btih:cf58e99b548383b7472fbd13390f18fd83249840","amp;dn":"The+Big+Lebowski+A+XXX+Parody","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf58e99b548383b7472fbd13390f18fd83249840","infoHashBuffer":{"type":"Buffer","data":[207,88,233,155,84,131,131,183,71,47,189,19,57,15,24,253,131,36,152,64]},"announce":[],"urlList":[]}}