{"title":"Dropsaw - Victims Or Killers [2008]","uid":5549008,"size":24788475,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cf9ab3de3fc3b063f4ef70e3c58dd5db7183a080&amp;dn=Dropsaw+-+Victims+Or+Killers+%5B2008%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POWNT3","files":11,"time":1273483409,"description":"Coming from Newcastle Australia, this five piece delivers a unique blend of heavy hardcore and metal, keeping it as original as possible by staying away from latest trends, which is due to a diverse range of influences. Their well received debut album MISSING LIMBS was released on Trial and Error records in april 07. Dropsaw released their second album in 08 titled VICTIMS OR KILLERS. The album was recorded in Melbourne with the help of The Red Shores Roman Koester. Since their inception dropsaw have toured Australia countless times and shared the stage with The Warriors, Avail, Parkway Drive, Cruel Hand, Most Precious Blood, Mindsnare, Carpathian.\n\nAfter spending a month in the studio, Dropsaw has finished recording their 3rd album titled HARD JUSTICE set to be released May 14th 2010. The album was recorded in San Diego, USA with As I Lay Dying frontman Tim Lambesis, Kelly Cairns and Daniel Castleman (Austrian Death Machine, Winds Of Plague, Sworn Enemy, Impending Doom). The band have taken a large step in the way of song writing, mixing it up though the album with insanely fast thrash and destructive breakdowns and keeping that 'heavy as fuck' Dropsaw sound.","torrent":{"xt":"urn:btih:cf9ab3de3fc3b063f4ef70e3c58dd5db7183a080","amp;dn":"Dropsaw+-+Victims+Or+Killers+%5B2008%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf9ab3de3fc3b063f4ef70e3c58dd5db7183a080","infoHashBuffer":{"type":"Buffer","data":[207,154,179,222,63,195,176,99,244,239,112,227,197,141,213,219,113,131,160,128]},"announce":[],"urlList":[]}}