{"title":"X-Files Seizoen 1 aflevering 7 tm 12 DVDRip (NL Subs)","uid":5624500,"size":2451862692,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d004cd8846ca4c6efacb2556564a529baff691f4&amp;dn=X-Files+Seizoen+1+aflevering+7+tm+12+DVDRip+%28NL+Subs%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"evaislief","files":7,"time":1276427103,"description":"X-Files Seizoen 1 aflevering 7 t/m 12 met nederlandse ondertiteling. \n\n\nX files season 1 episode 7-12, dutch subs\n\n\nformaat: divx\ntaal: engels\nondertitels: nederlands (ingebakken)\nduur: ongeveer 40 minuten per aflevering\n\nplot (wikipedia):\nFox Mulder is wat men noemt een believer. Hij gelooft in het bestaan van buitenaardse wezens en zijn leven is gewijd aan het bewijzen van hun bestaan. Na een veelbelovende start aan zijn carriÃƒÂ¨re bij de FBI ontdekt Mulder bij toeval de X-Files, een archief van onopgeloste en onverklaarbare zaken. Zijn interesse is zodanig gewekt dat hij onder hypnose gaat en herinnert zich hoe zijn vier jaar jongere zusje Samantha op achtjarige leeftijd door buitenaardsen werd ontvoerd tijdens een spelletje Stratego. Hij was niet in staat haar te beschermen tegen de 'aanwezigen' in de slaapkamer. Sindsdien is hij op zoek naar de waarheid omtrent haar verdwijning in de hoop dat hij haar terugvindt.\n\nDana Scully heeft geneeskunde gestudeerd voordat ze door de FBI werd gerekruteerd. Terwijl haar familie de keuze voor de FBI nooit heeft begrepen, kiest ze hier toch voor. Als ze van de FBI-academy afkomt, wordt ze geplaatst bij de afdeling van Fox Mulder met de opdracht zijn werk zodanig te bekritiseren, dat dit het einde van the X-Files zou betekenen en Fox Mulder zijn kruistocht naar de waarheid zou moeten opgeven. Doordat zij zich bemoeit met the X-Files en een nauwe band ontwikkelt met Fox Mulder, komt haar leven in gevaar als zij tijdens het tweede seizoen wordt ontvoerd.\n\nDeze twee verhaallijnen vormen de basis voor een mythologielijn die negen seizoenen zal duren.\n\nHet grootste gedeelte van de afleveringen staat op zichzelf. De losse afleveringen hebben een begin en eind van een verhaal. Het karakteristieke van losse X-filesafleveringen is dat ze een sterk verhaal hebben met vaak vele donkere aspecten. Wat het meest gewaardeerd wordt door fans is dat de zaken over het algemeen wel opgelost worden, maar een zodanig open einde hebben dat het verhaal eventueel verder zou kunnen gaan. Mulders speurtocht naar de waarheid achter de ontvoering van zijn zusje en de geheimen van de overheid loopt als een rode draad door de afleveringen, evenals Scully's pogingen logische verklaringen te vinden voor alle paranormale zaken.\n\nMET GROTE DANK AAN WHATTHENAME!","torrent":{"xt":"urn:btih:d004cd8846ca4c6efacb2556564a529baff691f4","amp;dn":"X-Files+Seizoen+1+aflevering+7+tm+12+DVDRip+%28NL+Subs%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d004cd8846ca4c6efacb2556564a529baff691f4","infoHashBuffer":{"type":"Buffer","data":[208,4,205,136,70,202,76,110,250,203,37,86,86,74,82,155,175,246,145,244]},"announce":[],"urlList":[]}}