{"title":"Piotr Dumala&amp;lsquo;s Hand-drawn animation((1981 - 2000)TVRip","uid":8811758,"size":1160648366,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:d0ac7c3d29bfdf158b9c21b69d44c5dcc83ca089&amp;dn=Piotr+Dumala%26lsquo%3Bs+Hand-drawn+animation%28%281981+-+2000%29TVRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"app1985","files":-1,"time":1376476033,"description":" &lt;a href=&quot;\nhttp://www.imdb.com/name/nm0241398/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/name/nm0241398/&lt;/a&gt;\n\n\nYear: 1981-2000\nCountry: Poland\nFeature: hand-drawn animation, surrealism\nDuration: 1:48:13\nTranslation: No\n\nDirected by: Piotr Dumala\n\nDescription: Animation of the author can be called dumb. In the film drama involving music and natural sounds, no dialogue - poetics, probably inspired by the silent movie, in particular works of brothers Lyumer.Dumala uses in his films, the original author's technique &quot;revival&quot; of images that helps to reproduce the style of the dream. It requires huge investment hermit, solitary work. Many compare it to the monk laboriously rewriting the old scriptures. For the emergence of several frames of a movie lasting a few seconds, the artist requires many hours of non-stop &quot;vytsarapyvanya.&quot; On the day of birth of one second filma.Takaya filigree technique allows us to give the softness of the picture, and every movement of the actor as it leaves an imprint on the surface of the plaster, so that even wiggling your finger clockwise or running are extremely smooth.\nCharacteristic feature of each and every film of Peter Dumaly - thickening of the supernatural, the irrational accidents, atmospheric phenomena, unexpected actions of the protagonists. Plot and actors aura envelops the strangeness and mystery. Events do not follow from one another, violated the logic and the smooth flow of the narrative. The viewer feels immersed in a dream, full of character and innuendo.\nPeter I thought - the creator of exceptional, created the unique author's poetics and style. He himself has repeatedly acknowledged that the process of creation, revitalizing their fantasies feels magician. On the one hand, to deeply feel the beauty of the world, on the other - testifying to the evil around us.\nMovies Dumaly - a territory of myth and universal meaning, akin to appear in dreams. The most important thing for him, he said - the gap between imagination and reality. Its elements - the darkness, the night shadows. The world of the artist - a world of a child, amazed and extremely diverse things.\n\n\n\nList of films:\n\n1981 -  Lykantropia (The story of the people who has put himself on the wolf skins)\ntehdannye\n\n\n1983 - Czarny kapturek  (story illuminates the dark side of the famous fairy tale, showing how the events described in it is released in the heroes base instincts)\ntehdannye\n\n\n\n\n1984 -  Latajace wlosy(This is a story about love. Begins movie serene. Two young men, he and she, strolling under a starry night sky. However calm prologue gives way to a string of disturbing events. Loving accepted to run, and it breaks down after a storm, the trees do not bear strong wind break. gushing rain from the sky - certainly not ordinary atmospheric residue, and the rain silver needles that turn into hair. absurd chain of events reminds obscure dream. increasing unease and fear. Heroes, on the one hand, the defenseless, the other - their feeling as if he was the reason which caused one another mysterious atmospheric anomalies)\ntehdannye\n\n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0242590/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0242590/&lt;/a&gt;\n\n1985 - Lagodna (The film is based on Dostoevsky's short story of the same name, it is the story of a marriage. Union of two completely disparate people committing suicide of a young wife. Directed by adhering to the basic motive - the suffering of bearing down on their matrimony a young woman shows her inner feelings with surrealist paintings full of ghostly visions. For example, a symbol of the growing family crisis is growing in size black spider)\ntehdannye\n\n\n\n\n1986 - Nerwowe Zycie Kosmosu\n\n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0423132/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0423132/&lt;/a&gt;\n\n1987 - Sciany (the hero of the film undergoes a series of unexplained tests. He is locked up in a room with no way out, the four walls of an unknown room. Carefully inspect indoors, listening to the echoes, drifted outside, catches the ear every rustle. His behavior resembles that of a person who is in the prison's own psyche, emotionally unstable person. It looks for opportunities to escape, but can not find a single door. Suddenly, out of the dark corridors there is another figure - a man who throws a coin into a piggy bank hole. Prisoner, as it turned out, was in the piggy bank. He watches intently falling in slow motion coin. Suddenly darkness falls)\ntehdannye\n\n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1137394/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1137394/&lt;/a&gt;\n\n1988 Wolnosc nogi (A man in sleep suddenly falls apart. Every part of his body begins to live his life. This happens at night and in the morning with the ringing of an alarm clock, all members of the body back into place. Until then, until one day a man does not detect the absence of one leg, did not return to the owner and chose freedom. Events are gathering pace. flees on foot through the city streets, the crowd following her legless disabled. By furious pursuit joins host feet. Suddenly at his feet grow wings, and like a bird, she triumphantly soars into the sky. invalids only remains that accompany the pleasant view of the fugitive. could say that in this hallucinatory parable celebrates the grotesque and surreal view of the world)\ntehdannye\n\n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0432858/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0432858/&lt;/a&gt;\n\n1991 - Franz Kafka(This is a fantastic biography of the writer, inspired by Kafka's diaries and photographs. However, it has little to do with the film document. Thought is the artist's life on the edge of two worlds, the real and the fictional. Animator is as if the spirit of Kafka. &quot;Franz Kafka&quot; - a kind of oniricheskoe story of a man, painfully feels its own bytie.Dominiruyut scenes of fantastic metamorphosis of the protagonist, his transformation into a different animal. We see a naked young man lying on the bed. in the blink of an eye, he turns into a supine and fingering giant paws insect resembling a grasshopper. Another time the viewer sees the writer's creative process. He sits at the table and a piece of paper and hand holding a pen, light a candle flame. Suddenly, instead of Kafka we see a mole sitting in a cramped hole. Beast is also something writes, and it covers all the same candle. most mysterious in the whole movie scene - Franz transformation into a dog)\ntehdannye\n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0290336/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0290336/&lt;/a&gt;\n\n\n2000 - Zbrodnia i Kara(Last, the longest film of Peter Dumaly, &quot;Crime and Punishment&quot; by Dostoevsky, talks about the murder. None, however, is no mystery obscures crime. Known to us and the victim and the offender. Spectators witness the preparation and implementation of murder, the victim of which is not only the old moneylender, but her sister Lizaveta. mystery and tension rooted in the mind of the hero, in the motive of the crime. murder - an irrational act, what we do not want to see in a dream)","torrent":{"xt":"urn:btih:d0ac7c3d29bfdf158b9c21b69d44c5dcc83ca089","amp;dn":"Piotr+Dumala%26lsquo%3Bs+Hand-drawn+animation%28%281981+-+2000%29TVRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0ac7c3d29bfdf158b9c21b69d44c5dcc83ca089","infoHashBuffer":{"type":"Buffer","data":[208,172,124,61,41,191,223,21,139,156,33,182,157,68,197,220,200,60,160,137]},"announce":[],"urlList":[]}}