{"title":"The.Penguins.of.Madagascar.S02E01.WebRip.XviD","uid":5480345,"size":64312873,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d1370bf048f4eb975d7f397a861fe14e5204b965&amp;dn=The.Penguins.of.Madagascar.S02E01.WebRip.XviD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Texworld","files":2,"time":1270391969,"description":"Episode # \tSeason # \tTitle \tOriginal U.S. airdate\n49 \t2x01 \t&quot;The Red Squirrel&quot;[11] \tMarch 13, 2010 (2010-03-13)\nSkipper's idol, Rockgut, decides to let them help him capture his arch-enemy, The Red Squirrel. Rockgut imprisons Mort, King Julien and Maurice, Burt, Marlene, and the chimps (because of a tail like the squirrel's, lying, liking nuts like the squirrel, liking drawings of red squirrels, and because they &quot;read&quot; a good book, respectively). It's then up to Private to set things right. He enlists Fred the Squirrel to impersonate The Red Squirrel. The others penguins capture &quot;The Red Squirrel&quot; in a box, and when he thinks they aren't looking, Private lets Fred go and thanks him for his help, but the Penguins ARE looking and question Private. After Rockgut accuses Private of being The Red Squirrel in a costume, Kowalski realizes it and points out that it's nonsense, followed by Rockgut accusing Kowalski. The others finally come to their senses. Rico coughs up a payphone, which Skipper pretends to answer, telling Rockgut that HQ called, informing him that The Red Squirrel he had been chasing was a decoy and that the real one was in &quot;Grr...frr... jickle... stan...&quot; tricking Rockgut into leaving. Private says he feels bad for Rockgut because he wasted 47 years looking for an enemy that probably doesn't even exist. But after they leave, it is revealed that The Red Squirrel is hiding in a bush watching with a periscope. He then runs toward a door, but crashes into it, saying &quot;stupid eye patch&quot; just like Fred did when he crashed into a tree earlier. \n","torrent":{"xt":"urn:btih:d1370bf048f4eb975d7f397a861fe14e5204b965","amp;dn":"The.Penguins.of.Madagascar.S02E01.WebRip.XviD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1370bf048f4eb975d7f397a861fe14e5204b965","infoHashBuffer":{"type":"Buffer","data":[209,55,11,240,72,244,235,151,93,127,57,122,134,31,225,78,82,4,185,101]},"announce":[],"urlList":[]}}