{"title":"Madonna - Deeper And Deeper  (2nafish)","uid":5613683,"size":207732740,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d3971cc56867894edc2b7aa31a7ad7ca0f572cc2&amp;dn=Madonna+-+Deeper+And+Deeper++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1275986732,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Deeper and Deeper&quot; is a song by Madonna, released as the second single from her 1992 studio album Erotica. It was released in December 1992 by Maverick Records.\n\nThe dance-pop song was described as &quot;pure disco&quot; by Rolling Stone and &quot;both a product of its time and a timeless Madonna classic in the 'Vogue' vein&quot; by Slant magazine in 2001. Slant goes on to say, &quot;The track even invokes that famous chart-topper's invitation to the dancefloor: 'Let your body move to the music!' One of the few tracks from 'Erotica' not weighed down or muddled by Pettibone's gritty production, 'Deeper and Deeper' sounds just as good today as it did nearly a decade ago.&quot;\n\nMadonna performed the song on The Girlie Show World Tour in 1993 and during the Re-Invention World Tour in 2004. For the latter tour, the song was performed as a slow-cut jazz version with trumpets and an up-right bass. It was also rehearsed for her 2006 Confessions Tour but it was dropped from the set list.\n\nThe single was remixed by Shep Pettibone and David Morales and reached #1 on the U.S. Billboard Hot Dance Club Play. The single fared well around the world, charting mostly in the top ten in most countries including #6 in the UK and #7 on the Billboard Hot 100. In the UK, its chart position ended a five-year run of consecutive top five hits.\n\nThe music video for &quot;Deeper and Deeper&quot; was shot on November 7-8, 1992 at Ren-Mar Studios and The Roxbury nightclub in Hollywood, California and directed by Bobby Woods (who was also an executive producer at Madonna's company, Boy Toy Inc.). It was an ode to Andy Warhol, shot in near identical style to many of his films. In the video Madonna plays Edie Sedgwick.\n\nMadonna's good friend and actress Debi Mazar makes a cameo in the video, as well as Academy-Award winning film director and screenwriter Sofia Coppola, and the actor Udo Kier, who had appeared in the Andy Warhol films Flesh for Frankenstein and Blood for Dracula. There are also brief cameos of Holly Woodlawn and Chi Chi LaRue.\n\nErotica is the fifth studio album by American singer-songwriter Madonna, released on October 20, 1992 by Maverick Records. The album was released simultaneously with Madonna's first book publication, Sex. The RIAA certified it double platinum on January 6, 1993, recognizing two million shipments throughout the U.S. Worldwide sales are currently recorded at just over 5 million.\n\nThe album has been certified Double Platinum status with sales exceeding 600,000 copies in the UK. Despite not being acknowledged at the Grammy Awards Erotica's fifth single Rain got recognition at the MTV Awards in 1993, and Erotica helped to spawn her critically successful fourth tour The Girlie Show World Tour.\n\nThis is Madonna's first album to have the Parental Advisory sticker, and certainly the most controversial album of her career.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:d3971cc56867894edc2b7aa31a7ad7ca0f572cc2","amp;dn":"Madonna+-+Deeper+And+Deeper++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3971cc56867894edc2b7aa31a7ad7ca0f572cc2","infoHashBuffer":{"type":"Buffer","data":[211,151,28,197,104,103,137,78,220,43,122,163,26,122,215,202,15,87,44,194]},"announce":[],"urlList":[]}}