{"title":"A Black Corps d'Elite","uid":5489090,"size":56374769,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d41f292204b3a8953dc38220557d6a8d49462c74&amp;dn=A+Black+Corps+d%5C%27Elite&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"artpepper","files":-1,"time":1270894343,"description":"A Black Corps d'Elite by Richard Hill and Peter Hogg\n\nMichigan State University Press | 1995 | ISBN 087013339 | 206 pgs. | PDF | 56MB\n\n\n\n\nSubtitled: &quot;An Egyptian Sudanese Conscript Battalion with the French Army in Mexico, 1863-1867, and its survivors in Subsequent African History.&quot;\n\n\n\nFor several years, the armies of Napoleon III deployed some 450 Muslim Sudanese slave soldiers in Veracruz, the port of Mexico City. As in the other case of Western hemisphere military slavery (the West India Regiments, a British unit in existence 1795-1815), the Sudanese were imported from Africa in the hopes that they would better survive the tropical diseases that so terribly afflicted European soldiers. In both cases, the Africans did indeed fulfill these expectations.\n\nThe mixture of cultures embodied by this event has piqued the interest of several historians, so it is by no means unknown. Hill and Hogg provide a particularly thorough, if unimaginative, account of this exotic interlude, explaining its background, looking in detail at the battle record in Mexico, and figuring out who exactly made up the battalion. \n\nMuch in their account is odd and interesting, for example, the Sudanese superiority to Austrian troops and their festive nine-day spree in Paris on the emperor's tab. The authors also assess the episode's longer-term impact on the Sudan, showing that the veterans of Mexico, having learnt much from their extended exposure to French military practices, rose quickly in the ranks, then taught these methods to others.\n\nIt bears noting that Hill, a life-long student of the Sudan, published Black Corps in his 94th year; and that he recently died at age 95, in March 1996.","torrent":{"xt":"urn:btih:d41f292204b3a8953dc38220557d6a8d49462c74","amp;dn":"A+Black+Corps+d%5C%27Elite","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d41f292204b3a8953dc38220557d6a8d49462c74","infoHashBuffer":{"type":"Buffer","data":[212,31,41,34,4,179,168,149,61,195,130,32,85,125,106,141,73,70,44,116]},"announce":[],"urlList":[]}}