{"title":"The Communist Manifesto[Frederick Engels][1888]ebook+audiobook-","uid":5644629,"size":53856233,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d4ba56c72bb63f83ef18b9e7216ffdd82633c2d3&amp;dn=The+Communist+Manifesto%5BFrederick+Engels%5D%5B1888%5Debook%2Baudiobook-+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"warlordisback","files":-1,"time":1277246126,"description":"The Communist Manifesto\n-----------------------\n\nAuthor: Karl Marx\nContributor: Frederick Engels\nPublished: 1888\nLanguage: English\n\nAbout:\n\n    Quote:Friedrich Engels has often been credited in composing the first drafts, which led to The Communist Manifesto. In July 1847, Engels was elected into the Communist League, where he was assigned to draw up a catechism. This became the Draft of a Communist Confession of Faith. The draft contained almost two dozen questions that helped express the ideas of both Engels and Karl Marx at the time. In October 1847, Engels composed his second draft for the Communist League entitled, The Principles of Communism. The text remained unpublished until 1914, despite its basis for The Manifesto. From Engels's drafts Marx was able to write, once commissioned by the Communist League, The Communist Manifesto, where he combined more of his ideas along with Engels's drafts and work, The Condition of the Working Class in England.[3]\n\n    Although the names of both Engels and Karl Marx appear on the title page alongside the &quot;persistent assumption of joint-authorship&quot;, Engels, in the preface introduction to the 1883 German edition of the Manifesto, said that the Manifesto was &quot;essentially Marx's work&quot; and that &quot;the basic thought... belongs solely and exclusively to Marx.&quot;[4]\n\n    Engels wrote after Marx's death,\n\n    &quot;I cannot deny that both before and during my forty years' collaboration with Marx I had a certain independent share in laying the foundations of the theory, but the greater part of its leading basic principles belong to Marx....Marx was a genius; we others were at best talented. Without him the theory would not be by far what it is today. It therefore rightly bears his name.&quot;\n\n\nContent of torrent:\n1 pdf file containing the book\n1 e-reader file containing the file (.pdb)\n3 ogg audiofiles as audiobook\n\nAdditional info: If needed in another filetype, please send me a pm on suprbay\n","torrent":{"xt":"urn:btih:d4ba56c72bb63f83ef18b9e7216ffdd82633c2d3","amp;dn":"The+Communist+Manifesto%5BFrederick+Engels%5D%5B1888%5Debook%2Baudiobook-+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4ba56c72bb63f83ef18b9e7216ffdd82633c2d3","infoHashBuffer":{"type":"Buffer","data":[212,186,86,199,43,182,63,131,239,24,185,231,33,111,253,216,38,51,194,211]},"announce":[],"urlList":[]}}