{"title":"bbLean 1.117.1 _ 32 + 64 (scuba-doo)","uid":5477878,"size":874577,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d52611d960d11e8bf8854f1f1366a99c4891faab&amp;dn=bbLean+1.117.1+_+32+%2B+64+%28scuba-doo%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"scuba-doo","files":-1,"time":1270239228,"description":"bbLean is a shell replacement for Microsoft Windows. It is a development branch of BB4Win, and like that shell, it has a minimalist look. bbLean deviates slightly from the minimalist intent of its parent by offering added functionality while retaining the basic simplicity of BB4Win.\n\nDespite this added functionality, the stated goal of the developers is to produce a lean shell (the name is an abbreviation for &quot;Blackbox Lean&quot;), one that offers more core features than the parent shell while improving shell speed and restraining system overhead. As a result, bbLean has gained a reputation as a shell that works better than BB4Win or Xoblite on older PCs and older versions of Windows.\n\nThe shell is extensible by the myriad of plugins that exist, and some extensive mods have been created. bbClean is a rewrite of former mod bbLean 1.16z; along with improvements upon 1.16z's operation, it includes several new features (e.g. volume bars, menu icon support) and customization options (e.g. expanded transparency options and text shadows); there is a fork of bbClean called utbox. Another such mod is bbLean Mod, which adds aesthetic elements such as new bullets and text shadows.\n\nscanned with NOD32 + Comodo AV = Malware FREE\n\n\nENJOY\n       scuba-doo\n\n\nshare the wealth and seed, comments are more then welcome","torrent":{"xt":"urn:btih:d52611d960d11e8bf8854f1f1366a99c4891faab","amp;dn":"bbLean+1.117.1+_+32+%2B+64+%28scuba-doo%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d52611d960d11e8bf8854f1f1366a99c4891faab","infoHashBuffer":{"type":"Buffer","data":[213,38,17,217,96,209,30,139,248,133,79,31,19,102,169,156,72,145,250,171]},"announce":[],"urlList":[]}}