{"title":"The B Team Pilot (CBC) WS XviD-err0001","uid":5520019,"size":183517184,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d59488bcb1588b5fdd8449ea80ff26f79ca43ed0&amp;dn=The+B+Team+Pilot+%28CBC%29+WS+XviD-err0001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"err0001","files":1,"time":1272501907,"description":"The B Team: pilot episode \n\nThe resolution is 608x352 and the quality is decent in my opinion. This pilot aired on April 27, 2010 on CBC in a gap of the NHL broadcast schedule. \n\nFollowing a Canadian Secret Service agent and an incompetent spy team in this sitcom.\n\nThis episode stars: Natalie Lisinska, David Haydn Jones, Matthew MacFadzean, Jeananne Goossen, Michal Grajewski, Veena Sood, Carolyne Maraghi, Remy Girard.\n\n--------------------------------------\n\nCBC announced that it ordered 13 episodes of the action comedy InSecurity (formerly known as The B Team). The production on the show's first season will begin principal photography in July 2010 in Regina, Saskatchewan, with additional shooting in Ottawa, Ontario.\n\nThe series stars Natalie Lisinska (Young People Fucking, Chloe) as Alex Cranston, a rookie agent of the fictional National Intelligence and Security Agency (NISA).\n\nEach week, Alex and her team of espionage misfits take on a mission vital to Canada's national security. As Canadian spies, they get to go where others can't go thanks to the NISA's budget. Besides, they do what others don't want to do. However, even though Alex and her team always screw up, they always manage to get the bad guys and make the world safer in the end.\n\nJoining Lisinska will be William deVry (The Bold and the Beautiful) as the political-savvy boss Peter McNeil; Matthew MacFadzean (Human Resource) as the Jack Bauer wanna-be Burt Wilson; Richard Yearwood (The Plan) as the loyal and unpredictable Benjamin N'udu; Grace Lynn Kung (Being Erica) as the super-smart field specialist Jojo Quan; and RÃƒÂ©my Girard (Les Boys) as the team's jaded veteran, Claude Lesage.\n\nFinally, the show was created by Kevin White (Corner Gas), Robert de Lint (renegadepress.com) and Virginia Thompson (Corner Gas). No premiere date has been announced for the show yet.\n\nsource:\n","torrent":{"xt":"urn:btih:d59488bcb1588b5fdd8449ea80ff26f79ca43ed0","amp;dn":"The+B+Team+Pilot+%28CBC%29+WS+XviD-err0001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d59488bcb1588b5fdd8449ea80ff26f79ca43ed0","infoHashBuffer":{"type":"Buffer","data":[213,148,136,188,177,88,139,95,221,132,73,234,128,255,38,247,156,164,62,208]},"announce":[],"urlList":[]}}