{"title":"Jimmy Eat World - Bleed American (2001) [FLAC] -politux","uid":5549674,"size":343969734,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d6d62db7dc61a0c2d57bfd6d5f64c891aef27ee3&amp;dn=Jimmy+Eat+World+-+Bleed+American+%282001%29+%5BFLAC%5D+-politux&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"politux","files":-1,"time":1273497024,"description":"After being dropped by Capitol, Jimmy Eat World returned in 2001 with their most consistent and accessible album to date. Recorded entirely on the band's dime before they had a new record deal, Bleed American  features compelling lyrics, driving guitar work, and insanely catchy melodies. Left to their own devices during the recording process, it wouldn't have been surprising if the band had turned out another layered, sprawling album akin to their previous full-length masterwork, Clarity. Perhaps sensing that they wouldn't be able to top their previous work when it came to spacy emo, Bleed American heads in a new direction. There are no 16-minute songs here, just straight-ahead rock &amp; roll, performed with punk energy and alt-rock smarts. The title track sets the tone for the album with its blistering guitar attack and aggressive vocals. &quot;A Praise Chorus&quot; and &quot;The Middle improve upon that formula, maintaining the forceful instrumentation but toying with the lyrical themes. &quot;A Praise Chorus&quot; uses the most basic of rock emotions for lyrical inspiration, &quot;I wanna fall in love tonight,&quot; while lifting lyrics from Tommy James' &quot;Crimson and Clover,&quot; They Might Be Giants' &quot;Don't Let's Start,&quot; and MÃƒÂ¶tley CrÃƒÂ¼e's &quot;Kick Start My Heart,&quot; among others. When used in a song about the comfort and trappings of nostalgia, this borrowing comes off more like a well-placed tribute than stealing. &quot;The Middle&quot; offers a pep talk about self-acceptance and fitting in, and one of the most memorable guitar riffs this side of Angus Young. Bleed American's quieter moments recall some of the band's signature instrumentation from their previous work. Gentle keyboards, bells, and stirring background vocals from former that dog. member Rachel Haden enhance the understated beauty of ballads like &quot;Hear You Me&quot; and &quot;Cautioneers.&quot; Haden's most enjoyable contribution, however, is to the up-tempo rocker &quot;The Authority Song.&quot; On the surface a song about a song (John Mellencamp's &quot;Authority Song), it also name drops the Beatles' &quot;What Goes On.&quot; The numerous references to other bands and other songs reveal that although Jimmy Eat World is a critically acclaimed and incredibly talented band, the members are really just rock fans themselves. If they maintain this level of quality, however, don't be surprised if the next generation of ambitious rockers start writing songs that pay tribute to Jimmy Eat World. \n\n\nFormat: CD\nReleased: 2001\nLabel: Western TR\nGenre: Rock\nStyle: Alternative\nQuality: FLAC\nAllmusic rating: 4.5 / 5 stars\n\nTracks:\n\n   1. &quot;Bleed American&quot;       3:02\n   2. &quot;A Praise Chorus&quot;      4:03\n   3. &quot;The Middle&quot;           2:46\n   4. &quot;Your House&quot;           4:46\n   5. &quot;Sweetness&quot;            3:40\n   6. &quot;Hear You Me&quot;          4:45\n   7. &quot;If You Don't, Don't&quot;  4:33\n   8. &quot;Get It Faster&quot;        4:22\n   9. &quot;Cautioners&quot;           5:21\n  10. &quot;The Authority Song&quot;   3:38\n  11. &quot;My Sundown&quot;           5:40","torrent":{"xt":"urn:btih:d6d62db7dc61a0c2d57bfd6d5f64c891aef27ee3","amp;dn":"Jimmy+Eat+World+-+Bleed+American+%282001%29+%5BFLAC%5D+-politux","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6d62db7dc61a0c2d57bfd6d5f64c891aef27ee3","infoHashBuffer":{"type":"Buffer","data":[214,214,45,183,220,97,160,194,213,123,253,109,95,100,200,145,174,242,126,227]},"announce":[],"urlList":[]}}