{"title":"Lilo and Stitch 1-4","uid":8815088,"size":2935285760,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d721369908cb6a8bdd3922779f3fdc0baacc473b&amp;dn=Lilo+and+Stitch+1-4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cj48089","files":-1,"time":1376560791,"description":"Lilo &amp; Stitch (2002)\n\nA Hawaiian girl adopts an unusual pet who is actually an notorious extra-terrestrial fugitive from the law.\n-------------------------------------------------------------------------------------\n\nLilo &amp; Stitch 2: Stitch Has a Glitch (2005)\n\nA malfunction threatens to destroy Stitch and his friendship with Lilo!\n\n-------------------------------------------------------------------------------------\n\nStitch! The Movie (2003)\n\nAll the characters of the warm and fluffy &quot;Lilo and Stitch&quot; are back! In &quot;Stitch! - The Movie&quot;, Stitch, Jumba, and Pleakley are all living with Lilo and Nani. But no one knows that Jumba had secretly deactivated all 625 of is other expiriments and brought them with him. The ex-captain Gantu, hired by Jumba's former partner, Dr. Jacques von Hamsterveil, goes to find them, and captures Jumba to interigate him into telling where they are. Now, Lilo and Stitch have to save Stitch's ohana from being used for chaos. Two expiriemnts are activated in this movie: 221, &quot;Sparky&quot;, with the ability to cause big electric surges, and 625 who has all the abilites of Stitch, but is lasier. At least he makes good sandwiches!\n-------------------------------------------------------------------------------------\n\nLeroy &amp; Stitch (2006)\n\nLilo, Stitch, Jumba and Pleakley have finally caught all of Jumba's genetic experiments and found the one true place where each of them belongs. Stitch, Jumba and Pleakley are offered positions in the Galactic Alliance, turning them down so they can stay on Earth with Lilo. But Lilo realizes her alien friends have places where they belong, and it's finally time to say &quot;aloha.&quot; Meanwhile, Gantu has left Earth and broken Doctor Jacques Von Hamsterviel out of prison, who's planning to create and clone a new experiment named &quot;Leroy,&quot; one that will allow him take over the galaxy.","torrent":{"xt":"urn:btih:d721369908cb6a8bdd3922779f3fdc0baacc473b","amp;dn":"Lilo+and+Stitch+1-4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d721369908cb6a8bdd3922779f3fdc0baacc473b","infoHashBuffer":{"type":"Buffer","data":[215,33,54,153,8,203,106,139,221,57,34,119,159,63,220,11,170,204,71,59]},"announce":[],"urlList":[]}}