{"title":"Double Street Strumpets Rubbish Tattoo","uid":8807239,"size":734025830,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:d769afa6016355e35c116978023b442754a6efad&amp;dn=Double+Street+Strumpets+Rubbish+Tattoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sarah.jensen","files":-1,"time":1376367224,"description":"I can't remember a fucking thing. Two fit strumpets bobbing up and down on me plonker. My wallet is fucking empty, except for some slip of paper. That's all right, I aint got no fucking money anyway. I can't remember getting two birds back to my apartment, but I do have some vague recollections of getting insulted by two slappers in the street. But from what I recall, they were game enough for a good fuck. I could only fuck one of them at a time, only having one fucking dick, so both of them were fingering their own clitorises while waiting turn. So I have woken up with a fucking headache, and no food in the fridge. I am hungry. I wonder what those strumpets were called, I could do with another fuck soon. In the mean time, I could really get through a plate of vegetables and pork, but I aint got no fucking cash left. I am sure those girls have been at my wallet. What is that slip of paper then? Would you fucking believe it? It is their phone numbers. You can watch the video if you want, I am going to, to find out what happened. ","torrent":{"xt":"urn:btih:d769afa6016355e35c116978023b442754a6efad","amp;dn":"Double+Street+Strumpets+Rubbish+Tattoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d769afa6016355e35c116978023b442754a6efad","infoHashBuffer":{"type":"Buffer","data":[215,105,175,166,1,99,85,227,92,17,105,120,2,59,68,39,84,166,239,173]},"announce":[],"urlList":[]}}