{"title":"DogFighter-TiNYiSO","uid":5636023,"size":503134974,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d8d069d5f1142416ea9fa9589802d23304553496&amp;dn=DogFighter-TiNYiSO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"thenoobish","files":38,"time":1276894595,"description":"-- Proudly Presents --\n\nDogFighter (c) Dark Water Studios Ltd\n\n\nRelease On   : 18 June 2010            Disk Amount/Format : 1 CD ISO\nType of Game : Flight Action           Media Protection   : Steam + Custom\n\n\nRelease Information:\nDogFighter is a fast paced, arcade aerial combat game with arena style\ngameplay values. Players can compete against up to 7 opponents in 3\nmultiplayer modes, or go solo in 6 single player game modes, using beefed\nup biplanes sporting over 20 different offensive and defensive weapons.\nUsing a state-of-the-art flight model and controls, ensure that players\nwill have unprecedented command of DogFighters craft. Complete control\nof the craft, combined with easily executed advanced manoeuvres such as\nthe Barrel Roll, give DogFighter players the tools they need to master\nthe skies.\nWith environments built to both slay and save you, the environments in\nDogFighter offer the player a more interactive experience than is usual\nfor the genre. Players can enjoy piloting their craft down mining\ntunnels, through pyramids and active volcanoes, in environments designed\nto deliver a more varied, more interactive gaming experience. Fly low,\nfly fast!\nTake to the skies against up to 7 players in classic multiplayer game\nmodes such as Deathmatch, Team Deathmatch and Capture the flag.\nUse several advanced server options to enable variations on the normal\ngame modes by including the likes of Insta-Gib, Turbo Mode and Black\nDeath.\nEasy-to-fly flight model with the controls you need to execute advanced\nmanoeuvres such as Barrel Roll and Immelmann Turn.\nBeautifully created environments that are as much a player in the game\nas the people piloting the craft.\nWith seven unique craft and over 20 different weapons and defensive\nmeasures, DogFighter caters to all game play styles.\n\n\nBurn/mount, install, copy content from TiNYiSO folder, then play\nGreetz: LARGEiSO and MEDIUMiSO\n\n\n(C) E/dfs\nSIZE DOES NOT MATTER!","torrent":{"xt":"urn:btih:d8d069d5f1142416ea9fa9589802d23304553496","amp;dn":"DogFighter-TiNYiSO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8d069d5f1142416ea9fa9589802d23304553496","infoHashBuffer":{"type":"Buffer","data":[216,208,105,213,241,20,36,22,234,159,169,88,152,2,210,51,4,85,52,150]},"announce":[],"urlList":[]}}