{"title":"Great Books For Our Time","uid":5634690,"size":35669253,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d97805b7ea219252e57ac04d46c34e57c5535a93&amp;dn=Great+Books+For+Our+Time&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ytsewolf","files":15,"time":1276833983,"description":"Great books that I consider must reads. If freedom is ever to be truly embraced in America or in any nation around the world, intellect applied with principle and an understanding of human limitations and imperfection should draw a profound sense of reservation with regards to governance. We cannot create moral codes within people by the use of legislation. Government is force. In its proper limits, it is not advocacy. People must consistently choose liberty at every step and to do that principle must reign over the imperfect impulse to assault others and justify it by doing so through the legal mask of government. Legality is not necessarily morality. In order to overcome this imperfection of the human will, which makes government necessary in the first place, we must be a principled people, disciplined to our own moral cores, based upon axiomatic truth.\n\nThese books are several, not all by any stretch, of those that I have found to be profoundly instructive to the best defensible truth about the proper arrangement of individuals, that being as great voluntary interaction as possible, with government restricted to stopping force, redressing fraud, and protecting our individual liberty from malicious harm, both external and internal.\n\nHopefully, you who download this have already read several of these books but perhaps have not read them all. If you have come across other literature to the defense and promotion of these ideas, please share them. The time for choosing is now, more than ever.\n\nAyn Rand - Atlas Shrugged\nBoortz and Linder - The Fair Tax Book\nFrederic Bastiat - Law\nFrederick Hayek - The Road To Serfdom\nGeorge Orwell - Animal Farm\nHenry Hazlitt - Economics In One Lesson\nJohn Taylor Gatto - The Underground History Of American Education\nJonah Goldberg - Liberal Fascism\nLarry Schweikart - A Patriot's History Of The United States\nMark Steyn - America Alone\nMichael Crichton - State Of Fear\nMilton Friedman - Free To Choose\nRad Bradbury - Fahrenheit 451\nThomas Sowell - Basic Economics A Citizens Guide To The Economy\nW. Cleon Skousen - The 5000 Year Leap","torrent":{"xt":"urn:btih:d97805b7ea219252e57ac04d46c34e57c5535a93","amp;dn":"Great+Books+For+Our+Time","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d97805b7ea219252e57ac04d46c34e57c5535a93","infoHashBuffer":{"type":"Buffer","data":[217,120,5,183,234,33,146,82,229,122,192,77,70,195,78,87,197,83,90,147]},"announce":[],"urlList":[]}}