{"title":"PBS The Dinosaurs! The Monsters Emerge 1 of 4.mpg","uid":8800874,"size":1168029700,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:daa74d5dbdde64b1398359d32c77903274ff7bae&amp;dn=PBS+The+Dinosaurs%21+The+Monsters+Emerge+1+of+4.mpg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"DinoLuigi","files":1,"time":1376197840,"description":"The Dinosaurs!\n\nThe Monsters Emerge\n\nDiscover the startling facts and dramatic new theories currently revolutionizing our understanding of some of the largest, most ferocious animals to ever walk the Earth, in The Dinosaurs!\n\nBanishing the once-accepted image of cold-blooded brutes plodding toward extinction, tantalizing new findings now show intensely active, flee-footed hunters; others were devoted, family-rearing parents; and, most heretical of all, warm-blooded!\n\nOn location with cutting-edge scientists unearthing the latest discoveries, and via dazzling, high-quality animation, this bold new series will forever change your view of these astonishing prehistoric overlords of the Earth!\n\n&quot;The Monsters Emerge&quot; re-creates a skeptical world's reaction to the astonishing fact that unknown giants lay buried in or distant past.  See how the chance discovery of the first dinosaur tooth in England in 1820 sparkled a worldwide mania for &quot;dragon bones&quot; Go West-as a pair of hot-tempered American scientists wage a long-running &quot;dinosaur war&quot; to dig up bigger, better specimens.  Set off for the wild, remote Gobi Desert with a real-life &quot;Indiana Jones&quot;, as Roy Chapman Andrews makes his landmark discovery of the first-ever dinosaur eggs.  And, with a modern expedition en route to the Gobi once more, learn the intriguing questions still to be answered about the amazing animals we call dinosaurs.\n\nRunning time 60 mins.\t","torrent":{"xt":"urn:btih:daa74d5dbdde64b1398359d32c77903274ff7bae","amp;dn":"PBS+The+Dinosaurs%21+The+Monsters+Emerge+1+of+4.mpg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"daa74d5dbdde64b1398359d32c77903274ff7bae","infoHashBuffer":{"type":"Buffer","data":[218,167,77,93,189,222,100,177,57,131,89,211,44,119,144,50,116,255,123,174]},"announce":[],"urlList":[]}}