{"title":"James.Deen.Loves.Butts.XXX.DVDRip.x264-CHiKANi","uid":8761227,"size":1831004649,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:e3583721201c3533b5eaa09cb3ebea48a725e324&amp;dn=James.Deen.Loves.Butts.XXX.DVDRip.x264-CHiKANi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chkm8te","files":1,"time":1375247133,"description":"James.Deen.Loves.Butts.XXX.DVDRip.x264-CHiKANi\n\nCameron Canada, Dana Dearmond, Jessie Rogers, Mason Moore, Skin Diamond.\n\nJames Deen Loves Butts: Horny performer/director James Deen has emerged as a top-shelf stud, a popular ladies man with a dark streak of male-dominant authority in his rough sex performances. Now this handsome dick slinger has joined the elite roster of Evil Angel directors, ready to make his mark with a unique style of kink- and anal-flavored hard-core thatll make the girls swoon and the guys blow their minds (and wads). James Deen Loves Butts is an intense debut starring five insanely gorgeous women all equipped with plump, juicy, fuckable butts. Gorgeous African-American teen Skin Diamond teases the camera with her tattooed, all-natural body. James thoroughly dominates her in an ass-to-mouth pounding; afterward, Skin obediently laps semen from a glass tabletop! Next is Dana DeArmond, and the pale, sensuous slut needs her fine ass fucked; James happily obliges. He gags her throat, drills her pussy and rudely sodomizes the sexy bitch. Dolled up in fishnets, black-haired bombshell Mason Moore gets every hole stuffed. James makes her butthole gape and showers her plump derriere in sperm. Cameron Canada enters the shower for a steamy tryst with James. In no time shes hugging the toilet as James brutally butt-fucks her, making her sphincter yawn widely. Beautiful, 18-year-old blonde Jessie Rogers gets almost more than she can handle as James owns her ass. The DVD includes 19 minutes of behind-the-scenes interviews with the stunning cast. Anal sex may be a job for Evil Angels newest director, but butt lovers will see that truly, James Deen Loves Butts.\n\nScreens: &lt;a href=&quot;\nhttp://xxxces.com/viewer.php?file=3qskvl26mscz7ql1a630.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxces.com/viewer.php?file=3qskvl26mscz7ql1a630.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxces.com/viewer.php?file=inq0wdd9630nw6v132y0.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxces.com/viewer.php?file=inq0wdd9630nw6v132y0.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:e3583721201c3533b5eaa09cb3ebea48a725e324","amp;dn":"James.Deen.Loves.Butts.XXX.DVDRip.x264-CHiKANi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3583721201c3533b5eaa09cb3ebea48a725e324","infoHashBuffer":{"type":"Buffer","data":[227,88,55,33,32,28,53,51,181,234,160,156,179,235,234,72,167,37,227,36]},"announce":[],"urlList":[]}}