{"title":"Stargate SG-1 S07 D2 PAL 2Lions-Team","uid":5549953,"size":4645579536,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:e38dee0a964ceead5a5312057f254752a009d866&amp;dn=Stargate+SG-1+S07+D2+PAL+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"wietseherman","files":-1,"time":1273505503,"description":"Stargate SG-1 S07 D2 PAL 2Lions-Team\n\nNL Info\n\nRevisions - Op een planeet vol met giftige gassen ontdekt SG-1 een koepel met daarin een samenleving.\n\nLifeboat  - SG-1 ontdekt een neergestort ruimteschip. In het schip vinden ze honderden ingevroren passagiers. Dan krijgt Daniel allemaal verschillende zielen in hem.\n\nEnemy Mine - SGC probeert een naquadamijn te ontginnen. Hierbij worden ze aangevallen door een groep Unassen. Daniel en zijn Unas vriend Chaka gaan onderhandelen.\n\nSpace Race - De kapitein van de Cerebus komt naar het SGC. Hij vraagt Carter haar hulp (en Naquada reactor) voor een ruimterace.\n\nEnglisch\n\nRevisions - P3X-289 has a toxic atmosphere but there is a forcefield dome protecting an idyllic village. That is, idyllic except for the fact that its inhabitants are disappearing one by one without noticing it themselves. \n\nLifeboat  - While exploring P2A-347, SG-1 encounters the crashed alien space ship Stromos  containing a plethora of cryogenic pods. The team separates, and Daniel's mind becomes host to many different minds of the ship's crew. When SG-1 investigates the alien ship to find a way to cure Daniel, they discover that the minds of the passengers from the planet Talthus are being saved in the ship's computer. \n\nEnemy Mine - SGC have found a planet with rich deposits of Naqahdah but the local population of Unas do not welcome the mining team. \n\nSpace Race - Carter helps the Serrakin Warrick (season 6's &quot;Forsaken&quot;) to enter his spaceship in a dangerous race on his planet Hebridan (P4X-131). The prize is a lucrative contract. \n\nSource : retail\nFormat : DVD5\nVideo : Pal\nSound : DD 5.1\nLanguages : EN\nMenu : Yes\nExtra : No\nSubs : EN NL FR\nCover: Included\n\nWeblink: http://www.imdb.com/title/tt0118480/\n\nBrought to you by\nB2B\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum   &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl/index.php&lt;/a&gt;\n\n2Lions-Team for all your Dutch MOVIES and more\n*****************************************************\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden.\nDon`t quit after you finished the download, but keep seeding.\n*****************************************************\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name.\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\nto the fakers , get a life !!!\n\n*****************************************************\t","torrent":{"xt":"urn:btih:e38dee0a964ceead5a5312057f254752a009d866","amp;dn":"Stargate+SG-1+S07+D2+PAL+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e38dee0a964ceead5a5312057f254752a009d866","infoHashBuffer":{"type":"Buffer","data":[227,141,238,10,150,76,238,173,90,83,18,5,127,37,71,82,160,9,216,102]},"announce":[],"urlList":[]}}