{"title":"project alf (dutch subs)","uid":5536305,"size":993255561,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e451f59b36847c29fe86b4a6c5c1a6332df66794&amp;dn=project+alf+%28dutch+subs%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"franckozon","files":2,"time":1273082177,"description":"Project: ALF is een Amerikaanse televisiefilm uit 1996. De film is gebaseerd op de televisieserie Alf en dient ter afsluiting van die serie. De regie was in handen van Dick Lowry.\nDe film begint zes jaar na de serie. Alf is gevangen door de Alien Task Force en wordt nu vastgehouden in een geheime basis in de woestijn (gelijk aan Area 51). Het leger houd hem nauw in de gaten.\n\nWanneer blijkt dat het project zal worden gesloten, geeft kolonel Milfoil het bevel Alf te laten executeren. Twee medewerkers van het project, Dr. Rick Mullican en Dr. Melissa Hill, besluiten Alf te redden. Ze smokkelen hem de basis uit en nemen hem mee naar een paar collega-wetenschappers. Die willen Alf aan de hele wereld tonen.\n\nNederlandse ondertiteling ingebakken\n\nProject: ALF is a TV film directed by Dick Lowry. It is the sequel to the final episode, &quot;Consider Me Gone&quot; (1990), of the ALF TV series.\nThe film begins where the original television series finishes, with the alien ALF on his way home, when he is caught by the Alien Task Force (ATF). ALF is kept under lock and key in military custody, and is scheduled for execution by Colonel Milfoil (Martin Sheen), the leader of the ATF. Two officers, Dr. Rick Mullican (William O'Leary) and Dr. Melissa Hill (Jensen Daggett), decide to rescue ALF, but the scientist to whom they take him wants to reveal him to the world, which puts ALF in even more danger than he is already.\n\nwith dutch subs , if you need the movie whit no subs let me know.","torrent":{"xt":"urn:btih:e451f59b36847c29fe86b4a6c5c1a6332df66794","amp;dn":"project+alf+%28dutch+subs%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e451f59b36847c29fe86b4a6c5c1a6332df66794","infoHashBuffer":{"type":"Buffer","data":[228,81,245,155,54,132,124,41,254,134,180,166,197,193,166,51,45,246,103,148]},"announce":[],"urlList":[]}}