{"title":"40.Watt.Domain.-.Short.Wave.2004.LAME-234kbps","uid":5491318,"size":60261189,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e5068648722db591879d0c3948e96628241545db&amp;dn=40.Watt.Domain.-.Short.Wave.2004.LAME-234kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"novamdm","files":-1,"time":1271043671,"description":"40 Watt Domain's big claim to fame is playing at a Keanu Reeve birthday party. Not sure if that's something to be proud of but I have to admit, I wouldn't turn down that opportunity either. 40 Watt Domain don't want to knock you over with heavy rock riffs. Nor do they want to bore you to death. Instead, this band from Los Angeles wants to create some original music, keep it fun and gain a legion of fans. Short Wave just might do the trick. They state that their musical influences range from Fugazi, Black Sabbath, The Clash, Led Zeppelin, to Bob Marley and while they manage to incorporate the odd element of these diverse groups into their music, 40 Watt Domain comes off sounding very original. The closest group that I can think of might be Marcy Playground. 40 Watt Domain tends to be a little less whimsical and a little more straight up rock. All the members are musicians first and foremost and it really shows. Guitars are consistent and the rhythm section is rock solid. The track &quot;Y&amp;R&quot; is one of the heaviest tracks on the album and it hardly hits on the hard rock category. I think there may be a few other celebrities looking for 40 Watt Domain to play their brand of rock for them.\n\n01.Conundrum\n02.Star Fish\n03.Potato\n04.Creamy Teats\n05.S.A.M.\n06.Birdie\n07.Falling Down\n08.Jumpin' Off the World\n09.Salty Dog\n10.Beach, The\n11.Y+R\n12.Bubble\n\n\nAll albums have been tagged, MP3 GAINed, and optimized with MP3packer.","torrent":{"xt":"urn:btih:e5068648722db591879d0c3948e96628241545db","amp;dn":"40.Watt.Domain.-.Short.Wave.2004.LAME-234kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5068648722db591879d0c3948e96628241545db","infoHashBuffer":{"type":"Buffer","data":[229,6,134,72,114,45,181,145,135,157,12,57,72,233,102,40,36,21,69,219]},"announce":[],"urlList":[]}}