{"title":"ByM_DSuper_Network_Tunnel_1.0.5.0","uid":5543156,"size":3135509,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e7b376316ac1a8beb88931eae45a69d374cf1c7a&amp;dn=ByM_DSuper_Network_Tunnel_1.0.5.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"por-dee","files":2,"time":1273302680,"description":"Super network tunnel is a professional http tunneling software, which includes client and server program.\n\n  The server program is usually installed at the home computer, the client program usually at the remote computer (e.g. office, school, ...). It's like a secure VPN software that allows you to access your internet programs without being monitored at work, school, or the government and gives you a extra layer of protection against hackers, spyware , or ID theft. Bypass\nany firewall - Surf, IM, P2P, Game, etc.\n\n  Despite other http tunnel software super network tunnel is a two-way http tunnel software. The remote computer can access the home computer's network and control the home computer. It can any run game/IM/P2P/Stock software via Home's network. Also the home computer can access the remote computer's network and remotely control the office's computer, so can continue your work at home.\n\n  To simplify your configuration work, super network tunnel integrates a functions similar to 'sockscap', you only need to select the program, drag&amp;drop it to the tunnel list of programs, that's all.\n\n  By comparison with the subscription to a http tunnel server service, super network tunnel you will get higher safety because your private data is not transferred through an providers network. many service providers provide poor speeds but you've got the whole bandwidth of your home network for you.\n\n Super network Tunnel is equal to SocksCap + Bidirectional Http Tunnel + Remote Control. It's the first two-way http tunnel software in the world.\n\n","torrent":{"xt":"urn:btih:e7b376316ac1a8beb88931eae45a69d374cf1c7a","amp;dn":"ByM_DSuper_Network_Tunnel_1.0.5.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7b376316ac1a8beb88931eae45a69d374cf1c7a","infoHashBuffer":{"type":"Buffer","data":[231,179,118,49,106,193,168,190,184,137,49,234,228,90,105,211,116,207,28,122]},"announce":[],"urlList":[]}}