{"title":"default.xex","uid":5531200,"size":9224192,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:e7bea8bf769dc2e1eddc555c3044207bab8c9909&amp;dn=default.xex&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"DARKSUPR3MACY","files":1,"time":1272929620,"description":"Alright, this file is not up ANYWHERE apparently, (I would know after spending 2 freaking weeks trying to find one already modded).  It is a long story, I have a retail version of ODST, I ripped it, tried to patch that version of the default.xex and it &quot;wasn't clean&quot;.  So just the other day, after my extensive search yielded nothing, I tried one last thing before giving up my hopes of making .map mods for ODST and torrented another version.  I used that default.xex and IT WORKED!  But I know you don't care about my story of how I finally got my copy of the .xex patched, you probably just want the damn patch!  And before noobs download and be all like &quot;how you install this patch onto my retail xbox trbt lolz&quot; you NEED a JTAG console or a DEV KIT for this to work.  Also, to mod I would recommend a program called Alteration, (which I will not be providing, sorry), and you can have some monster fun.  You guys who are also having the dirty disc error and have given up on modding ODST till you found this torrent, you are so freaking lucky you have me lol.  Hope you enjoy; have fun!\n\n~Dark","torrent":{"xt":"urn:btih:e7bea8bf769dc2e1eddc555c3044207bab8c9909","amp;dn":"default.xex","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7bea8bf769dc2e1eddc555c3044207bab8c9909","infoHashBuffer":{"type":"Buffer","data":[231,190,168,191,118,157,194,225,237,220,85,92,48,68,32,123,171,140,153,9]},"announce":[],"urlList":[]}}