{"title":"Deadwood.S01.720p.HDTV.x264-NGp","uid":5473250,"size":18765254604,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:e871df61e2c96cc1703b1ecc4be7944018908805&amp;dn=Deadwood.S01.720p.HDTV.x264-NGp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Robston","files":-1,"time":1269993597,"description":"Deadwood Season One\n\nIn 1876, Seth Bullock leaves his job as a Marshal in Montana to establish a hardware business in the gold-mining camp of Deadwood, Dakota Territory, along with his friend and business partner, Sol Star. Wild Bill Hickok, the infamous gunslinger of the west, is on a separate journey to Deadwood, accompanied by Charlie Utter and Calamity Jane.\nAl Swearengen is the owner of The Gem, a local saloon and brothel. Other notable residents include Dr. Amos Cochran; A. W. Merrick, owner and editor of the local newspaper &quot;The Pioneer&quot;; and E.B. Farnum, proprietor of The Grand Central Hotel. Brom Garret, a wealthy businessman from New York City, lives at The Grand Central Hotel with his wife, Alma, who nurses a secret laudanum habit. Aware that Garret is interested in prospecting, Swearengen and Farnum deceive him into purchasing a gold claim in a confidence game. Newly-arrived Cy Tolliver and his entourage purchase an abandoned hotel across from The Gem and begin renovations, then open the Bella Union Saloon, a luxurious gambling house and brothel.\n\nMKV container.\nAudio commentaries with some episodes. \nEnglish subtitles\n\nBest looking version I've seen, makes me want to watch the series again and I've only just finished it.\n\nSeason Two and Three 720p also available.\n\n\nNot my original files, thanks for sharing.","torrent":{"xt":"urn:btih:e871df61e2c96cc1703b1ecc4be7944018908805","amp;dn":"Deadwood.S01.720p.HDTV.x264-NGp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e871df61e2c96cc1703b1ecc4be7944018908805","infoHashBuffer":{"type":"Buffer","data":[232,113,223,97,226,201,108,193,112,59,30,204,75,231,148,64,24,144,136,5]},"announce":[],"urlList":[]}}