{"title":"POTHS - Secret Mysteries of Americas Beginning - Vol 11 - Downfa","uid":5479156,"size":2268274799,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e8f4a0cd7fcd9b9d749458d932e8523a0f9d15b7&amp;dn=POTHS+-+Secret+Mysteries+of+Americas+Beginning+-+Vol+11+-+Downfa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"awaken888","files":21,"time":1270311537,"description":"\t POTHS   -- Pointing Out The Hellish Scumbags -- Upload POTHS  everywhere -- POTHS -- Pouring Out The Holy Spirit\n\nI am using a SEED BOX that uploads at rates of up to 2mb/s per leecher. The Seed Box can be identified by this IP address perf029c.xirvik.net. If you hook up with this server open up your client for maximum download speed. Be patient, it takes a awhile to hook up to it and build up speed. Not all leechers hook up and get high download speeds, so it is important to seed long.\n\nHere we go again, this is all History. The Rise and Fall of an Empire. The Final Fall is Coming to your Community soon. WE have been setting on our FAT ASSES in Front of the GREATEST MASS MIND CONTROL DEVISE EVER CREATED. We send our Children to the TV babysitter everyday to be taught everything you Do Not want them to know! Between The TV and the Public Education System our kids do not have a chance. They do not belong to us anymore, they are wards of the STATE. Pass the Potato chips please.\n\nThe only thing History teaches is that people do not learn anything from History. We keep repeating the same mistakes over and over again. That is insanity.\n\nThese video's have been a wake call to millions world wide. \n\nSeed long and Prosper.\n\nEphesians 5:11 KJV\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove them.\n","torrent":{"xt":"urn:btih:e8f4a0cd7fcd9b9d749458d932e8523a0f9d15b7","amp;dn":"POTHS+-+Secret+Mysteries+of+Americas+Beginning+-+Vol+11+-+Downfa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8f4a0cd7fcd9b9d749458d932e8523a0f9d15b7","infoHashBuffer":{"type":"Buffer","data":[232,244,160,205,127,205,155,157,116,148,88,217,50,232,82,58,15,157,21,183]},"announce":[],"urlList":[]}}