{"title":"Holly Golightly and the Brokeoffs - Dirt Don't Hurt [2008][EAC,l","uid":8707292,"size":279724805,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e96ee753b4dcf5ba9e0f3f82f2ea1587de2512fb&amp;dn=Holly+Golightly+and+the+Brokeoffs+-+Dirt+Don%27t+Hurt+%5B2008%5D%5BEAC%2Cl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dickspic","files":21,"time":1374165991,"description":"Artist:Holly Golightly and the Brokeoffs\nRelease:Dirt Don't Hurt\nReleased: 2008\nLabel: Transdreamer Records\nCatalog#: TR1259-CD\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle:americana\n\n\n\n1. Bottom Below\t (3:23)\n2. Up Off The Floor (3:42)\n3. Burn Your Fun (3:36)\t\n4. Slow Road (3:15)\n5. My 45 (2:22)\n6. Cluck Old Hen (2:20)\n7. Indeed You Do (2:53)\n8. Getting' High for Jesus (2:31)\n9. Three Times Under (3:05)\n10. Accuse Me\t(2:33)\n11. Boat's Up The River\t (3:48)\n12. For All This (3:47)\n13. Cora (2:38)\n14. I Wanna Hug Ya, Kiss Ya, Squeeze Ya (2:47)\n\nPesonnel:\n\nHolly Golightly - guitar, banjo, vocals\nLawyer Dave - guitar, percussion, things with strings, vocals\n\nFrom Amazon:\n\n2008 sophomore album from Holly Golightly and her Brokeoffs bandmate Lawyer Dave (a one man drum and guitar extravaganza). Since their debut album, You Can't Buy A Gun When You're Crying, they have been touring the world. They stopped off in Spain to record this album in late May and it follows on really well from the first album, in fact it's an even better album with tracks like the first single 'My 45', a great song about marital bliss and a re-recording of their last single 'I Wanna Hug You, Kiss You, Squeeze You (Till My Arms Fall Off).' \n\nReview from All Music Guide:\n\nDirt Don't Hurt is the second album resulting from the collaboration between Holly Golightly and the Brokeoffs (who are actually just one guy named Lawyer Dave), and like the first it delves deep into the backwoods and back roads of American music. Golightly and Lawyer Dave again write most of the songs and draw from the wells of country (&quot;Up Off the Floor&quot; and &quot;Accuse Me&quot;), country blues (&quot;My 45&quot; and &quot;Cluck Old Hen&quot;), electric blues (&quot;I Wanna Hug Ya, Kiss Ya, Squeeze Ya&quot;), and their own unique mash-up of styles (&quot;Three Times Under&quot; and &quot;For All This,&quot; the most Golightly-sounding song on the album). The duo has an authentic and tough sound, with Lawyer Dave making the most of a bunch of homemade-sounding percussion and both of them playing some gritty and no-nonsense guitar. They sound is suitably heartbroken and angry on the ballads, but the tracks that hit the hardest are the liveliest, like &quot;Cluck Old Hen,&quot; &quot;Gettin' High for Jesus,&quot; and &quot;Bottom Below.&quot; They also sound better when Golightly is singing either alone or in duet. Lawyer Dave has the kind of gruff and manly voice you'd expect to be singing this kind of music, and it's much more interesting to hear Golightly tackle old-timey stuff with her precise and clear vocals. The duets work for that very reason, too, the uneasy blend of authenticity and outsider coming together to make magic. Dirt Don't Hurt isn't necessarily magical, but it is fun and breezy, as well as a nice addition to Golightly's impressive catalog.","torrent":{"xt":"urn:btih:e96ee753b4dcf5ba9e0f3f82f2ea1587de2512fb","amp;dn":"Holly+Golightly+and+the+Brokeoffs+-+Dirt+Don%27t+Hurt+%5B2008%5D%5BEAC%2Cl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e96ee753b4dcf5ba9e0f3f82f2ea1587de2512fb","infoHashBuffer":{"type":"Buffer","data":[233,110,231,83,180,220,245,186,158,15,63,130,242,234,21,135,222,37,18,251]},"announce":[],"urlList":[]}}