{"title":"Twilight (2008) PAL DVD9","uid":5597380,"size":8460271616,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:e989820be22385e21413c823d01581a1e27ac51e&amp;dn=Twilight+%282008%29+PAL+DVD9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Ubehage","files":1,"time":1275083445,"description":"Twilight (2008)\n---------------\n&quot;When you can live forever what do you live for?&quot;\n\nIMDB: &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1099212/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1099212/&lt;/a&gt;\n\nAudio: English\n\nSubs: Danish, Swedish, Norwegian, Finnish\n\nExtra Materials:\n- Extended Scenes.\n- Deleted Scenes.\n- Becoming Bella.\n- Becoming Edward.\n- A Conversation with Stephenie Meyer.\n- The Comic Con Phenomenon.\n- &quot;Decode&quot; by Paramore.\n\n\nPlot outline:\nBella Swan has always been a little bit different. Never one to run with the crowd, Bella never cared about fitting in with the trendy, plastic girls at her Phoenix, Arizona high school. When her mother remarried and Bella chooses to live with her father in the rainy little town of Forks, Washington, she didn't expect much of anything to change. But things do change when she meets the mysterious and dazzlingly beautiful Edward Cullen. For Edward is nothing like any boy she's ever met. He's nothing like anyone she's ever met, period. He's intelligent and witty, and he seems to see straight into her soul. In no time at all, they are swept up in a passionate and decidedly unorthodox romance - unorthodox because Edward really isn't like the other boys. He can run faster than a mountain lion. He can stop a moving car with his bare hands. Oh, and he hasn't aged since 1918. Like all vampires, he's immortal. That's right - vampire. But he doesn't have fangs - that's just in the movies. And he doesn't drink human blood, though Edward and his family are unique among vampires in that lifestyle choice. To Edward, Bella is that thing he has waited 90 years for - a soul mate. But the closer they get, the more Edward must struggle to resist the primal pull of her scent, which could send him into an uncontrollable frenzy. Somehow or other, they will have to manage their unmanageable love. But when unexpected visitors come to town and realize that there is a human among them Edward must fight to save Bella? A modern, visual, and visceral Romeo and Juliet story of the ultimate forbidden love affair - between vampire and mortal.","torrent":{"xt":"urn:btih:e989820be22385e21413c823d01581a1e27ac51e","amp;dn":"Twilight+%282008%29+PAL+DVD9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e989820be22385e21413c823d01581a1e27ac51e","infoHashBuffer":{"type":"Buffer","data":[233,137,130,11,226,35,133,226,20,19,200,35,208,21,129,161,226,122,197,30]},"announce":[],"urlList":[]}}