{"title":"Karl Dawson - Matrix Re-imprinting - Serious Diseases DVDs","uid":5528677,"size":4509030026,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:eb3c7493fb08d17bf2513c15e64bca4189f071ec&amp;dn=Karl+Dawson+-+Matrix+Re-imprinting+-+Serious+Diseases+DVDs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"LJE111","files":7,"time":1272864621,"description":"Karl Dawson - Matrix Re-imprinting for Serious Diseases DVDs\n\nEFT Master, Karl Dawson gives an engaging and highly informative overview of the process of serious and autoimmune disease, including chronic fatigue/M.E., thyroid problems, chronic pain, cancer, and others. Karl then addresses the disease process using EFT (Emotional Freedom Techniques) and nutrition.\n\nJust some of the topics covered in this 6 DVD set from a live 2 day training with Karl Dawson, EFT Master:\n\n* A large section on Matrix Reimprinting including, theory, demos and client testimonial\n* Factors which make us more susceptible to disease\n* What do we really mean by stress?\n* How wrong beliefs cause specific diseases\n* How our early decisions shape our whole lives\n* How we create our diseases according to our expectations in life\n* Beliefs in the way of healing\n* EFT techniques to address our core beliefs about ourselves and the world\n* Demonstrations using EFT to uncover these beliefs and decisions\n* Learn a simple HeartMath technique to prevent clients going into flight and flight\n* Introduction to meta-medicine, the world's leading diagnostic tool which helps directs EFT with more precision\n* We will see how the diseases we exhibit are our body's metaphor to draw attention to past traumas and elements in our life which need addressing\n* Find which core beliefs you are running and how to deal with them\n* Learn about the latest breakthroughs in science and how this validates our work with EFT\n* The number one way to rebuild your immune system\n* Why we self medicate and self sabotage as a way to cope with life and how to find better alternatives\n* Plus, lots of other invaluable understanding and solutions when working with clients with mental, emotional and physical issues.\n\nNote: The first DVD of this set can be found here: http://thepiratebay.se/torrent/5528674\nRichard Flook &amp; Karl Dawson - Meta-Medicine &amp; EFT - 03 of 09.avi 815.86 MB (includes explanation about ECHOs)","torrent":{"xt":"urn:btih:eb3c7493fb08d17bf2513c15e64bca4189f071ec","amp;dn":"Karl+Dawson+-+Matrix+Re-imprinting+-+Serious+Diseases+DVDs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb3c7493fb08d17bf2513c15e64bca4189f071ec","infoHashBuffer":{"type":"Buffer","data":[235,60,116,147,251,8,209,123,242,81,60,21,230,75,202,65,137,240,113,236]},"announce":[],"urlList":[]}}