{"title":"David Wilcock - 2012 Event Horizon - Enigma2","uid":5538009,"size":703741978,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:ec85d12c16d40aa1e40e3272677df63f5fd943ae&amp;dn=David+Wilcock+-+2012+Event+Horizon+-+Enigma2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Porkster","files":-1,"time":1273137157,"description":"In this heavily-anticipated sequel to 2012 Enigma, #1 Most Viewed on Google, 12/1/08, David Wilcock presents a compelling case that the prophecies of a Golden Age are not myth or superstition.\n\nOur DNA has been evolving 100 times more rapidly in the last 5000 years due to a natural galactic process, which is also creating climate change throughout our entire solar system. If the prophecies are correct, psychic abilities and powers such as telekinesis, levitation, spiritual healing and telepathy may soon become as common as breathing.\n\nThe Mayan Calendar, the time line in the Great Pyramid of Giza, the story of Jesus Christ in the Bible and many other ancient mystery schools and spiritual teachings all speak of a great tribulation that transforms Earth into a Utopian Age. Many misunderstand these prophecies as predicting pole shift, asteroid collisions, super volcano eruptions or Armageddon thanks to Planet X, alien invasion, Illuminati/government takeover, or a solar event.\n\nRussian physics reveals that anti-gravity, free energy and time travel technology arise from a Source Field that is the energy of Mind, Spirit and Consciousness. Life emerges from non-living material by Intelligent Design and evolution occurs in sudden bursts that repeat in 26 and 62 million year cycles, apparently the result of energy waves gradually rippling out from the centre of the galaxy and transforming our DNA.\n\nFor at least 1200 years, crop circles have presented symbolic messages of DNA transformation and even Ascension on or around December 21, 2012. Easter Island, Stonehenge and some 4000 ancient sites are built on a Global Grid of energy that creates portals in space and time, such as the Bermuda Triangle. Rapture may indeed occur but in a very different way than most believe.\n\nProject Camelot whistle-blowers reveal that extraterrestrials look human like us and may even be time travelers from our future! Edgar Cayce and the Law of One reveal we have a Higher Self leading us through reincarnation and Graduation. &lt;a href=&quot;\nhttp://divinecosmos.com/index.php/start-here/davids-blog/831-2012eventhorizon&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://divinecosmos.com/index.php/start-here/davids-blog/831-2012eventhorizon&lt;/a&gt;\n\n\n  ____                      _                      _   _       _\n / ___|___  _ __  ___ _ __ (_)_ __ __ _  ___ _   _| | | |_   _| |__\n| |   / _ \\| '_ \\/ __| '_ \\| | '__/ _` |/ __| | | | |_| | | | | '_ \\\n| |__| (_) | | | \\__ \\ |_) | | | | (_| | (__| |_| |  _  | |_| | |_) |\n \\____\\___/|_| |_|___/ .__/|_|_|  \\__,_|\\___|\\__, |_| |_|\\__,_|_.__/\n                     |_|                     |___/\n   ____\n  / ___|___  _ __ ___\n | |   / _ \\| '_ ` _ \\\n | |__| (_) | | | | | |\n(_)____\\___/|_| |_| |_|\n\n\nPLEASE KEEP SEEDED TO PASS ON THE MESSAGE.  PLEASE VISIT OUR SITE AND SHARE THE WORD!\n\n* Don't Be Fooled Any Longer on Darwinism, Evolution, Global Warming Lies, Internationalism, etc.\n* Get The Message Out, Openly!\n","torrent":{"xt":"urn:btih:ec85d12c16d40aa1e40e3272677df63f5fd943ae","amp;dn":"David+Wilcock+-+2012+Event+Horizon+-+Enigma2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec85d12c16d40aa1e40e3272677df63f5fd943ae","infoHashBuffer":{"type":"Buffer","data":[236,133,209,44,22,212,10,161,228,14,50,114,103,125,246,63,95,217,67,174]},"announce":[],"urlList":[]}}