{"title":"Haunted","uid":5525824,"size":5260020858,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ed8c40fd5cd5f3f28d07d89700163e9156f4722b&amp;dn=Haunted&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pgnds","files":11,"time":1272767299,"description":"SciFi Haunted  (TV series)\n\n1. PILOT: After being dead for a couple minutes, Frank Taylor (Matthew Fox) is      revived, followed by good- and evil- spirits.\n\n2. GRIEVOUS ANGELS: Frank searches for a missing teen clubber. \n\n3. FIDELITY: A serial killer targets women in sleazy motels.\n\n4. ABBY: Marcus enlists Frank's help in solving a ritualistic murder which resembles a case Marcus thought he'd solved years before.\n\n5. BLIND WITNESS: A blind military vet's ghost tries to lead Frank to the crime scene where a teenage girl was killed.\n\n6. NOCTURNE: Frank becomes a suspect in the murder of a woman he has no memory of meeting.\n\n7. A THREE-HOUR TOUR: After a car accident on a dark country road, Frank is taken in by a young girl and her reclusive parents.\n\n8. NEXUS: The evil spirit of Simon taunts Frank as a murdered woman's ghost seeks out her husband and the hit man he hired.\n\n9. SIMON REDUX: Frank tries to find out more about the evil spirit haunting him.\n\n10. LAST CALL: A ghost trapped between this life and the next befriends Frank.\n\n11. SEEKING ASYLUM: Frank goes undercover in rehab to find a woman's missing fiance.","torrent":{"xt":"urn:btih:ed8c40fd5cd5f3f28d07d89700163e9156f4722b","amp;dn":"Haunted","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed8c40fd5cd5f3f28d07d89700163e9156f4722b","infoHashBuffer":{"type":"Buffer","data":[237,140,64,253,92,213,243,242,141,7,216,151,0,22,62,145,86,244,114,43]},"announce":[],"urlList":[]}}