{"title":"Outlandish - Let Off Some Steam (Xvid-2nafish) 1080p","uid":5602441,"size":183887934,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:edcde1bf935c94e6c2ce7476f772ae489f927526&amp;dn=Outlandish+-+Let+Off+Some+Steam+%28Xvid-2nafish%29+1080p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1275390604,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:04:22\n\n[Video]\nResolution : 1920x1080\nCodec : XviD MPEG-4 codec\nFPS : 24.00\nBitRate : 5282 Kbps\nQuality Factor : 0.11 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 320 Kbps\n\n\nSound of a Rebel is the fourth studio album by the Danish hip-hop group Outlandish. It was released in Denmark on May 11, 2009.\n\nOutlandish is a multi-award winning hip-hop  group based in Denmark. Formed in 1997, they consist of Isam Bachiri (born in Denmark and of Moroccan  background), Waqas Ali Qadri (born in Denmark and of Pakistani  background), and Lenny Martinez (born in Honduras  and is of Cuban  and Honduran  descent). All three members are devoutly religious, Isam and Waqas being Muslims, and Lenny being Catholic. The band members live in BrÃƒÂ¸ndby Strand.\n\nOutlandish's hip-hop/R&amp;B/soul music sound takes influences from their various backgrounds (Moroccan/Arab/Amazigh, Pakistani/Punjabi and Latin American), and although their songs are primarily in English, they usually feature lyrics in Spanish, Urdu/Punjabi, Danish, and Arabic. All these influences make the music of Outlandish somewhat unique and this is easy to notice from the variety of genres covered in their albums. Outlandish often include themes about Islam and contemporary issues facing young Muslims in the west in their music, and sometimes their songs define a unique nasheed-like urban genre.\n\nTheir first single &quot;Pacific to Pacific&quot; was used in connection with an Amnesty International charity event. Next came the single &quot;Saturday Night&quot;, a song that was later to be included on the soundtrack for the Danish movie Pizza King. These singles were the prelude to their first album, Outland's Official (2000), which was only released in Denmark. The hit song &quot;Walou&quot; was later included on their second album Bread &amp; Barrels of Water.\n\nSingles from their second album made the most impact on the international music charts. Hit singles included &quot;Aicha&quot; Produced by Mintman, (first made famous by Khaled) which made it to number one in Germany, and received a lot of airplay across many Asian countries, especially in South Korea. The video to &quot;Aicha&quot; also won a best music video award. &quot;Guantanamo&quot; also made a strong impression on the European charts. An old Hindi chorus running through &quot;Peelo&quot; made it a smash hit amongst Indians living in the West.\n\nThe group have recorded a LeÃƒÂ³n Gieco's cover of the song &quot;Solo le Pido a Dios&quot; (&quot;I Only Ask of God&quot;).\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:edcde1bf935c94e6c2ce7476f772ae489f927526","amp;dn":"Outlandish+-+Let+Off+Some+Steam+%28Xvid-2nafish%29+1080p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"edcde1bf935c94e6c2ce7476f772ae489f927526","infoHashBuffer":{"type":"Buffer","data":[237,205,225,191,147,92,148,230,194,206,116,118,247,114,174,72,159,146,117,38]},"announce":[],"urlList":[]}}