{"title":"True Love (OMU).avi","uid":5629598,"size":839219200,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:eec64907168cb59f362e9f0287a0437bcd27ab35&amp;dn=True+Love+%28OMU%29.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Herminsche","files":1,"time":1276618561,"description":"Description\nTRUE LOVE is an eclectic collection of short stories abotu growing up gay in America and searching for lasting companionship. From hidden secrets, closely held crushes, lifelong commitment and casual sex, TRUE LOVE explores the broad spectrum of gay relationships in urban 21st Century life. The stories range from a young boy's preference for his sister's frilly Christmas gifts in A CHRISTMAS STORY, a pair of adolescent boys discovering the first pangs of love and rejection in GOING GAY, the strained relationship between a college student and his uncle when their past returns to haunt them in HISTORY, lasting loving relationships between older men in SUNDAY, hurt feelings of betrayal after casual sex in HE WAS PERFECT, a discovery of why we commit our lives to each other in STAYING TOGETHER and that magic moment in a teenager's life when Romeo truly walks out of the spotlight and into your arms in A LITTLE DRAMA. Sensual, tender, funny, quirky, and often touching. TRUE LOVE observes the realities of desperate people who will sometimes do hurtful things in search of true love, ones who have been scarred by the journey and those who found the one they have been searching for. \n\nBeschreibung:\nDie Geschichten erzÃƒÂ¤hlen von der Vorliebe eines kleinen Jungen fÃƒÂ¼r die spitzenbesetzten Weihnachtsgeschenke seiner Schwester in &quot;A Christmas Story&quot;, ein paar Heranwachsenden, die ersten Liebeskummer und ZurÃƒÂ¼ckweisung in &quot;Going Gay&quot; erleben, der angespannten Beziehung eines Studenten und dessen Onkel, die in &quot;History&quot; von Ihrer Vergangenheit eingeholt werden und von bestÃƒÂ¤ndigen, liebevollen Beziehungen zwischen reiferen MÃƒÂ¤nnern in &quot;Sunday&quot;.\nUm das verletzende GefÃƒÂ¼hl der Untreue nach einem Seitensprung geht es in &quot;He Was Perfect&quot;, die Entdeckung, warum wir uns fÃƒÂ¼r einander entscheiden in &quot;Staying Together&quot; und diesen magischen Moment im Leben eines Teenagers, wenn Romeo tatsÃƒÂ¤chlich aus dem Scheinwerferlicht tritt und dir in die Arme fÃƒÂ¤llt in &quot;A Little Drama&quot;. \nLanguage englisch\nSubtitle german\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0436852/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0436852/&lt;/a&gt;\n\nPlease seeding","torrent":{"xt":"urn:btih:eec64907168cb59f362e9f0287a0437bcd27ab35","amp;dn":"True+Love+%28OMU%29.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eec64907168cb59f362e9f0287a0437bcd27ab35","infoHashBuffer":{"type":"Buffer","data":[238,198,73,7,22,140,181,159,54,46,159,2,135,160,67,123,205,39,171,53]},"announce":[],"urlList":[]}}