{"title":"South of Bixby Bridge - Ryan Winfield","uid":8820764,"size":869843,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:efddbad9209fa23a19ed2a4365d88e55fc14c255&amp;dn=South+of+Bixby+Bridge+-+Ryan+Winfield&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"KatSucks","files":3,"time":1376697788,"description":"For a request from the forums.\n\nAmazon description: 2011 Breakout Novel -- About to turn 30 and being discharged from drug rehab, Trevor Roberts is sure he's hit bottom with nowhere to go but up. He soon learns that sometimes the &quot;bottom&quot; is just the beginning. With more twists than California's Highway 1, the intimate narrative follows a young man on a wild month-long ride to the dizzying, drunken heights of Napa Valley excess where he falls fast for his new boss's intoxicating wife and becomes entangled in a strange threesome affair. But things soon begin to unravel as Trevor is drawn into a secret world of sex and scandal, only to have his lust for success drag him down again through a phantasmagoria of hedonistic hell. &quot;Shocking and unapologetic&quot;, South of Bixby Bridge barrels along with the &quot;frenetic pace of a Hollywood blockbuster,&quot; delivering &quot;poetic prose loaded with images&quot;. With gripping drama, witty dialogue, and sexy, jaw-dropping glimpses into the nouveau-riche underworld of California's wealthy elite, you won't be able to put this riveting new novel down. Buckle up and enjoy the read!  \n\nFresh out of drug rehab.\nA young unemployed stockbroker, alone.\nStruggling to survive the holidays on the San Francisco streets.\nHe wants his life back, he wants his girlfriend back.\nThen his luck turns when he runs into just the right man--\nA charming, sadistic hedge-fund owner with an intoxicating wife.\nSuccess, money, a second chance . . .\nBut sometimes second chances come with a price.\nSometimes the price is your soul.\n\nWarning: This novel is an unfiltered account of a young man's struggle to overcome addictions and it includes some graphic language, descriptive sexual scenes, and adult situations.","torrent":{"xt":"urn:btih:efddbad9209fa23a19ed2a4365d88e55fc14c255","amp;dn":"South+of+Bixby+Bridge+-+Ryan+Winfield","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"efddbad9209fa23a19ed2a4365d88e55fc14c255","infoHashBuffer":{"type":"Buffer","data":[239,221,186,217,32,159,162,58,25,237,42,67,101,216,142,85,252,20,194,85]},"announce":[],"urlList":[]}}