{"title":"Ancient Greece and Rome - Carroll Moulton [Encyclopedia] Mobi/Ep","uid":8858157,"size":294341183,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f00a01391a84335beb6cf51a50c52808783fbd1b&amp;dn=Ancient+Greece+and+Rome+-+Carroll+Moulton+%5BEncyclopedia%5D+Mobi%2FEp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"K-Slender","files":5,"time":1377709382,"description":"Scribner has revised its college-level Ancient Writers: Greece and Rome (1982) and Civilizations of the Ancient Mediterranean: Greece and Rome (1988) to provide us with an attractive encyclopedia for younger students. With a glimpse into the relevance of Greek and Roman history and their impact on Europe and the Americas, these four volumes cover the period from 2,000 B.C. to 529 A.D. The volumes are arranged alphabetically, with volume 1 containing a table of contents that lists the maps, color plates, and entries for all four volumes.\n\nThe encyclopedia features almost 500 entries ranging from a few short paragraphs to more than 17 pages for Greece, history of. Entries provide explanations of each subject, as well as references to related topics found within the four volumes. On each page, in the left margin, one can find definitions of terms that might be unfamiliar to users, along with sidebars and time lines. Following the entries in volume 4 is a list of suggested readings grouped under 11 subject areas, including culture and society, myths and legends, biography, and fiction. A &quot;Timeline of Ancient Greece and Rome&quot; is repeated at the beginning of each volume. ","torrent":{"xt":"urn:btih:f00a01391a84335beb6cf51a50c52808783fbd1b","amp;dn":"Ancient+Greece+and+Rome+-+Carroll+Moulton+%5BEncyclopedia%5D+Mobi%2FEp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f00a01391a84335beb6cf51a50c52808783fbd1b","infoHashBuffer":{"type":"Buffer","data":[240,10,1,57,26,132,51,91,235,108,245,26,80,197,40,8,120,63,189,27]},"announce":[],"urlList":[]}}