{"title":"Winden Waaien om de Rotsen Het geslacht Bjorndal(Part2) 2Lions-T","uid":5627874,"size":4390472945,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:f060e0def42de534dfba187dbe48817bb95bb935&amp;dn=Winden+Waaien+om+de+Rotsen+Het+geslacht+Bjorndal%28Part2%29+2Lions-T&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pioen","files":-1,"time":1276550566,"description":"Erbe von BjÃƒÂ¶rndal, Das (1960) \nWinden Waaien om de Rotsen (Het geslacht Bjorndal - 1960)\n\nEn eeuwig zingen de bossen is de verfiming van het eerste deel van het beroemde boek &quot;Het geslacht Bjorndal&quot;.\nOorspronkelijk bestond het boek uit drie delen maar voor de films hebben ze het verhaal ingekort in twee films: \nDeel 1 En eeuwig zingen de bossen, en\nDeel 2 Winden waaien om de rotsen. \n\n \n  Winden Waaien om de Rotsen (Aka Das Erbe von BjÃƒÂ¶rndal, 1960)\nHet vervolg op de heimatfilm Und ewig singen die WÃƒÂ¤lder, gebaseerd op de trilogie van Trygve Gulbranssen.\n\nNa de dood van zijn vader volgt de jonge Dag hem op als hoofd van het boerenbedrijf. Hij probeert de relatie met buurman von Gall te verbeteren, maar nieuwe problemen dienen zich aan.\n\nEnglish\n\nAfter all the drama in &quot;Und Ewig Singen die WÃƒÂ¤lder&quot;, the surviving second son and heir, Dag junior, father of the next heir, lays his father in his grave. The former castle estate steward feared to be thrown out with his retarded son Lorenz, but is offered management again, and a new house for him and Adelheids's old aunt Eleonore Barre, the sister of Dag's now in-living father-in-law, Royal Guards Major Henrik a.D. Barre, who will tend to Bjorndal estate's bookkeeping. Dag is fair for his tenants, while hard for those who try to cheat him, and gives employ to hapless Gunvor, till her husband writes her sprung from jail, so she admits having been charged with the same murder as he; Dag finds and gets rid of her husband who tells him she was unfaithful with the victim, a rich apothecary in the city; paid off to leave for suggesting -perhaps truthfully- her baby is Henriks, showing the treasured ring the major once receives from a royal chamberlain, Gunvor takes revenge by breaking a window so his infant dies from the icy wind, while Adelheid worried what caused this nightly haste. After the funeral Eleonore convinces Adelheid happiness can only return after making up with Dag, and sends her brother to Dag, who warns him he can't continue taking the blame in his wife's eyes; the Major shoots himself, leaving a letter about his guilt. Years later the couple has other children; the wood business is good, exporting to Britain. Eleonore adopts orphan girl Barbara. When the flood causes logs to clog up in the river requiring an explosion, Lorenz takes Barabara for a coach drive and they jump in a boat; Dag jumps in at the last moment, but the logs catch up, only the girl gets safe ashore and becomes son Dag III's sweetheart... \n\n\n\nOostenrijk\nDrama\n96 minuten\n\ngeregisseerd door Gustav Ucicky\nmet Ellen Schwiers, Maj-Britt Nilsson en Brigitte Horney\n\nOndertitels: Nederlands\nTaal: Duits\nCover: Ja\n\nDit is een spot met dank en alle eer voor tijgerbase \nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail\n \nOndertitels : Nederlands (Hardcoded)\n \nGenre : Drama\n \nWeblink : &lt;a href=&quot; http://www.kino.de/kinofilm/das-erbe-von-bjoerndal/trailer/1864.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.kino.de/kinofilm/das-erbe-von-bjoerndal/trailer/1864.html&lt;/a&gt;\nWeblink : &lt;a href=&quot; http://www.moviemeter.nl/film/9936&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.moviemeter.nl/film/9936&lt;/a&gt;\nWeblink : &lt;a href=&quot; http://www.imdb.com/title/tt0053798&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0053798&lt;/a&gt; \n\n*****************************************\n\nBrought to you by \nPioen\n\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\n\n\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\n\n\n \n \n \n","torrent":{"xt":"urn:btih:f060e0def42de534dfba187dbe48817bb95bb935","amp;dn":"Winden+Waaien+om+de+Rotsen+Het+geslacht+Bjorndal%28Part2%29+2Lions-T","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f060e0def42de534dfba187dbe48817bb95bb935","infoHashBuffer":{"type":"Buffer","data":[240,96,224,222,244,45,229,52,223,186,24,125,190,72,129,123,185,91,185,53]},"announce":[],"urlList":[]}}