{"title":"Forsyte Saga, The (2002)(Retail)(PAL) 4xDVD5","uid":5607546,"size":18038208495,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:f0baa2c537981ee8cc5c64b84b1961758761d866&amp;dn=Forsyte+Saga%2C+The+%282002%29%28Retail%29%28PAL%29+4xDVD5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NLUPPER","files":144,"time":1275666594,"description":"Forsyte Saga, The (2002)(Retail)(PAL) 4xDVD5\n\nPLOT\n\nIn Victorian England, Soames Forsyte, a man from a wealthy and arrogant family, meets a falls in love with Irene Herron, a poor woman. \nAfter taking her step-mother's advice, Irene marries Soames. After four years of marriage, Irene is not happy because she does not love him. \nSoames tries to win her affections by giving her the things he believes every woman wants, dresses and jewels. He can not give her the one thing her heart desires, freedom. \nOut of desperation, he asks his cousin June's fiancÃƒÂ©, Phil Bosinny, to build him a house in the country. Irene sees the house as a prison. \nDuring the construction of the house, Phil and Irene fall in love and have an affair. \nThe affair causes a scandal in the family. Years later, Irene comes in contact with Soames's uncle Jolyon who leaves her money after he dies out of friendship. \nJolyon's son, Young Jolyon, is her trustee. Soames falls for a young French girl, Annette, whom he wants to marry. He goes in search for Irene for a divorce but has no current evidence for the divorce. \nInstead, he decides to try to win her back so he can have an heir. She runs from him and finds friendship and protection in Young Jolyon. \nSoames decides on a divorce after he finds Irene and Young Jolyon together and Irene tells him she and Young Jolyon are in love. Irene and Jolyon marry and have a son, \nwhile Soames marries Annette and has a daughter. Is this family scandal over? Is Irene finally free from Soames?\n\n\n\nStory\n\nVerenigd Koninkrijk\nRomantiek / Drama\nSpeelduur: 700 minuten\n\ngeregisseerd door Christopher Menaul en Dave Moore\nmet Damian Lewis, Rupert Graves en Gina McKee\n\nBevat alle 13 afleveringen met een totale speelduur van ruim 11 uur op 4 DVD's. \nIn de Forsyte Saga volgen we drie generaties van een machtige Londense familie, vanaf het Victoriaanse tijdperk tot in de twintigste eeuw. \nNaar de buitenwereld toe gedraagt de familie zich arrogant en vol zelfvertrouwen, maar onder alle pracht en praal schuilt \neen wereld van verdriet en onderlinge wreedheid, waarin spanningen en jaloezie een grote rol spelen. \nHet hoofd van de familie is Soames Forsyte, een rijke en succesvolle partner van het advocatenkantoor van de Forsytes, \ndie veel belang hecht aan de strenge Victoriaanse normen en waarden. Maar de moeizame relatie met zijn vrouw Irene zorgt voor veel onrust en onzekerheid. \nAls Irene een verhouding begint met de verloofde van zijn nicht, zorgt dit uiteraard voor grote conflicten binnen de familie. \nDe Forsyte Saga is een meesterwerk uit de Engelse literatuur. \nHet schetst op onnavolgbare wijze het leven van een rijke familie uit Londen in een turbulente periode in de geschiedenis. \nLiefde, overspel en bedrog, tegen een achtergrond van de luxueuze, oppervlakkige levensstijl van de betere stand eind negentiende, begin twintigste eeuw.\n\n\n\nINFO\n\nMEDIA TYPE: Retail DVD\nAUDIO: Engels DD 2.0\nVideo: 16:9 PAL\nSubs: Dutch\nCOVER: Yes\n\nMM:   &lt;a href=&quot; http://www.moviemeter.nl/film/29454&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.moviemeter.nl/film/29454&lt;/a&gt;\n\nIMDB:   &lt;a href=&quot; http://www.imdb.com/title/tt0260615/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0260615/&lt;/a&gt;","torrent":{"xt":"urn:btih:f0baa2c537981ee8cc5c64b84b1961758761d866","amp;dn":"Forsyte+Saga%2C+The+%282002%29%28Retail%29%28PAL%29+4xDVD5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0baa2c537981ee8cc5c64b84b1961758761d866","infoHashBuffer":{"type":"Buffer","data":[240,186,162,197,55,152,30,232,204,92,100,184,75,25,97,117,135,97,216,102]},"announce":[],"urlList":[]}}