{"title":"Eddie Ojeda featuring Dee Snider - Eleanor Rigby (2nafish)","uid":5470187,"size":81129476,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f0e8f5bfccf0a3109afd667af5db68ea7ba0fe49&amp;dn=Eddie+Ojeda+featuring+Dee+Snider+-+Eleanor+Rigby+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1269852011,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Eleanor Rigby&quot; is a song by The Beatles, simultaneously released on the 1966 album Revolver and on a 45rpm single. The song was written by Paul McCartney and John Lennon. With a double string quartet arrangement by George Martin, and striking lyrics about loneliness, the song continued the transformation of the group from a mainly pop-oriented act to a more serious and experimental studio band.\n\nTwisted Sister guitarist Eddie Ojeda recorded a cover version of the song for his 2006 solo album Axes 2 Axes. Dee Snider performed the vocals.\n\nEddie &quot;Fingers&quot; Ojeda (born August 5, 1955 in New York City, New York) is one of the two guitarists of the American heavy metal band Twisted Sister. In early 1970s he recorded a couple of singles with a band called SPX. He joined Twisted Sister in 1975. He also recorded a solo album named Axes To Axes in 2005 featuring Dee Snider, Ronnie James Dio and Rudy Sarzo among others. In a 2006 interview with rock &amp; roll comic C.C. Banana, Eddie revealed if Twisted Sister ever retired that it would still be possible for the band to continue performing under their alternate name Bent Brother.\n\nEddie, along with other popular rock guitarists in the mid-80's, performed in the Hear 'n Aid project, launched by Ronnie James Dio, which had a similar goal as both Band Aid and USA for Africa.\n\nIn 2006 he is heard singing in Spanish on the Twisted Sister album &quot;A Twisted Christmas&quot; as well as playing drums on the album.\n\nEddie toured with Steve Steinman on the &quot;Vampires Rock&quot; tour in late 2007.\n\nDavid Daniel &quot;Dee&quot; Snider (born March 15, 1955) is an American  singer-songwriter, screenwriter, radio personality, and actor. Snider is most famous for his role as the frontman of the heavy metal band Twisted Sister. He was ranked 83 in the Hit Parader's Top 100 Metal Vocalist of All Time.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:f0e8f5bfccf0a3109afd667af5db68ea7ba0fe49","amp;dn":"Eddie+Ojeda+featuring+Dee+Snider+-+Eleanor+Rigby+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0e8f5bfccf0a3109afd667af5db68ea7ba0fe49","infoHashBuffer":{"type":"Buffer","data":[240,232,245,191,204,240,163,16,154,253,102,122,245,219,104,234,123,160,254,73]},"announce":[],"urlList":[]}}