{"title":"Glary Utilities Pro Ver.(3.6.0.125) Final By ::munish83::","uid":8764258,"size":15606774,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f232fda5928fb004ad7c31732d8ee878c22419c9&amp;dn=Glary+Utilities+Pro+Ver.%283.6.0.125%29+Final+By+%3A%3Amunish83%3A%3A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Munish83","files":1,"time":1375299118,"description":"Glary Utilities is a collection of system tweaking and utilities for tweaking, improving overall productivity and protect your PC. This application allows the user to get rid of unnecessary files from the old records and history of Internet activity, by installing various plug-ins, you can achieve full compatibility of applications with more than 45 different programs. Furthermore, Glary Utilities optimizes the use of system memory, find, and fix or remove broken Windows shortcuts, manage the programs that start at Windows startup and uninstall software. It has support for Windows Vista and multi-lingual user interface, including support for Russian language. \n\nIncluded Set of Tools \n\nDisk Cleaner - Removes junk data from your disks and recovers disk space \nRegistry Cleaner - Clean Registry Scan and clean your registry to improve system performance. \nShortcuts Fixer - Corrects the errors in your startmenu &amp; desktop \nUninstall Manager - Uninstalls programs completely that you do not need any more \nStartup Manager - Manages programs which AutoRun \nMemory Optimizer - Monitors and optimizes free memory in the background \nContext Menu Manager - Manager context menu controls context menu for files and folders ... \nTracks Eraser - Erases all traces of the Internet: events, cookies, internet history ... \nFile Shredder - Erases files permanently so that no possibility of recovery. \nFile Undelete - A quick and effective way to restore accidentally deleted files \nFile Encrypter and Decrypter - Protects your files from unauthorized access and use. \nDisk Analyzer - Display disk space occupied by files and folders. \nFind duplicate files - Finds and removes duplicated and empty folders \nFile Splitter and Joiner - Splits large files into smaller manageable, and then rejoin. \nProcess Manager - Monitors programs that run on your computer, and blocking software - Spyware and Trojans. \nAssistant to Internet Explorer - Manages Internet Explorer Add \nWindows Standard Tools - Provides direct access to useful features of windows settings, the default \n","torrent":{"xt":"urn:btih:f232fda5928fb004ad7c31732d8ee878c22419c9","amp;dn":"Glary+Utilities+Pro+Ver.%283.6.0.125%29+Final+By+%3A%3Amunish83%3A%3A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f232fda5928fb004ad7c31732d8ee878c22419c9","infoHashBuffer":{"type":"Buffer","data":[242,50,253,165,146,143,176,4,173,124,49,115,45,142,232,120,194,36,25,201]},"announce":[],"urlList":[]}}