{"title":"Transmission Torrent client for Nokia N900-khaled777","uid":5461132,"size":225,"categoryP":"applications","categoryS":"handheld","magnet":"?xt=urn:btih:f4f57060207e0cc8fb1f5a7d6b3504e176f77864&amp;dn=Transmission+Torrent+client+for+Nokia+N900-khaled777&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"khaled777","files":2,"time":1269470883,"description":"Transmission is a torrent client for Nokia N900 that enables you to download torrents just like on your PC. The application is available in the Extras Devel repository which means that the Transmission torrent app is not released for general public yet, due to few bugs (the bittorrent app is still in beta development stage). But apart from that we found that Transmission worked well on our Nokia N900 and we were able to download with ease.\n\nPlease note that when downloading large files the torrent app will freeze for a while, which is normal due to the amount of data it has to allocate or extend on the memory card. We even tried downloading two and more torrents at the same time and the app seems to manage the whole process well, but if you want to use your Nokia N900 without any slowdowns, one download at a time works best.\n\nAnd a few final notes, although I would prefer to download torrents on to my PC, sometimes having a torrent client on your Nokia N900 can be a quite useful thing. For example, when you travel, you can use you hotel's WiFi to stay up to date with your favorite series and download other things you might want to have at that particular time. I must admit that the video playback on Nokia N900 is as good as it can get on a mobile device and the best thing is that you can play the video files right after you download them with the Transmission torrent app. No need to convert them into a mobile friendly format like it was the case with other mobile phones. \n\nYou can find out more about the Transmission project on other platforms here! Also please you this app over WiFi to download torrents in order to avoid data plan costs that might arise from the vast amount of MB movie downloads generate.","torrent":{"xt":"urn:btih:f4f57060207e0cc8fb1f5a7d6b3504e176f77864","amp;dn":"Transmission+Torrent+client+for+Nokia+N900-khaled777","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4f57060207e0cc8fb1f5a7d6b3504e176f77864","infoHashBuffer":{"type":"Buffer","data":[244,245,112,96,32,126,12,200,251,31,90,125,107,53,4,225,118,247,120,100]},"announce":[],"urlList":[]}}