{"title":"Green Jelly - Three Little Pigs (2nafish)","uid":5634762,"size":216637444,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f7cc769d984f80c0972b1d911c6ba9429b62fda2&amp;dn=Green+Jelly+-+Three+Little+Pigs+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1276838452,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Three Little Pigs&quot; is a song by the comedy heavy metal band Green JellÃƒÂ¶, from the album Cereal Killer, released by Zoo Entertainment in 1992.\n\nThe single was later re-released in 1993 under the name Green JellÃƒÂ¿, due to a lawsuit. The song reached #17 on the Billboard Hot 100 in the summer of 1993, and charted even higher in the UK, where it reached #5. The chart success can be partly attributed to the song's unique and heavily-aired music video. The song was ranked #35 on VH1's 40 Most Awesomely Bad Metal Songs...Ever\n\nThe song's claymation music video received regular rotation on MTV, and in 1993 it was certified gold by the RIAA. &quot;Three Little Pigs&quot; was notable for being the first known music single to debut only in video form; when the music video was first shown on MTV, fans could buy the song on videotape, but not on CD. In 1993, however, the single was finally released in CD form.\n\nWritten by Marc Levinthal  and Bill Manspeaker after a &quot;late-night drinkfest&quot; at Zatar's in Hollywood, the song is a re-telling of the classic fairy tale Three Little Pigs, with modern twists such as pot-smoking pigs, an appearance by Rambo  and a Harley-Davidson-riding wolf.\n\n&quot;Three Little Pigs&quot; features a cameo by talk show host Rick Emerson, who was the schoolmate of Green JellÃƒÂ¿ singer Bill Manspeaker. Emerson sings the falsetto line &quot;Not by the hair of my chinny chin chin.&quot;. Maynard James Keenen from Tool actually does the chorus.\n\nCereal Killer is a video-only album released by comedy  metal/punk group Green JellÃƒÂ¶ in 1991. The entire album was later re-released as a CD in 1993 as the Cereal Killer Soundtrack.\n\nGreen JellÃƒÂ¿ (pronounced &quot;green jello&quot;) is a Grammy-nominated comedy rock group. Originally named Green JellÃƒÂ¶, the band changed its name due to legal pressure from the owners of the Jell-O trademark, Kraft Foods, who claimed that it was an infringement of their trademark. Despite the spelling difference, the new name and the old are pronounced identically.\n\nIn 1991, the band approached BMG subsidiary label Zoo Entertainment, and claiming they were the &quot;World's First Video Only Band,&quot; offered to make the entire project (all music, videos, artwork, etc.) entirely on their own for the unheard-of sum of $50,000. Zoo signed them on the spot. The only problem was, it had been a bluff, and the band had never made a &quot;video album&quot; before. After buying a video camera, some wood and some lights, the band set out to learn on the job, and in Fall 1992 delivered their third album, the long-form video-only Cereal Killer. Consisting of music videos for each song, as well as a behind-the-scenes feature, the video album slowly gained a reputation in underground (although it would eventually go on to sell over 100,000 copies). Their break came when a radio station in Seattle, Washington, KXRX, played &quot;Three Little Pigs&quot; as a joke, but instead the station's phones lit up and it became a local hit. This caused Zoo to issue the EP Green JellÃƒÂ¶ SUXX, consisting of four songs from Cereal Killer, which in turn led to the &quot;The Three Little Pigs&quot; becoming a hit on &quot;The Box&quot; (A pay-per-play cable-TV jukebox network). By early 1993, the song was gaining airplay around the country, and after appearing on MTV Headbanger's Ball, everything exploded. MTV added the video and the full-length audio album Cereal Killer Soundtrack was finally released in April 1993.\n\nThe video for &quot;The Three Little Pigs&quot; was directed by Fred Stuhr (who also directed Tool's &quot;Sober&quot; video), and it featured a claymation rendition of the classic fairy tale with modern twists, such as pot-smoking pigs, an appearance by Rambo, and a Harley Davidson-riding wolf. The video was an instant hit on MTV and was #17 for most of the summer of 1993 in the US, receiving both an MTV music award and Billboard music award nomination. Meanwhile in the UK the song entered the singles chart at number 5 (the highest rock debut in the history of the British charts at the time), though this proved to be its peak position. As a result of the &quot;The Three Little Pigs&quot; video, the Cereal Killer Soundtrack album went gold in the US, New Zealand, and Canada, as well as platinum in Australia, eventually selling over 2Ã‚Â½-million units worldwide. Green JellÃƒÂ¶ spent almost a year touring the US and Europe in support of the Cereal Killer Soundtrack.\n\nLater in 1993, Green JellÃƒÂ¿ released a single that was not to be included on any of their full-length albums: a duet with Hulk Hogan performing Garry Glitter's classic song I'm the Leader of the Gang (I Am), which scored them a third Top 40 hit in the UK.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:f7cc769d984f80c0972b1d911c6ba9429b62fda2","amp;dn":"Green+Jelly+-+Three+Little+Pigs+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7cc769d984f80c0972b1d911c6ba9429b62fda2","infoHashBuffer":{"type":"Buffer","data":[247,204,118,157,152,79,128,192,151,43,29,145,28,107,169,66,155,98,253,162]},"announce":[],"urlList":[]}}