{"title":"Abominable Science!: Origins of the Yeti, Nessie, and Other(2013","uid":8857277,"size":29098440,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fb5133263911c64f00b350d92a619f5ba1f030c4&amp;dn=Abominable+Science%21%3A+Origins+of+the+Yeti%2C+Nessie%2C+and+Other%282013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bookzilla","files":1,"time":1377648977,"description":"Abominable Science!: Origins of the Yeti, Nessie, and Other Famous Cryptids\n\nepub\n\n\nThroughout our history, humans have been captivated by mythic beasts and legendary creatures. Tales of Bigfoot, the Yeti, and the Loch Ness monster are part of our collective experience. Now comes a book from two dedicated investigators that explores and elucidates the fascinating world of cryptozoology.\n \nDaniel Loxton and Donald R. Prothero have written an entertaining, educational, and definitive text on cryptids, presenting the arguments both for and against their existence and systematically challenging the pseudoscience that perpetuates their myths. After examining the nature of science and pseudoscience and their relation to cryptozoology, Loxton and Prothero take on Bigfoot; the Yeti, or Abominable Snowman, and its cross-cultural incarnations; the Loch Ness monster and its highly publicized sightings; the evolution of the Great Sea Serpent; and Mokele Mbembe, or the Congo dinosaur. They conclude with an analysis of the psychology behind the persistent belief in paranormal phenomena, identifying the major players in cryptozoology, discussing the character of its subculture, and considering the challenge it poses to clear and critical thinking in our increasingly complex world.\n\n2013","torrent":{"xt":"urn:btih:fb5133263911c64f00b350d92a619f5ba1f030c4","amp;dn":"Abominable+Science%21%3A+Origins+of+the+Yeti%2C+Nessie%2C+and+Other%282013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb5133263911c64f00b350d92a619f5ba1f030c4","infoHashBuffer":{"type":"Buffer","data":[251,81,51,38,57,17,198,79,0,179,80,217,42,97,159,91,161,240,48,196]},"announce":[],"urlList":[]}}