{"title":"Opie and Anthony 2010-05-11-O&amp;A-CF64K","uid":5553815,"size":120362483,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:fc6f7513d2156ccfa2d021fb511db4fc26e2044d&amp;dn=Opie+and+Anthony+2010-05-11-O%26A-CF64K&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"shuazien","files":-1,"time":1273621930,"description":"Opie and Anthony May 11th, 2010\n\nWeird copy today, part of the  reason it is late.\n\nDuuuuude...You know... You've got a new baby... You're short a host... You got a comedian... Maybe a guest.... Some jokes, laughter, good times.... BOOM!!! You got the Anthony and Jimmy Show. All surrounded by incompetence.\n\nSirius XM Satellite Radio\nShow, English, MP3\n\nThanks to Opie, Anthony, Jim Norton, Tippy Tom, Sam Roberts, Danny, &quot;Uncle&quot; Paul Hauguss, &quot;Fat&quot; Bob Kelly, Loius CK, Travis, Club Soda Kenny, Awesome &quot;Stinky&quot; Garret, E-Rock, Francine, Lyle &quot;Chip&quot; Chiperson, Steven S, Jim Jeffries, Theodoor Scheckler, Bill Burr, Bob Levy, Jim Florentine, Jay Moyre, Ian &quot;Google it!!&quot; Halperin, Mike Tyson, Turk February, Steve C, Otto, George, Pat from Moonaki, Frenchie, Brother Wease, Andrew Dice Clay, Bill the WOW sticker guy, Mothergoose56, kurt, Lemmata, jonnychadootz, Leeham, frrrrruuunkis, VastLite, Supertank66, shocxxx, willgates, buzzard8, apemeat, a1958wil, monobrowj, Joozeppy, junkygood, Metal_Is_4_Eva, tnvkenyon, ratnut12, blackirishlad, djskittles, moneys2, in2fitness, corduroy32, Luminol18, nester024 , TokenWGuy, wiretapstudios, SeeSirInn, kalinmlin , celticfc735, DEDWINHEDON, Ob5oLeTe, Nomoriko, uprock537, loveyafez, CJ, Unkelerb, parabolix, asok75, SissyCuckboy, grey151, wozardking, polyonymous, theolin, PsychicStoner, all the stoners, TrAnCeRx, djsickgravity, djnigelharkness, jakepwright, willie838, minder125, phrosen, nullified, unclevictim, illeffeqt, ShinSolidus, PatrickB, MIKED860, Mmmmike!!, GutesChicken, lou, bjornkeizers, cpnthrfan, boshine9, Morter, lambpit, xloosefusion, eminem04082, Sticky79, bosoxfan226, redrum. DEDWINHEDON, capnmorg1, VoodoBlade, kost0130, OandApartyrocks22, atheos101, dommafia, Hobo_jim,  intotheknife, clauge, MaXFail, bloodyjimbonne, schwoogie, Fred, George, Bill, S****E*** , Schwigger, Me, RAAAAAAMOOOONE!!!, ect.\n\nand Bobo &amp; BoxMac, I guess...ick!\n\n:P\n\nSpread the Virus!!\n\nDon't forget the high quality Rips that Mothergoose56 does later in the day. That's the good stuff, man.","torrent":{"xt":"urn:btih:fc6f7513d2156ccfa2d021fb511db4fc26e2044d","amp;dn":"Opie+and+Anthony+2010-05-11-O%26A-CF64K","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc6f7513d2156ccfa2d021fb511db4fc26e2044d","infoHashBuffer":{"type":"Buffer","data":[252,111,117,19,210,21,108,207,162,208,33,251,81,29,180,252,38,226,4,77]},"announce":[],"urlList":[]}}