{"title":"Alex Jones Show - 2013 Jul 22 MO [sebaygo1]","uid":8727453,"size":64117035,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:fcaf3c2c2973790221736565085f59c4be013742&amp;dn=Alex+Jones+Show+-+2013+Jul+22+MO+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sebaygo1","files":12,"time":1374534989,"description":"\t\t\t\t\t\t\t\nThe Alex Jones Show\nMonday, 22 July 2013\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the Infowars web site :: On the July 22 edition of The Alex Jones Show, Alex will continue the discussion on the race war that's being promoted by our main stream media outlets. \n\nAlex talks with American film and television actor Ed Asner. \n\nAlex also interviews radio and television personality Larry Elder about his recent appearance on the Piers Morgan show where he defeated Piers in a debate about the true problems facing blacks in today's world. The Larry Elder Show airs weekdays on talk radio KABC in Los Angeles in which he supports free trade, school choice, same-sex marriage and abortion rights. Elder has authored several books and produced a DVD in which he attempts to repudiate filmmaker Michael Moore's anti-gun politics. \n\nAlex covers more details on the NSA spy scandal as new facts continue to emerge revealing how Obamacare is set to destroy the last of our privacy rights.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n.\n","torrent":{"xt":"urn:btih:fcaf3c2c2973790221736565085f59c4be013742","amp;dn":"Alex+Jones+Show+-+2013+Jul+22+MO+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fcaf3c2c2973790221736565085f59c4be013742","infoHashBuffer":{"type":"Buffer","data":[252,175,60,44,41,115,121,2,33,115,101,101,8,95,89,196,190,1,55,66]},"announce":[],"urlList":[]}}