{"title":"The Jacksons - Show You The  Way  To  Go (2nafish)","uid":5637056,"size":206528516,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ff0378529d4f5dc0ffe9bb89c49ff090055ffa57&amp;dn=The+Jacksons+-+Show+You+The++Way++To++Go+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1276932797,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThe Jacksons - Show You The Way To Go (Beat Club) (2nafish)\n\n\n\n&quot;Show You the Way to Go&quot; was a song written by Kenny Gamble and Leon Huff and released as a single in 1977 originally by The Jacksons. It was the first number-one song for the group in Britain. It was later covered by Dannii Minogue.\n\nA 1976 hit for The Jackson 5 now known as The Jacksons after their departure from Motown nearly two years prior. Though the move made it easy for the brothers to write and produce their own material, they spent a couple of years under the production and direction of fellow soul  pioneers Kenny Gamble &amp; Leon Huff and under their own label, Philadelphia International. This was one of the songs that the producers backed the young men on and for lead singer Michael professionally, he had shown a lot of vocal growth. Marlon, however, had a backup part. As the song reached a bridge, Gamble &amp; Huff had 18-year-old Michael hitting notes and bridges that he probably would've been restricted to sing in at Motown. Michael's breakdown possibly helped the song reach #6 R&amp;B, #28 Pop and #1 UK. In fact, it was a milestone overseas for the Jacksons because it was the family unit's only #1 single in the UK. A year later, the Jacksons left Philadelphia International for Epic where their greatest success was near. Michael has said that this is one of his favorites during this period and that he was surprised that it wasn't a bigger hit.\n\nIn 1992 it was recorded for the NME charity album Ruby Trax by Dannii Minogue and subsequently released as a single, reaching #30 on the UK singles chart in August of that year.\n\nThe Jackson 5 (also spelled The Jackson Five, or The Jackson 5ive), later known as The Jacksons, are an American popular music family group from Gary, Indiana. Founding group members Jackie, Tito, Jermaine, Marlon and Michael formed the group after performing in an early incarnation called The Jackson Brothers, which originally consisted of a trio of the three older brothers. Active from 1964 to 1989, the Jacksons played from a repertoire of R&amp;B, soul, pop and later disco. During their six and a half-year Motown tenure, The Jackson 5 were one of the biggest pop-music phenomena of the 1970s, and the band served as the launching pad for the solo careers of their lead singers Jermaine and Michael, the latter brother later transforming his early Motown solo fame into greater success as an adult artist.\n\nThe Jackson 5 were the first act in recording history to have their first four major label singles (&quot;I Want You Back&quot;, &quot;ABC&quot;, &quot;The Love You Save&quot;, and &quot;I'll Be There&quot;) reach the top of the Billboard Hot 100. Several later singles, among them &quot;Mama's Pearl&quot;, &quot;Never Can Say Goodbye&quot; and &quot;Dancing Machine&quot;, were Top 5 pop hits and number-one hits on the R&amp;B singles chart. Most of the early hits were written and produced by a specialized songwriting team known as &quot;The Corporation&quot;; later Jackson 5 hits were crafted chiefly by Hal Davis, while early Jacksons hits were compiled by the team of Gamble and Huff before The Jacksons began writing and producing themselves in the late 1970s.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:ff0378529d4f5dc0ffe9bb89c49ff090055ffa57","amp;dn":"The+Jacksons+-+Show+You+The++Way++To++Go+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff0378529d4f5dc0ffe9bb89c49ff090055ffa57","infoHashBuffer":{"type":"Buffer","data":[255,3,120,82,157,79,93,192,255,233,187,137,196,159,240,144,5,95,250,87]},"announce":[],"urlList":[]}}