{"title":"Sexually Broken--Cherry Torn lashed to beam stuffed full of cock","uid":8816477,"size":1190433596,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:ff33a241d55a77af300525ffc53ce873308a918b&amp;dn=Sexually+Broken--Cherry+Torn+lashed+to+beam+stuffed+full+of+cock&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1376598263,"description":"\nCherry Torn lashed to a beam and stuffed full of cock from both ends! | Cherry Torn | Matt Williams\n\nAugust 14, 2013 \n \n\nMP4 only.\n \n \nCherry Torn can take it and take it hard. There is very little left this eager slut hasn't tried three times over. So what do you do with someone like that? The solution is simple: Bind the bitch to a beam and drill both ends until her eyes glaze over and fluid is leaking from all of her well-used holes. Add in some neck rope for her to choke herself a little if she wants (and of course she does) and you have a spit-roasted well-done Cherry Torn.\n\nOnce Cherry is firmly tied down and properly decorating the giant wooden beam we have laying around our studio, we start out with some bastinado and flogging, just to warm our little slut up. She craves the pain as much as she craves the cock. Her neck tie keeps her nicely arched and exposed and we have to reward her suffering-with cock down her waiting throat. There is no mercy, no holding back, it is a relentless drilling of her mouth hole while she drools and sputters and gasps. Turning a throat into a pussy is one of our favorite pastimes here at Sexuallybroken.\n\nThat phat bubble butt is calling out for some cock as well, and we are nothing if not generous. We slid into to the hilt and fuck her cross-eyed. She can't escape the sensations rippling through her bound body, it is too much for her, and her brain starts to overload. That is when we add the vibrator to the mix. Caned, flogged, face-fucked, choked and vibrated, Cherry checks out. She is a whimpering, drooling, moaning mess of tied-up girl flesh. Which is just how we like them around here. We leave her spent and lashed down, waiting for the next time we feel like using her holes.\n\nCherry might of tried just about everything there is to try, but something tells us she won't be forgetting today anytime soon.. \n\nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/08_14ctorn6/SexuallyBroken-Cherry-Torn-Matt-Williams-Cherry-Torn-lashed-to-a-beam-and-stuffed-full-of-cock-from-both-ends.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/08_14ctorn6/SexuallyBroken-Cherry-Torn-Matt-Williams-Cherry-Torn-lashed-to-a-beam-and-stuffed-full-of-cock-from-both-ends.php&lt;/a&gt;\n\n11 000 uploads and counting, 12k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n\n\n\n","torrent":{"xt":"urn:btih:ff33a241d55a77af300525ffc53ce873308a918b","amp;dn":"Sexually+Broken--Cherry+Torn+lashed+to+beam+stuffed+full+of+cock","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff33a241d55a77af300525ffc53ce873308a918b","infoHashBuffer":{"type":"Buffer","data":[255,51,162,65,213,90,119,175,48,5,37,255,197,60,232,115,48,138,145,139]},"announce":[],"urlList":[]}}