{"title":"Victory Day Parade on the Red Square, Moscow, May 9, 2010","uid":5603214,"size":2305261504,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:ffaa479af6ebb5b1c6a58b5892ae2c6dee531c08&amp;dn=Victory+Day+Parade+on+the+Red+Square%2C+Moscow%2C+May+9%2C+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"irkutsky","files":1,"time":1275426872,"description":"This is is the Victory Day parade that took place in Moscow, on May 9, 2010. In the US we usually call it the VD in Europe, because there was still bitter fighting on the Pacific theater. But for the Russians that was the end of what they call The Great Patriotic War. \n\nRussians love to organize parades. So even though there's no English translation and thus you will not understand the short speech of the Russian president, the rest of it is a pure 'eye candy' - various uniforms, music, nice marching, military hardware, air show.\n\nBesides, this is the first time when the military units from the US, UK, France and Poland participated in such event. Also, the military orchestras from the US and France participated in the final musical piece. Military units from the former Soviet republics also took part in the parade. Here it would be interesting to point out that the units from the countries who fought a bitter war some time ago - Azerbaijan and Armenia were marching one after the other.\n\nThe parade starts with the Russian Minister of Defense reviewing and greeting the parade participants with the Chief of Moscow Military. \n\nThis is something you won't see on our TVs especially when our former Cold War adversaries march together with the representatives of the Western armed forces.","torrent":{"xt":"urn:btih:ffaa479af6ebb5b1c6a58b5892ae2c6dee531c08","amp;dn":"Victory+Day+Parade+on+the+Red+Square%2C+Moscow%2C+May+9%2C+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffaa479af6ebb5b1c6a58b5892ae2c6dee531c08","infoHashBuffer":{"type":"Buffer","data":[255,170,71,154,246,235,181,177,198,165,139,88,146,174,44,109,238,83,28,8]},"announce":[],"urlList":[]}}